{
    "Chapter II – Content of a European patent application (other than claims)": {
        "1. ": {
            "title": "General The requirements for a European patent application are set out in Art. 78.",
            "subsections": {
                "1.1": {
                    "content": "SI base units Quantity Unit Name Symbol Length metre m Mass kilogram kg Time second s Electric current ampere A Thermodynamic temperature kelvin K Amount of substance mole mol Luminous intensity candela cd Definitions of SI base units: – Unit of time The second, symbol s, is the SI unit of time. It is defined by taking the fixed numerical value of the caesium frequency ΔνCs, the unperturbed ground-state hyperfine transition frequency of the caesium 133 atom, to be 9 192 631 770 when expressed in the unit Hz, which is equal to s–1. – Unit of length The metre, symbol m, is the SI unit of length. It is defined by taking the fixed numerical value of the speed of light in vacuum c to be 299 792 458 when expressed in the unit m/s, where the second is defined in terms of ΔνCs. – Unit of mass The kilogram, symbol kg, is the SI unit of mass. It is defined by taking the fixed numerical value of the Planck constant h to be 6.626 070 15 × 10–34 when expressed in the unit J s, which is equal to kg m2 s–1, where the metre and the second are defined in terms of c and ΔνCs. – Unit of electric current The ampere, symbol A, is the SI unit of electric current. It is defined by taking the fixed numerical value of the elementary charge e to be"
                },
                "1.602": {
                    "content": "176 634 × 10–19 when expressed in the unit C, which is equal to A s, where the second is defined in terms of ΔνCs. – Unit of thermodynamic temperature The kelvin, symbol K, is the SI unit of thermodynamic temperature. It is defined by taking the fixed numerical value of the Boltzmann constant k to be 1.380 649 × 10–23 when expressed in the unit J K–1, which is equal to kg * Mainly based on Chapter I of the Annex to EEC Directive 80/181/EEC of 20.12.1979, as amended by EEC Directives 85/1/EEC of 18.12.1984, 89/617/EEC of 27.11.1989, 1999/103/EC of 24.01.2000, 2009/3/EC of 11.03.2009 and Commission Directive (EU) 2019/1258 of 23.07.2019. m2 s–2 K–1, where the kilogram, metre and second are defined in terms of h, c and ΔνCs. – Unit of amount of substance The mole, symbol mol, is the SI unit of amount of substance. One mole contains exactly 6.022 140 76 × 1023 elementary entities. This number is the fixed numerical value of the Avogadro constant, NA, when expressed in the unit mol–1 and is called the Avogadro number. The amount of substance, symbol n, of a system is a measure of the number of specified elementary entities. An elementary entity may be an atom, a molecule, an ion, an electron, any other particle or specified group of particles. – Unit of luminous intensity The candela, symbol cd, is the SI unit of luminous intensity in a given direction. It is defined by taking the fixed numerical value of the luminous efficacy of monochromatic radiation of frequency 540 × 1012 Hz, Kcd, to be 683 when expressed in the unit lm W–1, which is equal to cd sr W–1, or cd sr kg–1 m–2 s3, where the kilogram, metre and second are defined in terms of h, c and ΔνCs.",
                    "subsections": {
                        "1.1.1": {
                            "content": "Special name and symbol of the SI derived unit of temperature for expressing Celsius temperature Quantity Unit Name Symbol Celsius temperature degree Celsius °C Celsius temperature t is defined as the difference t = T-T0 between the two thermodynamic temperatures T and T0 where T0 = 273.15 K. An interval of or difference in temperature may be expressed either in kelvins or in degrees Celsius. The unit of \"degree Celsius\" is equal to the unit \"kelvin\"."
                        }
                    }
                },
                "1.2": {
                    "content": "SI derived units",
                    "subsections": {
                        "1.2.1": {
                            "content": "General rule for SI derived units Units derived coherently from SI base units are given as algebraic expressions in the form of products of powers of the SI base units with a numerical factor equal to 1."
                        },
                        "1.2.2": {
                            "content": "SI derived units with special names and symbols Quantity Unit Expression Name Symbol In other SI units In terms of SI base units Plane angle radian rad m·m-1 Solid angle steradian sr m2·m-2 Frequency hertz Hz s-1 Force newton N m·kg·s-2 Pressure, stress pascal Pa N·m-2 m-1·kg·s-2 Energy, work; quantity of heat joule J N·m m2·kg·s-2 Power(1), radiant flux watt W J·s-1 m2·kg·s-3 Quantity Unit Expression Name Symbol In other SI units In terms of SI base units Quantity of electricity, electric charge coulomb C s·A Electric potential, potential difference, electromotive force volt V W·A-1 m2·kg·s-3·A-1 Electric resistance ohm Ω V·A-1 m2·kg·s-3·A-2 Conductance siemens S A·V-1 m-2·kg-1·s3·A2 Capacitance farad F C·V-1 m-2·kg-1·s4·A2 Magnetic flux weber Wb V·s m2·kg·s-2·A-1 Magnetic flux density tesla T Wb·m-2 kg·s-2·A-1 Inductance henry H Wb·A-1 m2·kg·s-2·A-2 Luminous flux lumen lm cd·sr cd Illuminance lux lx lm·m-2 m-2·cd Activity (of a radionuclide) becquerel Bq s-1 Absorbed dose, specific energy imparted, kerma, absorbed dose index gray Gy J·kg-1 m2·s-2 Dose equivalent sievert Sv J·kg-1 m2·s-2 Catalytic activity katal kat mol·s-1 (1) Special names for the unit of power: the name volt-ampere (symbol \"VA\") is used to express the apparent power of alternating electric current, and var (symbol \"var\") is used to express reactive electric power. Units derived from SI base units may be expressed in terms of the units listed in this annex. In particular, derived SI units may be expressed by the special names and symbols given in the above table. For example, the SI unit of dynamic viscosity may be expressed as m-1.kg.s-1 or N.s.m-2 or Pa.s."
                        }
                    }
                },
                "1.3": {
                    "content": "Prefixes and their symbols used to designate certain decimal multiples and submultiples Factor Prefix Symbol Factor Prefix Symbol 1024 yotta Y 10-1 deci d 1021 zetta Z 10-2 centi c 1018 exa E 10-3 milli m 1015 peta P 10-6 micro µ 1012 tera T 10-9 nano n 109 giga G 10-12 pico p 106 mega M 10-15 femto f 103 kilo k 10-18 atto a 102 hecto h 10-21 zepto z 101 deca da 10-24 yocto y The names and symbols of the decimal multiples and submultiples of the unit of mass are formed by attaching prefixes to the word \"gram\" and their symbols to the symbol \"g\". Where a derived unit is expressed as a fraction, its decimal multiples and submultiples may be designated by attaching a prefix to units in the numerator or the denominator, or in both these parts. Compound prefixes, that is to say prefixes formed by the juxtaposition of several of the above prefixes, may not be used."
                },
                "1.4": {
                    "content": "Special authorised names and symbols of decimal multiples and submultiples of SI units Quantity Unit Name Symbol Value Volume litre l or L(1) 1 l = 1 dm3 = 10-3 m3 Mass tonne t 1 t = 1 Mg = 103 kg Pressure, stress bar bar 1 bar = 105 Pa Length Ångström Å 1 Å = 10-10 m (1) The two symbols \"l\" and \"L\" may be used for the litre unit. The prefixes and their symbols listed in F-II, Annex 2, 1.3 may be used in conjunction with the units and symbols contained in this table."
                }
            },
            "content": " The application must contain: (i) a request for the grant of a European patent; (ii) a description of the invention; (iii) one or more claims; (iv) any drawings referred to in the description or the claims; and (v) an abstract. This Chapter deals with all these requirements, in so far as they are the concern of the search or examining division, with the exception of item (iii) which is the subject of Chapter F-IV. Item (v) is dealt with first. (e.g. aagtgttcctagtg), and"
        },
        "2. ": {
            "title": "Abstract",
            "subsections": {
                "2.1": {
                    "content": "Purpose of the abstract The application must contain an abstract. The purpose of the abstract is to give brief technical information about the disclosure as contained in the description, claims and any drawings. The abstract is merely for use as technical information and in particular cannot be used for the purpose of interpreting the scope of the protection sought. The abstract needs to be drafted so that it constitutes an efficient instrument for searching in the particular technical field and for evaluating if it is worth considering the whole content of the application."
                },
                "2.2": {
                    "content": "Definitive content The abstract is initially supplied by the applicant. The search division has the task of determining its definitive content, which will normally be published with the application. In doing this, it considers the abstract in relation to the application as filed (see B-X, 7(i)). If the search report is published later than the application, the abstract, published with the application will be the one resulting from the examination referred to in B-X, 7(i), third sentence. In determining the definitive content, the search division takes into consideration the purpose of the abstract (see F-II, 2.1)."
                },
                "2.3": {
                    "content": "Content of the abstract The abstract must: (i) indicate the title of the invention (ii) indicate the technical field to which the invention pertains; (iii) contain a concise summary of the disclosure as contained in the description, the claims and any drawings, which must be so drafted as to allow a clear understanding of the technical problem, the gist of the solution of that problem through the invention and the principal use or uses of the invention and, where applicable, it should contain the chemical formula which, among those contained in the application, best characterises the invention; (iv) not contain statements on the alleged merits or value of the invention or its speculative application; (v) preferably not contain more than one hundred and fifty words; and (vi) if the application contains drawings, be accompanied by an indication of the figure or exceptionally more than one figure of the drawings which should accompany the abstract. Each main feature mentioned in the abstract and illustrated by a drawing needs to be followed by a reference sign in parenthesis."
                },
                "2.4": {
                    "content": "Figure accompanying the abstract The search division considers not only the text of the abstract but also the selection of the figures for publication with it. It alters the text to the extent that this may be necessary in order to meet the requirements set out in F-II, 2.3. The search division will select a different figure, or figures, of the drawings if it considers that they better characterise the invention. The search division may prevent the publication of any drawing with the abstract, where none of the drawings present in the application is useful for the understanding of the abstract. This can be done even when the applicant has requested that a particular drawing or drawings be published with the abstract according to Rule 47(4). In determining the content of the abstract, the search division concentrates on conciseness and clarity, and refrains from introducing alterations merely for the purpose of embellishing the language (see B-X, 7)."
                },
                "2.5": {
                    "content": "Checklist In considering the abstract, the search division checks it against the General Guidelines for the Preparation of Abstracts of Patent Documents, using the checklist contained in WIPO Standard ST.12, the relevant parts of which are annexed to this Chapter (F-II, Annex 1)."
                },
                "2.6": {
                    "content": "Transmittal of the abstract to the applicant The content of the abstract is transmitted to the applicant together with the search report (see B-X, 7(i))."
                },
                "2.7": {
                    "content": "Abstract in examination The general considerations relating to the abstract are set out in F-II, 2.1 to F-II, 2.6. The abstract relates to the application as filed and published and its final form for publication is determined by the search division. It is not necessary to bring it into conformity with the content of the published patent even if this should differ in substance from that of the application, since the patent specification does not contain an abstract. The examining division therefore does not seek any amendment of the abstract. The abstract has no legal effect on the application containing it; for instance, it cannot be used to interpret the scope of protection or to justify the addition to the description of new subject-matter."
                }
            },
            "content": " According to ST.26, \"specifically defined\" residues are any nucleotide other than those represented by the symbol \"n\" and any amino acid other than those represented by the symbol \"X\", listed in Annex I (see paragraph 3(k) of WIPO Standard ST.26). Degenerate symbols representing a subgroup of residues are considered as specifically defined. For example, the degenerate nucleotide symbol \"s\" (used to represent \"c\" or \"g\" as defined in Annex I, Table 1 of ST.26) is specifically defined. Sequences containing fewer than ten specifically defined nucleotides, or fewer than four specifically defined amino acids must not be included in the sequence listing (WIPO Standard ST.26, paragraph 8). If a sequence is only disclosed in prose, i.e. a text describing the sequence, but the sequence is not enumerated, then the sequence does not have to be included, but may be included if the applicant wishes so. For instance, if the application refers to a partial sequence as follows: \"nucleotides 90-179 of SEQ ID NO. 1\", the partial sequence is described in prose only and, therefore, does not have to be entered as a separate SEQ ID in the sequence listing. However, if the partial sequence was described by enumerating only the residues between positions 90 and 179, then paragraph 7 of WIPO Standard ST.26 would apply and the partial sequence would have to be included in the sequence listing. If an enumerated sequence comprises regions of specifically defined residues separated by one or more gaps of n or X, i.e. residues that are not specifically defined, the representation of this sequence in the sequence listing depends on whether the exact number of n or X residues is known (see WIPO Standard ST.26, paragraph 36) or unknown (see WIPO Standard ST.26, paragraph 37). For example, considering that the following sequence is enumerated in the application: a10nxt12 if the number of \"n\" residues is known, e.g. x=2, the sequence should be represented as a single SEQ ID (if it also meets the minimal length requirement as defined in paragraph 7 or ST.26 and in F-II, 6.2.1) as follows: aaaaaaaaaanntttttttttttt If the number of \"n\" residues is unknown, each region of specifically defined residues that meets the minimal length requirement in paragraph 7 of WIPO Standard ST.26 must be included in the sequence listing as a separate SEQ ID. For example, for the sequence: a10nxt12 the sequence listing must have two entries SEQ ID No. 1: aaaaaaaaaa SEQ ID No. 2: tttttttttttt The sequences should be annotated to indicate that they are part of the same molecule and separated by an undefined number of \"n\" residues (see example 37-2 of Annex VI of WIPO Standard ST.26). If a range is disclosed, e.g. x= 5-10 nucleotides, the sequence should be represented as a single SEQ ID comprising 5 n or 10 n (see example 36-3 of Annex VI of WIPO Standard ST.26). In the above example, the sequence must either comprise 5 n or 10 n. In both cases, the SEQ ID must be annotated with a \"note\" qualifier. In cases where the sequence comprises 5 n, the note should indicate that up to 5 n can be added. In cases where the sequence comprises 10 n, the note should indicate that up to 5 n can be deleted. The appropriate feature key must be associated with the \"note\" qualifier describing the variant. See paragraph 96 of WIPO Standard ST.26 and F-II, 6.2.3 for information on selecting the correct feature key. Alternatively, if a range is disclosed, e.g. x= 5-10 nucleotides, all possible variants may be represented independently, i.e. as separate SEQ IDs. of SEQ ID No. 1 are deleted or substituted by another sequence\", then paragraph 95 of WIPO Standard ST.26 applies. This paragraph defines that these variants should be described by annotation of the primary sequence. It is a recommendation but it is not compulsory as long as the specific variant sequence is not enumerated as such in the application. If the applicant chooses to enter this information in the sequence listing, the following rules as defined in paragraph 95 of ST.26 should be followed: (a) the variant may be represented by annotation of the primary sequence, where it contains variation(s) at a single location or multiple distinct locations and the occurrences of those variations are independent, (b) the variant should be represented as a separate sequence and assigned its own sequence identification number, where it contains variations at multiple distinct locations and the occurrences of those variations are interdependent, and (c) must be represented as a separate sequence and assigned its own sequence identification number, where it contains an inserted or substituted sequence that contains in excess of 1 000 residues. The following table indicates which feature key and qualifier should be used to annotate the variants according to the type of sequence and the type of variation (see paragraph 96 of WIPO Standard ST.26). Type of sequence Feature key Qualifier Use Nucleic acid Variation replace or note Naturally occurring mutations and polymorphisms, e.g. alleles, RFLPs. Nucleic acid misc_difference replace or note Variability introduced artificially, e.g. by genetic manipulation or by chemical synthesis. Amino acid VAR_SEQ note Variant produced by alternative splicing, alternative promoter usage, alternative initiation and ribosomal frameshifting. Amino acid VARIANT note Any type of variant for which VAR_SEQ is not applicable. The feature key \"source\" is mandatory for every sequence, in addition to the qualifiers \"organism\" and \"mol_type\" (paragraph 75 of WIPO Standard ST.26). The value of the \"mol_type\" qualifier has to be selected from a list of predetermined terms as defined in Annex I of WIPO Standard ST.26 (section 6, qualifier mol_type 6.39; section 8, qualifier mol_type 8.1) and shown in the following table: DNA RNA AA genomic DNA other DNA unassigned DNA genomic RNA mRNA tRNA rRNA transcribed RNA viral cRNA other RNA unassigned RNA protein The value \"genomic DNA\" does not imply that the molecule is nuclear (e.g. organelle and plasmid DNA must be described using \"genomic DNA\"). Ribosomal RNA genes must be described using \"genomic DNA\". The value \"rRNA\" must only be used if the ribosomal RNA molecule itself has been sequenced. The values \"other RNA\" and \"other DNA\" must be applied to synthetic molecules, i.e. molecules that have been artificially created. The values \"unassigned DNA\" and \"unassigned RNA\", on the other hand, must be used for molecules that have been isolated from an organism but their nature is not known or not disclosed and they cannot be assigned to any more precise qualifier value (e.g. it is not known whether the sequence is a tRNA or an mRNA or another type of natural RNA). 1 gon = π / 200 rad degree ° 1° = π / 180 rad minute of angle ' 1' = π / 10 800 rad second of angle \" 1\" = π / 648 000 rad Time Minute min 1 min = 60 s Hour h 1 h = 3 600 s Day d 1 d = 86 400 s (a)  No international symbol exists The prefixes listed in F-II, Annex 2, 1.3 may only be used in conjunction with the names \"grade\" or \"gon\" and the symbols only with the symbol \"gon\"."
        },
        "3. ": {
            "title": "Request for grant – the title The items making up this request are dealt with in A-III, 4. They do not normally concern the search division or the examining division, with the exception of the title.",
            "subsections": {},
            "content": " The title should clearly and concisely state the technical designation of the invention and should exclude all fancy names (see A-III, 7.1). While any obvious failures to meet these requirements are likely to be noted during the formalities examination (and possibly during the search, see B-X, 7(ii)), the search division or the examining division reviews the title in the light of its reading of the description and claims and any amendments thereto, to make sure that the title is concise and gives a clear and adequate indication of the subject of the invention. Thus, if amendments are made which change the categories of claims, the examining division checks whether a corresponding amendment is needed in the title. The electronvolt is the kinetic energy acquired by an electron passing through a potential difference of 1 volt in a vacuum. Quantity Unit Name Symbol Value Mass unified atomic mass unit u 1 u ≈ 1,6605655 x 10-27 kg Energy Electronvolt eV 1eV ≈ 1,6021892 x 10-19 J The value of these units, expressed in SI units, is not known exactly. The prefixes and their symbols listed in F-II, Annex 2, 1.3 may be used in conjunction with these two units and with their symbols."
        },
        "4. ": {
            "title": "Description (formal requirements)",
            "subsections": {
                "4.1": {
                    "content": "General remarks The application must disclose the invention in a manner sufficiently clear and complete for it to be carried out by a person skilled in the art. The \"person skilled in the art\" for this purpose is considered to be the skilled practitioner in the relevant field aware not only of the teaching of the application itself and the references therein, but also of what was common general knowledge in the art at the date of filing (date of priority) of the application. They are assumed to have at their disposal the means and the capacity for routine work and experimentation, which are normal for the technical field in question. As \"common general knowledge\" can generally be considered the information contained in basic handbooks, monographs and textbooks on the subject in question (see T 171/84). As an exception, it can also be the information contained in patent specifications or scientific publications, if the invention lies in a field of research which is so new that the relevant technical knowledge is not yet available from textbooks (see T 51/87). Sufficiency of disclosure must be assessed on the basis of the application as a whole, including the description, claims and drawings, if any. The provisions relating to the content of the description are set out in Rule 42. The purpose of the provisions of Art. 83 and Rule 42 is: (i) to ensure that the application contains sufficient technical information to enable a skilled person to put the invention as claimed into practice; and (ii) to enable the skilled person to understand the contribution to the art which the invention as claimed has made."
                },
                "4.2": {
                    "content": "Technical field The invention should be placed in its setting by specifying the technical field to which it relates, for example by reproducing the first (\"prior art\") portion of the independent claims in full or in substance or by simply referring to it. If claims are amended, the \"field of the invention\" and \"summary of the invention\" may also need to be amended to correspond to the claims. If appropriate, it is possible to use statements like \"the invention is set out in the appended set of claims\" instead of repeating the claims verbatim."
                },
                "4.3": {
                    "content": "Background art The description should also mention any background art of which the applicant is aware, and which can be regarded as useful for understanding the invention and its relationship to the prior art; identification of documents reflecting such art, especially patent specifications, should preferably be included. This applies in particular to the background art corresponding to the first (\"prior art\") portion of the independent claim or claims (see F-IV, 2.2). In principle, when filing an application the applicant should cite in the description the closest prior art known to them. It may happen that the prior art cited by the applicant is not the closest existing for the claimed invention. Therefore, the documents cited in the application as filed do not necessarily describe the known innovations closest to the claimed invention, but may in fact constitute more distantly related prior art. The insertion into the statement of prior art of references to documents identified during examination may be necessary to put the invention into proper perspective (see T 11/82). For instance, while the originally filed description of prior art may give the impression that the inventor has developed the invention from a certain point, the cited documents may show that certain stages in, or aspects of, this alleged development were already known. In such a case the examining division requires a reference to these documents and a brief summary of the relevant contents. The subsequent inclusion of such a summary in the description does not contravene Art. 123(2). The latter merely lays down that, if the application is amended, for example by limiting it in the light of additional information on the background art, its subject-matter must not extend beyond the content of the application as filed. But the subject-matter of the European patent application within the meaning of Art. 123(2) is to be understood – starting off from the prior art – as comprising those features which, in the framework of the disclosure required by Art. 83, relate to the invention (see also H-IV, 2.1). In addition, relevant prior-art documents not cited in the original application may be subsequently acknowledged in the description even if these were known to the applicant at the time of filing (T 2321/08 and H-IV, 2.2.7). References to the prior art introduced after filing must be purely factual. Any alleged advantages of the invention must be adjusted if necessary, in the light of the prior art. New statements of advantage are permissible provided that they do not introduce into the description matter which extends beyond the content of the application as filed (see H-V, 2.2). The applicant may cite documents in the application which relate to standard technical knowledge (background art neither addressing the same technical problem nor necessary to complete the disclosure of the claimed invention). Such citations typically relate to well-known tests for measuring certain parameters mentioned in the description or to the definitions of terms of established meaning that are used in the application. Usually they are not relevant for assessing the patentability of the claimed invention, unless for example they contain relevant information which the applicant does not mention in the description. Acknowledgment of prior art relevant to the dependent claims only is generally not required. If the applicant indicates that subject-matter initially cited as prior art is only \"in-house state of the art\", such prior art may not be used in the assessment of novelty and inventive step (see T 654/92, Reasons 4, and T 1001/98, Reasons 3). However, it may be allowed to remain in the description, provided the fact that it is only \"in-house state of the art\" is made clear. If the relevant prior art consists of another European patent application falling within the terms of Art. 54(3), this relevant prior document belongs to the state of the art for all contracting states. This is the case even if the two applications do not share any commonly designated state, or the designation of commonly designated states has been dropped (see G-IV, 6). The fact that this document falls under Art. 54(3) must be explicitly acknowledged. Thus the public is informed that the document is not relevant to the question of inventive step (see G-VII, 2). According to Rule 165, the above also applies to international applications designating EP, for which the filing fee pursuant to Rule 159(1)(c) has been validly paid and, where applicable, the translation into one of the official languages has been filed (Art. 153(3) and (4)) (see G-IV, 5.2). For transitional provisions concerning the applicability of Art. 54(4) EPC 1973, see H-III, 4.2.",
                    "subsections": {
                        "4.3.1": {
                            "content": "Format of background art citations In citing documents or inserting references, applicants and examining divisions alike must use codes that allow the references to be retrieved without difficulty. This can be best achieved through consistent use of the WIPO standards format: (i) for non-patent literature, WIPO Standard ST.14 (Recommendation for the Inclusion of References Cited in Patent Documents); (ii) for patent literature (applications, granted patents and utility models): for the two-letter country code, WIPO Standard ST.3 (Recommended Standard on Two-Letter Codes for the Representation of States, Other Entities and Intergovernmental Organizations); for symbols indicating the type of document, WIPO Standard ST.16 (Recommended Standard Code for the Identification of Different Kinds of Patent Documents). WIPO standards: ST.14 (wipo.int/export/sites/www/standards/en/pdf/03-14-01.pdf) ST.3 (wipo.int/export/sites/www/standards/en/pdf/03-03-01.pdf) ST.16 (wipo.int/export/sites/www/standards/en/pdf/03-16-01.pdf) These can be found on the WIPO website. However, in the case of deviation from these standards there is no need to correct the codes used, as long as straightforward retrieval of the citation(s) is possible. 4.3.1.1 Examples of quotation for non-patent literature (i) For a monograph: WALTON Herrmann, Microwave Quantum Theory. London: Sweet and Maxwell, 1973, Vol. 2, pages 138 to 192. (ii) For an article in a periodical: DROP, J.G. Integrated Circuit Personalization at the Module Level. IBM tech. dis. bull. October 1974, Vol. 17, No. 5, pages 1344 and"
                        }
                    }
                }
            },
            "content": " 1 dioptre = 1 m-1 Mass of precious stones metric carat 1 metric carat = 2 x 10-4 kg Area of farmland and building land are a 1 a = 102 m2 Mass per unit length of textile yarns and threads tex tex 1 tex = 10-6 kg.m-1 Blood pressure and pressure of other body fluids millimetre of mercury mm Hg 1 mm Hg = 133.322 Pa Pressure in the fields of plasma physics and semiconductors millimetre of mercury mm Hg 1 mm Hg = 133.322387 Pa Torr Torr 1 Torr = 133.322368 Pa Effective cross- sectional area Barn b 1b = 10-28 m2 The prefixes and their symbols listed in F-II, Annex 2, 1.3 may be used in conjunction with the above units and symbols, with the exception of the millimetre of mercury and its symbol. The multiple of 102 a is, however, called a \"hectare\"."
        },
        "1345. ": {
            "title": "(iii) For a separately published abstract:",
            "subsections": {
                "4.4": {
                    "content": "Irrelevant matter Since the skilled person is presumed to have the general technical background knowledge appropriate to the art, the examining division does not require the applicant to insert anything in the nature of a treatise or research report or explanatory matter which is obtainable from textbooks or is otherwise well-known. Likewise the examining division does not require a detailed description of the content of cited prior documents. It is sufficient that the reason for the inclusion of the reference is indicated, unless in a particular case a more detailed description is necessary for a full understanding of the invention of the application (see also F-III, 8 and F-IV, 2.3.1). A list of several reference documents relating to the same feature or aspect of the prior art is not required; only the most appropriate need be referred to. On the other hand, the examining division does not insist upon the excision of any such unnecessary matter, except when it is very extensive (see F-II, 7.4)."
                },
                "4.5": {
                    "content": "Technical problem and its solution The invention as claimed should be disclosed in such a way that the technical problem, or problems, with which it deals can be appreciated and the solution can be understood. To meet this requirement, only such details should be included as are necessary for elucidating the invention. As an example, to elucidate the nature of the solution according to the independent claims, either the characterising portion of the independent claims could be repeated or referred to, or the substance of the features of the solution according to the relevant claims could be reproduced (see F-II, 4.2). In cases where the subject-matter of a dependent claim can be understood either by the wording of the claim itself or by the description of a way of performing the invention, no additional explanation of this subject-matter will be necessary. A mention in the description that a particular embodiment of the invention is set out in the dependent claim will then be sufficient. When there is doubt, however, as to whether certain details are necessary, the examining division does not insist on their excision. It is not necessary, moreover, that the invention be presented explicitly in problem-solution form. Any advantageous effects which the applicant considers the invention to have in relation to the prior art should be stated, but this should not be done in such a way as to disparage any particular prior product or process. Furthermore, neither the prior art nor the applicant's invention should be referred to in a manner likely to mislead. This might be done e.g. by an ambiguous presentation which gives the impression that the prior art had solved less of the problem than was actually the case. Fair comment as referred to in F-II, 7.3 is, however, permitted. Regarding amendment to, or addition of, a statement of problem, see H-V, 2.4."
                },
                "4.6": {
                    "content": "Rule 42(1)(c) vs. Art. 52(1) If it is decided that an independent claim defines a patentable invention within the meaning of Art. 52(1), it must be possible to derive a technical problem from the application. In this case the requirement of Rule 42(1)(c) is fulfilled (see T 26/81)."
                },
                "4.7": {
                    "content": "Reference in the description to drawings If drawings are included they should first be briefly described, in a manner such as: \"Figure 1 is a plan view of the transformer housing; Figure 2 is a side elevation of the housing; Figure 3 is an end elevation looking in the direction of the arrow X of Figure 2; Figure 4 is a cross-section taken through AA of Figure 1.\" When it is necessary to refer in the description to elements of the drawings, the name of the element should be referred to as well as its number, i.e. the reference should not be in the form: \"3 is connected to 5 via 4\" but, \"resistor 3 is connected to capacitor 5 via switch 4\"."
                },
                "4.8": {
                    "content": "Reference signs The description and drawings need to be consistent with one another, especially in the matter of reference numbers and other signs, and each number or sign must be explained. However, where as a result of amendments to the description whole passages are deleted, it may be tedious to delete all superfluous references from the drawings and in such a case the examining division does not pursue an objection under Art. 1(2)(i) of the decision of the President of the EPO dated 25 November 2022 (OJ EPO 2022, A113) as to consistency too rigorously. The reverse situation should never occur, i.e. all reference numbers or signs used in the description or claims must also appear on the drawings."
                },
                "4.9": {
                    "content": "Industrial application The description should indicate explicitly the way in which the invention is capable of exploitation in industry, if this is not obvious from the description or from the nature of the invention. The expression \"capable of exploitation in industry\" means the same as \"susceptible of industrial application\", and indeed identical expressions are used in the French and German texts of the EPC. In view of the broad meaning given to the latter expression by Art. 57 (see G-III, 1), it is to be expected that, in most cases, the way in which the invention can be exploited in industry will be self-evident, so that no more explicit description on this point will be required; but there may be a few instances, e.g. in relation to methods of testing, where the manner of industrial exploitation is not apparent and must therefore be explicitly indicated. Also, in relation to certain biotechnological inventions, i.e. sequences and partial sequences of genes, the industrial application is not self-evident. The industrial application of such sequences must be disclosed in the patent application (see G-III, 4)."
                },
                "4.10": {
                    "content": "Manner and order of presentation The manner and order of presentation of the description should be that specified in Rule 42(1), i.e. as set out above, unless, because of the nature of the invention, a different manner or a different order would afford a better understanding. Since the responsibility for clearly and completely describing the invention lies with the applicant, the examining division does not object to the presentation unless satisfied that such an objection would be a proper exercise of its discretion. Some departure from the requirements of Rule 42(1) is acceptable, provided the description is clear and orderly and all the requisite information is present. For example, the requirements of Rule 42(1)(c) may be waived where the invention is based on a fortuitous discovery, the practical application of which is recognised as being useful, or where the invention breaks entirely new ground. Also, certain technically simple inventions may be fully comprehensible with the minimum of description and only slight reference to prior art."
                },
                "4.11": {
                    "content": "Terminology Although the description needs to be clear and straightforward with avoidance of unnecessary technical jargon, the use of recognised terms of art is acceptable, and will often be desirable. Little-known or specially-formulated technical terms may be allowed provided that they are adequately defined and that there is no generally recognised equivalent. This discretion may be extended to foreign terms when there is no equivalent in the language of the proceedings. Terms already having an established meaning are not allowed to be used to mean something different if this is likely to cause confusion. There may, however, be circumstances where a term may legitimately be borrowed from an analogous art. Terminology and signs must be consistent throughout the application."
                },
                "4.12": {
                    "content": "Computer programs In the particular case of inventions in the computer field, program listings in programming languages cannot be relied on as the sole disclosure of the invention. The description, as in other technical fields, should be written substantially in normal language, possibly accompanied by flow diagrams or other aids to understanding, so that the invention may be understood by a person skilled in the art who is deemed not to be a specialist in any specific programming language, but does have general programming skills. Short excerpts from programs written in commonly used programming languages can be accepted if they serve to illustrate an embodiment of the invention."
                },
                "4.13": {
                    "content": "Physical values, units When the properties of a material are referred to, the relevant units need to be specified if quantitative considerations are involved. If this is done by reference to a published standard (e.g. a standard of sieve sizes) and such standard is referred to by a set of initials or similar abbreviation, it needs to be adequately identified in the description. Physical values must be expressed in the units recognised in international practice, which is generally in the metric system, using SI units and the other units referred to in Chapter I of the Annex to EEC Directive 80/181/EEC of 20 December 1979, as amended by EEC Directives 85/1/EEC of 18 December 1984, 89/617/EEC of 27 November 1989, 1999/103/EC of 24 January 2000, 2009/3/EC of 11 March 2009 and Commission Directive (EU) 2019/1258 of 23 July 2019 (see F-II, Annex 2). Any values not meeting this requirement must also be expressed in the units recognised in international practice. Values expressed in the system of imperial units (e.g. inches/pounds) or in units having local character (e.g. pint), in general, do not meet the criterion \"recognised in international practice\". As determined by the President under Rule 49(2), for mathematical formulae the symbols in general use must be employed. For chemical formulae, the symbols, atomic weights and molecular formulae in general use must be employed. In general, use should be made of the technical terms, signs and symbols generally accepted in the field in question."
                },
                "4.14": {
                    "content": "Registered trade marks It is the applicant's responsibility to ensure that registered trade marks are acknowledged as such in the description. For the assessment of the clarity of claims referring to a trade mark (Art. 84), see F-IV, 4.8. With regard to the effect of references to trade marks on sufficiency of disclosure (Art. 83), see F-III, 7."
                }
            },
            "content": " Chem. abstr., Vol. 75, No. 20, 15 November 1971 (Columbus, Ohio, USA), page 16, column 1, abstract No. 120718k, SHETULOV, D.I. \"Surface Effects During Metal Fatigue,\" Fiz.-Him. Meh. Mater. 1971, 7(29), 7-11 (Russ.). Patent Abstracts of Japan, Vol. 15, No. 105 (M-1092), 13 March 1991, JP 30 02404 A (FUDO). 4.3.1.2 Examples of quotation for patent literature (i) JP 50-14535 B (NCR CORP.) 28 May 1975 (28.05.75), column 4, lines 3 to 27. (ii) DE 3744403 A1 (A. JOSEK) 29.08.1991, page 1, abstract."
        },
        "5. ": {
            "title": "Drawings",
            "subsections": {
                "5.1": {
                    "content": "Form and content Most of the requirements relating to the form and content of drawings are formal (see A-IX), but the examining division may sometimes need to consider the requirements as determined by the President under Rule 49(2). Of these, the only question likely to cause difficulty is whether the textual matter included on the drawings is absolutely indispensable. In the case of circuit diagrams, block schematics and flow sheets, identifying catchwords for functional integers of complex systems (e.g. \"magnetic core store\", \"speed integrator\") may be regarded as indispensable from a practical point of view if they are necessary to enable a diagram to be interpreted rapidly and clearly."
                },
                "5.2": {
                    "content": "Printing quality The examining division has also to check whether the drawings in the printing copy (\"Druckexemplar\") are suitable for printing. If necessary, a copy of the original drawings must be prepared as the printing copy. If, however, the quality of the original drawings is also insufficient, then the examining division must request the applicant to present drawings of sufficient quality for printing. It needs to, however, beware of any extension of subject-matter (Art. 123(2))."
                },
                "5.3": {
                    "content": "Photographs For the presentation of photographs, see A-IX, 1.2. In the case of photographs of insufficient original quality for printing, the examining division does not request filing of better photographs, as the risk of infringing Art. 123(2) is obvious. In that case, the insufficient quality is accepted for reproduction."
                }
            }
        },
        "6. ": {
            "title": "Sequence listings For the presentation of sequence listings in general, see A-IV, 5.",
            "subsections": {
                "6.1": {
                    "content": "Reference to sequences disclosed in a database The application may refer to a biological sequence belonging to the state of the art by merely providing the sequence's accession number and its version or release number in a publicly available database, without presenting the sequence itself either in a sequence listing complying with the applicable WIPO standard or in any other format. Since in this case the sequence is already publicly available, the applicant does not need to supply a sequence listing. This applies even if reference is made to these sequences in one or more claims or if the sequences are essential features of the invention or necessary for the prior-art search (see J 8/11). If the European patent application discloses nucleotide or amino acid sequences that are fragments or variants of a prior-art sequence, a sequence listing complying with the applicable WIPO standard has to be filed for these sequence fragments or variants (see the notice from the EPO dated 9 December 2021, OJ EPO 2021, A97, p. 7). If the database and/or the sequences in question is/are not completely and unambiguously identified, the sequences are not sufficiently disclosed according to Art. 83 and cannot be added to the application to complete the disclosure without contravening Art. 123(2) (see F-III, 2). If such insufficiently disclosed sequences are not essential features of the claimed invention, normally no objection is raised. On the other hand, where these sequences are essential features of at least a part of the claimed subject-matter, this results in problems relating to the sufficiency of the original disclosure according to Art. 83, because the nature of the sequences cannot be unambiguously derived from the incomplete or ambiguous reference to the database. Examples where a biological sequence is considered an essential feature of the invention would be a diagnostic method using a particular nucleic acid sequence or a product made by a biochemical process using an enzyme with a particular amino acid sequence. An example of ambiguous identification would be the citation of an accession number of a certain protein in the database of the European Molecular Biology Laboratory EMBL with no indication of which version number or database release number is meant when there are several such numbers referring to different sequences of the protein."
                },
                "6.2": {
                    "content": "Sequences that need to be itemised in the sequence listing",
                    "subsections": {
                        "6.2.1": {
                            "content": "Requirements relating to sequence length and enumeration of residues As defined in paragraph 7 of the WIPO Standard ST.26, a sequence must be included in the sequence listing if:"
                        }
                    }
                }
            }
        },
        "7. ": {
            "title": "Prohibited matter",
            "subsections": {
                "7.1": {
                    "content": "Categories There are three categories of specifically prohibited matter, these being defined in sub-paragraphs (a) to (c) of Rule 48(1) (see also G-II, 4)."
                },
                "7.2": {
                    "content": "Matter contrary to \"ordre public\" or morality The omission, from the publication of the application, is mandatory for the first category (Rule 48(1)(a)). Examples of the kind of matter coming within this category are: incitement to riot or to acts of disorder; incitement to criminal acts; racial, religious or similar discriminatory propaganda; and grossly obscene matter. With regard to patentability issues with such matter, see G-II, 4.1 and subsections."
                },
                "7.3": {
                    "content": "Disparaging statements It is necessary to discriminate in the second category between libellous or similarly disparaging statements, which are not allowed, and fair comment, e.g. in relation to obvious or generally recognised disadvantages, or disadvantages stated to have been found and substantiated by the applicant, which, if relevant, is permitted."
                },
                "7.4": {
                    "content": "Irrelevant or unnecessary matter The third category is irrelevant or unnecessary matter: such matter is specifically prohibited under Rule 48(1)(c) only if it is \"obviously irrelevant or unnecessary\", for instance, if it has no bearing on the subject-matter of the invention or its background of relevant prior art (see also F-II, 4.4). The matter to be removed may already be obviously irrelevant or unnecessary in the original description. It may, however, be matter which has become obviously irrelevant or unnecessary only in the course of the examination proceedings, e.g. owing to a limitation of the claims of the patent to one of originally several alternatives. When matter is removed from the description, it must not be incorporated into the patent specification by reference to the corresponding matter in the published application or in any other document (see also F-III, 8)."
                },
                "7.5": {
                    "content": "Omission of matter from publication Generally, the Receiving Section will deal with matter falling under category 1(a) and may have dealt with matter obviously falling within category 1(b), but if any such matter has not been so recognised and has therefore not been omitted from the publication of the application, it is required to be removed during examination of the application together with any other prohibited matter. The applicant is informed of the category under which matter is required to be removed. Annex 1 Checklist for considering the abstract (see F-II, 2.5) In the following checklist, the abstractor should, after having studied the disclosure to be abstracted, place a check in the second column after the applicable terms listed in the first column. The requirements listed in the third column corresponding to the checked items of the first column should be borne in mind by the abstractor when preparing the abstract. Finally, the abstractor may compare the finished abstract with the checked requirements and place a corresponding checkmark in the fourth column if satisfied that the requirements have been met. If the invention is a(n) Check here The abstract should deal with: If so, check here Article its identity, use; construction, organisation, method of manufacture Chemical compound its identity (structure if appropriate); method of preparation, properties, uses Mixture its nature, properties, use; essential ingredients (identity, function); proportion of ingredients, if significant; preparation Machine, apparatus, system its nature, use; construction, organisation; operation Process or operation its nature and characterising features; material and conditions employed; product, if significant; nature of and relationship between the steps, if more than one If the disclosure involves alternatives the abstract should deal with the preferred alternative and identify the others if this can be done succinctly; if this cannot be done, it should mention that they exist and whether they differ substantially from the preferred alternative Total number of words less than 250: …....... in range 50-150: …….... Ref: Standards – ST.12/A, April 1994 Original: Handbook on Industrial Property Information and Documentation, Publication N° 208(E), 1998, WIPO, Geneva (CH). Annex 2 Units recognised in international practice as determined by the President under Rule 49(2) (see F-II, 4.13)*"
                }
            }
        }
    },
    "Chapter III – Sufficiency of disclosure": {
        "1. ": {
            "title": "Sufficiency of disclosure A detailed description of at least one way of carrying out the invention must be given. Since the application is addressed to the person skilled in the art, it is neither necessary nor desirable that details of well-known ancillary features are given, but the description must disclose any feature essential for carrying out the invention in sufficient detail to render it apparent to the skilled person how to put the invention into practice. A single example may suffice, but where the claims cover a broad field, the application is not usually regarded as satisfying the requirements of Art. 83 unless the description gives a number of examples or describes alternative embodiments or variations extending over the area protected by the claims.",
            "subsections": {},
            "content": " However, regard must be had to the facts and evidence of the particular case. There are some instances where even a very broad field is sufficiently exemplified by a limited number of examples or even one example (see also F-IV, 6.3). In these latter cases the application must contain, in addition to the examples, sufficient information to allow the person skilled in the art, using common general knowledge, to perform the invention over the whole area claimed without undue burden and without needing inventive skill (see T 727/95). In this context, the \"whole area claimed\" is to be understood as substantially any embodiment falling within the ambit of a claim, even though a limited amount of trial and error may be permissible, e.g. in an unexplored field or when there are many technical difficulties (see T 226/85 and T 409/91). However when assessing sufficiency of disclosure, the intrinsic limitations that a sensible reading imposes on the subject-matter of the independent claims must be taken into consideration; in other words the person skilled in the art wishing to implement the claimed invention will exclude any embodiment that is meaningless and not consistent with the teaching of the application (see T 521/12). With regard to Art. 83, an objection of lack of sufficient disclosure presupposes that there are serious doubts, substantiated by verifiable facts (see T 409/91 and T 694/92). If the examining division is able, under the particular circumstances, to make out a reasoned case that the application lacks sufficient disclosure, the onus of establishing that the invention may be performed and repeated over substantially the whole of the claimed range lies with the applicant (see F-III, 4). For the requirements of Art. 83 and of Rule 42(1)(c) and Rule 42(1)(e) to be fully satisfied, it is necessary that the invention is described not only in terms of its structure but also in terms of its function, unless the functions of the various parts are immediately apparent. Indeed, in some technical fields (e.g. computers), a clear description of function may be much more appropriate than an over-detailed description of structure. In cases where it is found that an application is sufficiently disclosed according to Art. 83 only in respect of a part of the claimed subject-matter, this may have led to the issuing of a partial European or supplementary European search report according to Rule 63 (see B-VIII, 3.1 and B-VIII, 3.2). In such cases, in the absence of appropriate amendment, an objection under Rule 63(3) will also arise (see H-II, 5 and H-IV, 4.1.1)."
        },
        "2. ": {
            "title": "Art. 83 vs. Art. 123(2)",
            "subsections": {},
            "content": " It is the responsibility of the applicants to ensure that they supply on filing their application, a sufficient disclosure, i.e. one that meets the requirements of Art. 83 in respect of the invention as claimed in all of the claims. If the claims define the invention, or a feature thereof, in terms of parameters, the application as filed must include a clear description of the methods used to determine the parameter values, unless a person skilled in the art would know what method to use or unless all methods would yield the same result (see F-IV, 4.11). If the disclosure is seriously insufficient, such a deficiency cannot be cured subsequently by adding further examples or features without offending against Art. 123(2), which requires that amendments may not result in the introduction of subject-matter which extends beyond the content of the application as filed (see H-IV, 2.1; see also H-V, 2.2). Therefore, in such circumstances, the application must normally be refused. If, however, the deficiency arises only in respect of some embodiments of the invention and not others, it could be remedied by restricting the claims to correspond to the sufficiently described embodiments only, the description of the remaining embodiments being deleted."
        },
        "3. ": {
            "title": "Insufficient disclosure Occasionally applications are filed in which there is a fundamental insufficiency in the invention in the sense that it cannot be carried out by a person skilled in the art; there is then a failure to satisfy the requirements of Art. 83 which is essentially irreparable.",
            "subsections": {},
            "content": " Two instances deserve special mention. The first is where the successful performance of the invention is dependent on chance. That is to say, the skilled person, in following the instructions for carrying out the invention, finds either that the alleged results of the invention are unrepeatable or that success in obtaining these results is achieved in a totally unreliable way. Sufficiency of disclosure cannot be acknowledged if the skilled person has to carry out a research programme based on trial and error to reproduce the results of the invention, with limited chances of success (T 38/11, Reasons 2.6). An example where this may arise is a microbiological process involving mutations. Such a case is to be distinguished from one where repeated success is assured even though accompanied by a proportion of failures, as can arise e.g. in the manufacture of small magnetic cores or electronic components. In this latter case, provided the satisfactory parts can be readily sorted by a non-destructive testing procedure, no objection arises under Art. 83. Another example can be found in the field of artificial intelligence if the mathematical methods and the training datasets are disclosed in insufficient detail to reproduce the technical effect over the whole range claimed. Such a lack of detail may result in a disclosure that is more like an invitation to a research programme (see also G-II, 3.3.1). The second instance is where successful performance of the invention is inherently impossible because it would be contrary to well-established physical laws – this applies e.g. to a perpetual motion machine. If the claims for such a machine are directed to its function, and not merely to its structure, an objection arises not only under Art. 83 but also under Art. 52(1) in that the invention is not \"susceptible of industrial application\" (see G-III, 1)."
        },
        "4. ": {
            "title": "Burden of proof as regards the possibility of performing and repeating the invention Although the burden of proof in the framework of sufficiency of disclosure as a rule lies with the party raising the objection, this principle does not apply to cases where the application as filed does not provide a single example or other technical information from which it is plausible that the claimed invention can be carried out (see e.g. T 1329/11).",
            "subsections": {},
            "content": " Furthermore, if there are serious doubts as regards the possibility of performing the invention and repeating it as described, the burden of proof as regards this possibility, or at least a demonstration that success is credible, rests with the applicant or the proprietor of the patent. In opposition, this may be the case where, for example, experiments carried out by the opponent suggest that the subject-matter of the patent does not achieve the desired technical result. As regards the possibility of performing and repeating the invention, see also F-III, 3."
        },
        "5. ": {
            "title": "Cases of partially insufficient disclosure",
            "subsections": {
                "5.1": {
                    "content": "Only variants of the invention are incapable of being performed The fact that only variants of the invention, e.g. one of a number of embodiments of it, are not capable of being performed does not immediately give rise to the conclusion that the subject-matter of the invention as a whole is incapable of being performed, i.e. is incapable of resolving the problem involved and therefore of achieving the desired technical result. Those parts of the description relating to the variants of the invention which are incapable of being performed and the relevant claims must, however, then be deleted or marked background information that is not part of the invention (see F-IV, 4.3(iii)) at the request of the division if the deficiency is not remedied. The specification must then be so worded that the remaining claims are supported by the description and do not relate to embodiments which have proved to be incapable of being performed. In some particular cases (for example claims relating to a combination of ranges or Markush claims), the scope of the claim might encompass a large number of alternatives, some of which correspond to non-working embodiments. In such cases, the presence of non-working embodiments in the claim is of no harm, provided that the specification contains sufficient information on the relevant criteria to identify the working embodiments within the claimed alternatives (G 1/03). See also G-VII, 5.2."
                },
                "5.2": {
                    "content": "Absence of well-known details For the purposes of sufficient disclosure the specification does not need to describe all the details of the operations to be carried out by the person skilled in the art on the basis of the instructions given, if these details are well-known and clear from the definition of the class of the claims or on the basis of common general knowledge (see also F-III, 1 and F-IV, 4.5)."
                },
                "5.3": {
                    "content": "Difficulties in performing the invention An invention is not immediately regarded as incapable of being performed on account of a reasonable degree of difficulty experienced in its performance (\"teething troubles\", for example). 1st example: The difficulties which could, for example, arise from the fact that an artificial hip joint could be fitted to the human body only by a surgeon of great experience and above-average ability would not prevent manufacturers of orthopaedic devices from deriving complete information from the description with the result that they could reproduce the invention with a view to making an artificial hip joint. 2nd example: A switchable semiconductor which, according to the invention, is used for switching electrical circuits on and off without using contacts, thereby making for smoother operation, suffers from teething troubles in that a residual current continues to flow in the circuit when switched off. However, this residual current adversely affects the use of the electrical switch in certain fields only, and can otherwise be reduced to negligible proportions by routine further development of the semiconductor."
                }
            }
        },
        "6. ": {
            "title": "Inventions relating to biological material",
            "subsections": {
                "6.1": {
                    "content": "Biological material Applications relating to biological material are subject to the special provisions set out in Rule 31. In accordance with Rule 26(3), the term \"biological material\" means any material containing genetic information and capable of reproducing itself or being reproduced in a biological system. If an invention involves the use of or concerns biological material which is not available to the public and which cannot be described in the European patent application in such a manner as to enable the invention to be carried out by a person skilled in the art, the disclosure is not considered to have satisfied the requirements of Art. 83 unless the requirements of Rule 31(1), (2), first and second sentences, and 33(1), first sentence, have been met. For inventions based on biological material of plant or animal origin or using such material, it is recommended that the application, where appropriate, includes information on the geographical origin of such material, if known. However, this is without prejudice to the examination of European patent applications and European patents (EU Dir 98/44/EC, rec. 27)."
                },
                "6.2": {
                    "content": "Public availability of biological material The division must form an opinion as to whether or not the biological material is available to the public. There are several possibilities. The biological material may be known to be readily available to those skilled in the art, e.g. baker's yeast or Bacillus natto, which is commercially available, it may be a standard preserved strain, or other biological material which the division knows to have been preserved in a recognised depositary institution and to be available to the public without restriction (see notice from the European Patent Office dated 7 July 2010, OJ EPO 2010, 498). Alternatively, the applicant may have given in the description sufficient information as to the identifying characteristics of the biological material and as to the prior availability to the public without restriction in a depositary institution recognised for the purposes of Rule 33(6) to satisfy the division (see the notice from the European Patent Office dated 7 July 2010, OJ EPO 2010, 498). In any of these cases no further action is called for. If, however, the applicant has given no or insufficient information on public availability and the biological material is a particular strain not falling within the known categories such as those already mentioned, then the division must assume that the biological material is not available to the public. It must also examine whether the biological material could be described in the European patent application in such a manner as to enable the invention to be carried out by a person skilled in the art (see, in particular, F-III, 3 and G-II, 5.5)."
                },
                "6.3": {
                    "content": "Deposit of biological material If the biological material is not available to the public and if it cannot be described in the application in such a manner as to enable the invention to be carried out by a person skilled in the art, the division must check: (i) whether the application as filed gives such relevant information as is available to the applicant on the characteristics of the biological material. The relevant information under this provision concerns the classification of the biological material and significant differences from known biological material. For this purpose, the applicant must, to the extent available, indicate morphological and biochemical characteristics and the proposed taxonomic description. The information on the biological material in question which is generally known to the skilled person on the date of filing is as a rule presumed to be available to the applicant, who must therefore provide it. If necessary, it has to be provided through experiments in accordance with the relevant standard literature. For characterising bacteria, for example, the relevant standard work would be R.E. Buchanan, N.E. Gibbons: Bergey's Manual of Determinative Bacteriology. Against this background, information needs to then be given on every further specific morphological or physiological characteristic relevant for recognition and propagation of the biological material, e.g. suitable media (composition of ingredients), in particular where the latter are modified. Abbreviations for biological material or media are often less well known than the applicant assumes and are therefore to be avoided or written in full at least once. If biological material is deposited that cannot replicate itself but must be replicated in a biological system (e.g. viruses, bacteriophages, plasmids, vectors or free DNA or RNA), the above-mentioned information is also required for such biological system. If, for example, other biological material is required, such as host cells or helper viruses, that cannot be sufficiently described or is not available to the public, this material must also be deposited and characterised accordingly. In addition, the process for producing the biological material within this biological system must be indicated. In many cases the above required information will already have been given to the depositary institution (see Rule 6.1(a)(iii) and 6.1(b) of the Regulation under the Budapest Treaty) and need only be incorporated into the application; (ii) whether the name of the depositary institution and the accession number of the deposit were supplied at the date of filing. If the name of the depositary institution and the accession number of the deposit were submitted later, it is checked whether they were filed within the relevant period under Rule 31(2). If that is the case, it is then further checked whether on the filing date any reference was supplied which enables the deposit to be related to the later filed accession number. Normally the identification reference which the depositor gave to the deposit is used in the application documents. The relevant document for later filing the data pursuant to Rule 31(1)(c) could be a letter containing the name of the depositary institution, the accession number and the above-mentioned identification reference or, alternatively, the deposit receipt, which contains all these data (see also G 2/93 and A-IV, 4.2); and (iii) whether the deposit was made by a person other than the applicant and, if so, whether the name and the address of the depositor are stated in the application or were supplied within the relevant period under Rule 31(2). In such a case, the division must also check whether the document fulfilling the requirements mentioned in Rule 31(1)(d) was submitted to the EPO within the same time limit (see A-IV, 4.1 for details of when this document referred to in Rule 31(1)(d) is required). The division, in addition to the checks referred to under (i) to (iii) above, asks for the deposit receipt issued by the depositary institution (see Rule 7.1 of the Regulation under the Budapest Treaty) or for equivalent proof of the deposit of a biological material if such proof has not been filed before (see (ii) above and A-IV, 4.2). This is to provide evidence for the indications made by the applicant pursuant to Rule 31(1)(c). If this deposit receipt has already been filed within the relevant time period according to Rule 31(2), this document on its own is regarded as submission of the information according to Rule 31(1)(c). In addition, the depositary institution named must be one of the recognised institutions listed in the Official Journal of the EPO. An up-to-date list is regularly published in the Official Journal. Where a deposit was originally not made under the Budapest Treaty, it must be converted to a deposit made within the purview of the Budapest Treaty no later than the date of filing of the European patent application in order to fulfil the requirement of Rule 31(1)(a). If any of these requirements is not satisfied, the biological material in question cannot be considered as having been disclosed pursuant to Art. 83 by way of reference to the deposit. Moreover, there are two situations in which the applicant can file information concerning the deposit which is required under Rule 31(1)(c), and where applicable also under Rule 31(1)(d), in a document filed after the accorded filing date and within the relevant time limit for filing that document, but after the expiry of one of the time limits under Rule 31(2)(a) to Rule 31(2)(c). As in the preceding paragraph, the consequence of the information being filed after the relevant time limit under Rule 31(2) is that the biological material is deemed not to have been disclosed pursuant to Art. 83 by way of reference to the deposit. These situations are those in which the information concerning the deposit is contained in either: (a) a previously filed application to which reference is made under Rule 40(1)(c), the copy of that application being filed within either the two-month period under Rule 40(3) or that under Rule 55; or (b) missing parts of the description filed later, within the two-month period under Rule 56(2), when the requirements of Rule 56(3) are satisfied, or correct application documents or parts filed later, within the two-month period under Rule 56a(3), when the requirements of Rule 56a(4) are satisfied, so that the application is not redated."
                },
                "6.4": {
                    "content": "Priority claim An application may claim the priority of a previous application with regard to unavailable biological material mentioned in F-III, 6.1. In this case, the invention is considered disclosed in the previous application for the purpose of the priority claim under Art. 87(1) only if the deposit of the biological material was made no later than the date of filing of the previous application and in accordance with the requirements of the country in which it was filed. Also, the reference to the deposit in the previous application must be made in a manner enabling it to be identified. Where the deposit of the biological material referred to in the European patent application is not the same as the deposit referred to in the priority, it is up to the applicant, if the EPO considers it necessary, to provide evidence that the biological material is identical (see also the notice from the EPO dated 7 July 2010, OJ EPO 2010, 498)."
                },
                "6.5": {
                    "content": "Euro-PCT cases International applications relating to the aforementioned unavailable biological material and designating or electing the EPO must comply with Rule 13bis PCT in conjunction with Rule 31. That means that for sufficient disclosure of the material the deposit with a recognised depositary institution must be made not later than the international filing date, relevant information must be given in the application and the necessary indications must be furnished as required during the international phase (see also the notice from the EPO dated 7 July 2010, OJ EPO 2010, 498)."
                }
            }
        },
        "7. ": {
            "title": "Proper names, trade marks and trade names The use of proper names, trade marks or trade names or similar words to refer to materials or articles is undesirable in so far as such words merely denote origin or where they may relate to a range of different products. If such a word is used, then, where it is necessary in order to satisfy the requirements of Art. 83, the product must be sufficiently identified, without reliance upon the word, to enable the invention to be carried out by the skilled person at the date of filing. However, where such words have become internationally accepted as standard descriptive terms and have acquired a precise meaning (e.g. \"Bowden\" cable, \"Belleville\" washer,",
            "subsections": {},
            "content": " \"Panhard\" rod, \"caterpillar\" belt) they may be allowed without further identification of the product to which they relate. For the assessment of the clarity of claims referring to a trade mark (Art. 84), see F-IV, 4.8."
        },
        "8. ": {
            "title": "Reference documents References in European patent applications to other documents may relate either to the background art or to part of the disclosure of the invention.",
            "subsections": {},
            "content": " Where the reference document relates to the background art, it may be in the application as originally filed or introduced at a later date (see F-II, 4.3 and 4.4 and H-IV, 2.2.7). Where the reference document relates directly to the disclosure of the invention (e.g. details of one of the components of a claimed apparatus), then the examining division first considers whether knowing what is in the reference document is in fact essential for carrying out the invention as meant by Art. 83. If not essential, the usual expression \"which is hereby incorporated by reference\", or any expression of the same kind, needs to be deleted from the description. If matter in the document referred to is essential to satisfy the requirements of Art. 83, the examining division requires the deletion of the above-mentioned expression and that, instead, the matter is expressly incorporated into the description, because the patent specification must, regarding the essential features of the invention, be self-contained, i.e. capable of being understood without reference to any other document. Furthermore, documents are not part of the text to be translated pursuant to Art. 65 (T 276/99). Such incorporation of essential matter or essential features is, however, subject to the restrictions set out in H-IV, 2.2.1. It may be that the search division has requested the applicant to furnish the document referred to, in order to be able to carry out a meaningful search (see B-IV, 1.3). If, for the disclosure of the invention, a document is referred to in an application as originally filed, the relevant content of the reference document is to be considered as forming part of the content of the application for the purpose of citing the application under Art. 54(3) against later applications. For reference documents not available to the public before the filing date of the application this applies only if the conditions set out hereto in H-IV, 2.2.1 are fulfilled. Because of this effect under Art. 54(3), it is very important that, where a reference is directed only to a particular part of the document referred to, that part needs to be clearly identified in the reference."
        },
        "9. ": {
            "title": "\"Reach-through\" claims In certain technical areas (e.g. biotechnology, pharmacy) cases occur where:",
            "subsections": {},
            "content": " (i) one of the following and its use in a screening method have been defined as the only contribution to the art - a polypeptide - a protein - a receptor - an enzyme, etc., or (ii) a new mechanism of action of such molecule has been defined. It may happen that such applications contain so-called \"reach-through\" claims, i.e. claims directed to a chemical compound (or the use of that compound) defined only in functional terms with regard to the technical effect it exerts on one of the above molecules. Typical examples of such claims would be: \"An agonist/antagonist to polypeptide X [optionally as identified by the screening method of claim A].\"; \"An agonist/antagonist to polypeptide X [optionally as identified by the screening method of claim A], for use in therapy.\"; \"An agonist/antagonist to polypeptide X [optionally as identified by the screening method of claim A], for use in the treatment of disease Y.\", where the description indicates that polypeptide X is involved in disease Y. According to Art. 83 and Rule 42(1)(c), the claim must contain sufficient technical disclosure of the solution to the problem. A functional definition of a chemical compound (\"reach-through\" claim) covers all compounds possessing the activity or effect specified in the claim. It would be an undue burden to isolate and characterise all potential compounds (e.g. agonists/antagonists), without any effective pointer to their identity (see F-III, 1), or to test every known compound and every conceivable future compound for this activity to see if it falls within the scope of the claim. In effect, the applicant is attempting to patent what has not yet been invented, and the fact that the applicant can test for the effect used to define the compounds does not necessarily confer sufficiency on the claim; in fact it constitutes an invitation for the skilled person to perform a research programme (see T 435/91 (Reasons 2.2.1), followed by T 1063/06 (Headnote II)). In general, claims directed to merely functionally defined chemical compounds that are to be found by means of a new kind of research tool (e.g. using a new screening method based on a newly discovered molecule or a new mechanism of action) are directed to future inventions, for which patent protection under the EPC is not designed. In the case of such \"reach-through\" claims, it is both reasonable and imperative to limit the subject-matter of the claims to the actual contribution to the art (see T 1063/06 (Headnote I))."
        },
        "10. ": {
            "title": "Sufficiency of disclosure and Rules 56 and 56a Missing parts under Rule 56 and correct application documents or parts under Rule 56a may be withdrawn within one month of a notification on redating in order to maintain the original filing date, and these parts are then deemed to be no longer part of the application (see also A-II, 5.4.2 and 5.5, A-II, 6.5, C-III, 1, H-IV, 2.2.2 and H-IV, 2.2.3).",
            "subsections": {},
            "content": " Under Rule 56a(4), documents or parts filed erroneously cannot be withdrawn and may only be removed by amending the application in compliance with Art. 123(2). In this case, the division must carefully evaluate whether the invention is still sufficiently disclosed without relying on the technical information contained in the withdrawn missing parts. If the division reaches the conclusion that the requirements of Art. 83 are not satisfied, a corresponding objection is raised. Ultimately, the application may be refused for lack of sufficient disclosure (see F-III, 3 to 5)."
        },
        "11. ": {
            "title": "Sufficiency of disclosure and clarity An ambiguity in the claims may lead to an insufficiency objection. However, ambiguity also relates to the scope of the claims, i.e. Art. 84 (see F-IV, 4).",
            "subsections": {},
            "content": " Normally, therefore, an ambiguity in a claim will lead to an objection under Art. 83 only if the whole scope of the claim is affected, in the sense that it is impossible to carry out at all the invention defined therein. Otherwise an objection under Art. 84 is appropriate (see T 608/07, T 1811/13). In particular (see T 593/09), where a claim contains an ill-defined (\"unclear\", \"ambiguous\") parameter (see also F-IV, 4.11) and where, as a consequence, a person skilled in the art would not know whether they were working within or outside of the scope of the claim, this, by itself, is not a reason to deny sufficiency of disclosure as required by Art. 83. Nor is such a lack of clear definition necessarily a matter for objection under Art. 84 only. What is decisive for establishing insufficiency within the meaning of Art. 83 is whether the parameter, in the specific case, is so ill-defined that a person skilled in the art is not able, on the basis of the disclosure as a whole and using common general knowledge, to identify (without undue burden) the technical measures necessary to solve the problem underlying the application at issue, e.g. see T 61/14. There is a delicate balance between Art. 83 and Art. 84, which has to be assessed on the merits of each individual case. Care has therefore to be taken in opposition that an insufficiency objection is not merely a hidden objection under Art. 84, especially in the case of ambiguities in the claims (T 608/07). On the other hand, even though lack of support/clarity is not a ground for opposition (see also F-IV, 6.4), a problem related to it may in fact be of concern under Art. 83."
        },
        "12. ": {
            "title": "Sufficiency of disclosure and inventive step If the claimed invention lacks reproducibility, this may become relevant under the requirements of sufficiency of disclosure or inventive step. The technical effect achieved by the invention solves the problem which underlies the application. If an invention lacks reproducibility because its desired technical effect as expressed in the claim is not achieved, this results in a lack of sufficient disclosure, which has to be objected to under Art. 83. Otherwise, i.e. if the effect is not expressed in the claim but is part of the problem to be solved, there is a problem of inventive step (see G 1/03, Reasons 2.5.2, T 1079/08, T 1319/10, T 5/06 and T 380/05).",
            "subsections": {},
            "content": " See F-III, 3 for cases where successful performance of the invention is inherently impossible because it would be contrary to the well-established laws of physics."
        }
    },
    "Chapter IV – Claims (Art. 84 and formal requirements)": {
        "1. ": {
            "title": "General The application must contain \"one or more claims\".",
            "subsections": {},
            "content": " These must: (i) \"define the matter for which protection is sought\"; (ii) \"be clear and concise\"; and (iii) \"be supported by the description\". Since the extent of the protection conferred by a European patent or application is determined by the claims (interpreted with the help of the description and the drawings), clarity of the claims is of the utmost importance (see also F-IV, 4). - receiving in an electromagnetic detector first and second electromagnetic radiation signals from a blood-perfused tissue portion corresponding to two different wavelengths of light; - normalising said electromagnetic signals according to steps A, B and C to provide normalised electromagnetic signals; - determining oxygen saturation based on said normalised electromagnetic signals according to steps D and E. - receiving data representing first and second electromagnetic radiation signals acquired by an electromagnetic detector from a blood-perfused tissue portion corresponding to two different wavelengths of light; - normalising the data representing said electromagnetic signals according to steps A, B and C to provide normalised data; - determining oxygen saturation based on said normalised data according to steps D and E."
        },
        "2. ": {
            "title": "Form and content of claims",
            "subsections": {
                "2.1": {
                    "content": "Technical features The claims must be drafted in terms of the \"technical features of the invention\". This means that claims must not contain any statements relating, for example, to commercial advantages or other matters not related to \"carrying out\" the invention, but statements of purpose are allowed if they assist in defining the invention. It is not necessary that every feature is expressed in terms of a structural limitation. Functional features may be included provided that a skilled person would have no difficulty in providing some means of performing this function without exercising inventive skill (see F-IV, 6.5). For the specific case of a functional definition of a pathological condition, see F-IV, 4.21. Claims to the use of the invention, in the sense of the technical application thereof, are allowable."
                },
                "2.2": {
                    "content": "Two-part form Rule 43(1)(a) and (b) define the two-part form which a claim must have \"wherever appropriate\". The first part or \"preamble\" needs to contain a statement indicating \"the designation of the subject-matter of the invention\", i.e. the general technical class of apparatus, process, etc. to which the invention relates, followed by a statement of \"those technical features which are necessary for the definition of the claimed subject-matter but which, in combination, are part of the prior art\". This requirement to state prior-art features in the first part of the claim is applicable only to independent claims and not to dependent claims (see F-IV, 3.4). It is clear from the wording of Rule 43 that it is necessary only to refer to those prior-art features which are relevant to the invention. For example, if the invention relates to a photographic camera but the inventive step relates entirely to the shutter, it would be sufficient for the first part of the claim to read: \"A photographic camera including a focal plane shutter\" and there is no need to refer also to the other known features of a camera such as the lens and view-finder. The second part or \"characterising portion\" needs to state the features which the invention adds to the prior art, i.e. the technical features for which, in combination with the features stated in the first part, protection is sought. If a single document in the state of the art according to Art. 54(2), e.g. cited in the search report, reveals that one or more features in the second part of the claim were already known in combination with all the features in the first part of the claim and in that combination have the same effect as they have in the full combination according to the invention, the division will require that such feature or features be transferred to the first part. Where, however, a claim relates to a novel combination, and where the division of the features of the claim between the preamble and the characterising part could be made in more than one way without inaccuracy, applicants must not be pressed, unless there are very substantial reasons, to adopt a different division of the features from that which they have chosen, if their version is not incorrect. If the applicant insists on including more features in the preamble than can be derived from the closest available prior art, this is accepted. If no other prior art is available, this first part of the claim could be used to raise an objection on the ground of lack of inventive step (see G-VII, 5.1, last paragraph)."
                },
                "2.3": {
                    "content": "Two-part form unsuitable Subject to what is stated in F-IV, 2.3.2, final sentence, applicants are required to follow the above two-part formulation in their independent claim or claims, where, for example, it is clear that their invention resides in a distinct improvement in an old combination of parts or steps. However, as is indicated by Rule 43, this form need be used only in appropriate cases. The nature of the invention may be such that this form of claim is unsuitable, e.g. because it would give a distorted or misleading picture of the invention or the prior art. Examples of the kind of invention which may require a different presentation are: (i) the combination of known integers of equal status, the inventive step lying solely in the combination; (ii) the modification of, as distinct from addition to, a known chemical process e.g. by omitting one substance or substituting one substance for another; and (iii) a complex system of functionally interrelated parts, the inventive step concerning changes in several of these or in their interrelationships. In examples (i) and (ii), the Rule 43 form of claim may be artificial and inappropriate, whilst in example (iii) it might lead to an inordinately lengthy and involved claim. Another example in which the Rule 43 form of claim may be inappropriate is where the invention is a new chemical compound or group of compounds. It is likely also that other cases will arise in which the applicant is able to adduce convincing reasons for formulating the claim in a different form.",
                    "subsections": {
                        "2.3.1": {
                            "content": "No two-part form There is a special instance in which the Rule 43 form of claim is avoided. This is when the only relevant prior art is another European patent application falling within the terms of Art. 54(3). Such prior art must however be clearly acknowledged in the description (see F-II, 4.3, penultimate paragraph, and F-II, 4.4)."
                        },
                        "2.3.2": {
                            "content": "Two-part form \"wherever appropriate\" When examining whether or not a claim is to be put in the form provided for in Rule 43(1), second sentence, it is important to assess whether this form is \"appropriate\". In this respect the purpose of the two-part form is to allow the skilled person to see clearly which features necessary for the definition of the claimed subject-matter are, in combination, part of the prior art. If this is sufficiently clear from the indication of prior art made in the description, to meet the requirement of Rule 42(1)(b), the two-part form is not insisted upon."
                        }
                    }
                },
                "2.4": {
                    "content": "Formulae and tables The claims, as well as the description, may contain chemical or mathematical formulae but not drawings (see the decision of the President dated 25 November 2022, OJ EPO 2022, A113, Art. 2(8)). The claims may contain tables but \"only if their subject-matter makes the use of tables desirable\". In view of the use of the word \"desirable\" in this decision, the division does not object to the use of tables in claims where this form is convenient."
                }
            }
        },
        "3. ": {
            "title": "Kinds of claim",
            "subsections": {
                "3.1": {
                    "content": "Categories The EPC refers to different \"categories\" of claim (\"products, process, apparatus or use\"). For many inventions, claims in more than one category are needed for full protection. In fact, there are only two basic kinds of claim, viz. claims to a physical entity (product, apparatus) and claims to an activity (process, use). The first basic kind of claim (\"product claim\") includes a substance or compositions (e.g. chemical compound or a mixture of compounds) as well as any physical entity (e.g. object, article, apparatus, machine, or system of co-operating apparatus) which is produced by a person's technical skill. Examples are: \"a steering mechanism incorporating an automatic feed-back circuit ...\"; \"a woven garment comprising ...\"; \"an insecticide consisting of X, Y, Z\"; or \"a communication system comprising a plurality of transmitting and receiving stations\". The second basic kind of claim (\"process claim\") is applicable to all kinds of activities in which the use of some material product for effecting the process is implied; the activity may be exercised upon material products, upon energy, upon other processes (as in control processes) or upon living things (see, however, G-II, 4.2 and G-II, 5.4). Rule 43(2) in combination with Rule 44(1) should be construed as permitting the inclusion of any one of the following combinations of claims of different categories in the same application: (i) in addition to an independent claim for a given product, an independent claim for a process specially adapted for the manufacture of said product and an independent claim for a use of said product; or (ii) in addition to an independent claim for a given process, an independent claim for an apparatus or means specifically designed for carrying out said process; or (iii) in addition to an independent claim for a given product, an independent claim for a process specially adapted for the manufacture of said product and an independent claim for an apparatus or means specifically designed for carrying out said process. However, while a single set of independent claims according to any one of the combinations (i), (ii) or (iii) above is always permissible, a plurality of such sets of independent claims in one European patent application can only be allowed if the specific circumstances defined in Rule 43(2)(a) to Rule 43(2)(c) apply and the requirements of Art. 82 and Art. 84 are met. The proliferation of independent claims arising out of a combined effect of this kind may therefore be allowed only by way of an exception. If the subject-matter of a European patent is a process, the protection conferred by the patent extends to the products directly obtained by such a process."
                },
                "3.2": {
                    "content": "Number of independent claims According to Rule 43(2), as applicable to all European patent applications, the number of independent claims is limited to one independent claim in each category. Exceptions from this rule can only be admitted in the specific circumstances defined in sub-paragraphs (a), (b) or (c) of this rule, provided the requirement of Art. 82 with regard to unity is met (see F-V). The following are examples of typical situations falling within the scope of the exceptions from the principle of one independent claim per category: (i) Examples of a plurality of interrelated products (Rule 43(2)(a)) - plug and socket - transmitter – receiver - intermediate(s) and final chemical product - gene – gene construct – host – protein – medicament For the purpose of Rule 43(2)(a), the term \"interrelated\" is interpreted to mean \"different objects that complement each other or work together\". In addition, Rule 43(2)(a) can be interpreted as covering apparatus claims, since the term \"products\" is considered to include apparatuses. Likewise, it may include systems, sub-systems and sub-units of such systems, as long as these entities are interrelated. Interrelated methods claims may also fall under the exception of Rule 43(2)(a). (ii) Examples of a plurality of different inventive uses of a product or apparatus (Rule 43(2)(b)) - claims directed to further medical uses when a first medical use is known (see G-II, 4.2) - claims directed to the use of compound X for multiple purposes, e.g. for cosmetically fortifying hair and for promoting hair growth (iii) Examples of alternative solutions to a particular problem (Rule 43(2)(c)) - a group of chemical compounds - two or more processes for the manufacture of such compounds (iv) Examples of allowable claim types - Claims directed to multiple methods involving a novel and inventive polypeptide P, e.g. an enzyme that controls a specific step in the synthesis of a compound: a method for manufacturing the polypeptide P, a method for manufacturing the compound by using either the isolated polypeptide or host cells expressing said polypeptide, a method for selecting a host cell based on whether or not it expresses the polypeptide of the invention. - A data sending method for sending a data packet between a plurality of devices coupled to a bus; a data receiving method for receiving a data packet between a plurality of devices coupled to a bus. - Methods of operating a data-processing system comprising steps A, B, … - a data-processing apparatus/system comprising means for carrying out said method – a computer program [product] adapted to perform said method – a computer-readable storage medium/data carrier comprising said program; Note however that when several independent claims are directed to equivalent embodiments that are not sufficiently different (e.g. computer program adapted to perform said method, optionally carried on an electric carrier signal – computer program comprising software code adapted to perform method steps A, B …), the exceptions under Rule 43(2) usually do not apply. For the purpose of Rule 43(2)(c), the term \"alternative solutions\" can be interpreted as \"different or mutually exclusive possibilities\". Moreover, if it is possible to cover alternative solutions by a single claim, the applicant should do so. For example, overlaps and similarities in the features of the independent claims of the same category are an indication that it would be appropriate to replace such claims with a single independent claim, e.g. by selecting a common wording for the essential features (see F-IV, 4.5)."
                },
                "3.3": {
                    "content": "Objection under Rule 43(2) or Rule 137(5) Where an unjustified plurality of independent claims in the same category persists after the search (see B-VIII, 4.1 and B-VIII, 4.2) in the application under examination, an objection is raised under Rule 43(2). If no Rule 62a(1) invitation was sent at the search stage, the examining division can still raise an objection under Rule 43(2). If the application is a Euro-PCT application not subject to the preparation of a supplementary European search report (see B-II, 4.3.1), an objection under Rule 43(2) may also arise in examination. When an objection under Rule 43(2) arises, the applicant is invited to amend the claims appropriately. If the search was restricted in accordance with Rule 62a, and the examining division upholds the objection under Rule 43(2) despite possible counter-arguments provided by the applicant in response to the invitation under Rule 62a(1) (see B-VIII, 4.2.2) or to the search opinion under Rule 70a (see B-X, 8), the claims must be amended in such a way as to result in the removal of all subject-matter excluded from the search (Rule 62a(2)) and the description amended accordingly (see H-II, 5). If in reply to the reasoned objection (raised or confirmed in a communication from the examining division) the additional independent claims are maintained and no convincing arguments are presented that one of the situations referred to in sub-paragraphs Rule 43(2)(a) to (c) applies, the application may be refused under Art. 97(2). If the application is amended to provide a set of claims complying with Rule 43(2), but containing one or more claims directed to subject-matter excluded from the search in accordance with Rule 62a(1), an objection under Rule 137(5) arises and such amendments may not be admitted (see also H-IV, 4 and H-IV, 4.1.1). However, before such a decision can be taken, it will be necessary to allow the applicant to comment according to Art. 113(1) on the underlying issue of whether or not the claims in respect of which the invitation under Rule 62a(1) was sent did in fact comply with Rule 43(2). The burden of proof concerning an objection under Rule 43(2) is initially shifted onto the applicant, i.e. it is up to the applicant to argue convincingly why additional independent claims can be maintained. For example, the mere statement that the number of claims is the minimum necessary to provide the overall scope of protection which the applicant seeks is not a convincing argument (see T 56/01, Reasons 5). Where the application also lacks unity of invention, the division may raise an objection under either Rule 43(2) or Art. 82 or under both. The applicant cannot contest which of these objections has priority."
                },
                "3.4": {
                    "content": "Independent and dependent claims All applications will contain one or more \"independent\" claims directed to the essential features of the invention. Any such claim may be followed by one or more claims concerning \"particular embodiments\" of that invention. It is evident that any claim relating to a particular embodiment must effectively include also the essential features of the invention, and hence must include all the features of at least one independent claim. The term \"particular embodiment\" is construed broadly as meaning any more specific disclosure of the invention than that set out in the independent claim or claims. Any claim which includes all the features of any other claim is termed a \"dependent claim\". Such a claim must contain, if possible at the beginning, a reference to the other claim, all features of which it includes (see, however, F-IV, 3.8 for claims in different categories). Since a dependent claim does not by itself define all the characterising features of the subject-matter which it claims, expressions such as \"characterised in that\" or \"characterised by\" are not necessary in such a claim but are nevertheless permissible. A claim defining further particulars of an invention may include all the features of another dependent claim by referring back to that claim. Also, in some cases, a dependent claim may define a particular feature or features which may appropriately be added to more than one previous claim (independent or dependent). It follows that there are several possibilities: a dependent claim may refer back to one or more independent claims, to one or more dependent claims, or to both independent and dependent claims. It sometimes occurs that an independent claim refers explicitly to alternative solutions and that these alternatives are also claimed separately in dependent claims. Such claims may seem redundant, but may be important for applicants in some national procedures if they wish to restrict their claims. The division objects to such claims only if they detract from the clarity of the claims as a whole. A dependent claim referring explicitly to independent claims in two categories as alternatives cannot be objected to on this ground alone. For example, if the invention relates to both a composition and a use of that composition, it is possible for a claim specifying further features of the composition to be made dependent on both the independent claim for the composition and the independent claim for its use. Objections are, however, raised to this type of claim dependency if it leads to a lack of clarity."
                },
                "3.5": {
                    "content": "Arrangement of claims All dependent claims referring back to a single previous claim and those referring back to several previous claims must be grouped together to the extent and in the most appropriate way possible. The arrangement must therefore be one which enables the association of related claims to be readily determined and their meaning in association to be readily construed. The division objects if the arrangement of claims is such as to create obscurity in the definition of the subject-matter to be protected. In general, however, when the corresponding independent claim is allowable, the division does not concern itself unduly with the subject-matter of dependent claims, provided it is satisfied that they are truly dependent and thus in no way extend the scope of protection of the invention defined in the corresponding independent claim (see also F-IV, 3.8)."
                },
                "3.6": {
                    "content": "Subject-matter of a dependent claim If the two-part form is used for the independent claim(s), dependent claims may relate to further details of features not only of the characterising portion but also of the preamble."
                },
                "3.7": {
                    "content": "Alternatives in a claim A claim, whether independent or dependent, may refer to alternatives, provided that the number and presentation of alternatives in a single claim does not make the claim obscure or difficult to construe and provided that the claim meets the requirements of unity (see also F-V, 3.2.1 and 3.2). In the case of a claim defining (chemical or non-chemical) alternatives, i.e. a so-called \"Markush grouping\", unity of invention is considered to be present if the alternatives are of a similar nature and can fairly be substituted for one another (see F-V, 3.2.5)."
                },
                "3.8": {
                    "content": "Independent claims containing a reference to another claim or to features from a claim of another category A claim containing a reference to another claim is not necessarily a dependent claim as defined in Rule 43(4). One example of this is a claim referring to a claim of a different category (e.g. \"Apparatus for carrying out the process of claim 1 ...\", or \"Process for the manufacture of the product of claim 1 ...\"). Similarly, in a situation like the plug and socket example of F-IV, 3.2(i), a claim to the one part referring to the other co-operating part (e.g. \"plug for co-operation with the socket of claim 1 ...\") is not a dependent claim. In all these examples, the division carefully considers the extent to which the claim containing the reference necessarily involves the features of the claim referred to and the extent to which it does not. Indeed, objections on the grounds of lack of clarity and failure to state the technical features (Rule 43(1)) apply to a claim which simply says \"Apparatus for carrying out the process of claim 1\". Since the change of category already makes the claim independent, the applicant is required to set out clearly in the claim the essential features of the apparatus. The same is true for a claim which says \"Method for using an apparatus According to claim 1\". The method claim, formulated as a use claim, lacks the steps that are carried out in order to use the apparatus (see F-IV, 4.16) and is therefore not clear. For claims directed to computer-implemented inventions, in which independent claims often comprise references to other independent claims, see F-IV, 3.9. The subject-matter of a claim in one category may also to some extent be defined in terms of features from another category; therefore an apparatus may be defined in terms of functions it is able to perform, provided the structure is made sufficiently clear; or a process may be defined in terms of essential structural features of the apparatus for carrying it out; or an element of an apparatus may be defined in terms of how it is made. However, in the wording of these claims and in the assessment of the claimed subject-matter, a clear distinction must be maintained between product claims (for a device, apparatus or system) and process claims (for a process, activity or use). For example, a claim for an apparatus cannot normally be limited only by the manner in which the apparatus is used; for this reason, a claim which simply reads \"Apparatus Z, when used for carrying out process Y\" is also objected to on the grounds of lack of clarity and failure to state the technical features (Rule 43(1)). No separate examination for the novelty and inventive step of a process claim for producing a product is necessary, provided that: - all features of the product as defined in the product claim inevitably (see also G-VII, 14) result from the claimed process (see F-IV, 4.5 and T 169/88), and - the product claim is patentable. This also applies in the case of a claim for the use of a product, when the product is patentable and the use explicitly or implicitly implements all features of the product claim (see T 642/94 and T 1144/07). In all other instances, the patentability of the claim referred to does not necessarily imply the patentability of the independent claim containing the reference. If the process, product and/or use claims have different effective dates (see F-VI, 1 and  2), a separate examination may still be necessary in view of intermediate documents (see also G-VII, 14)."
                },
                "3.9": {
                    "content": "Claims directed to computer-implemented inventions The expression \"computer-implemented inventions\" (CII) covers claims which involve computers, computer networks or other programmable apparatus, whereby at least one feature is realised by means of a program. Claims directed to CII should define all the features which are essential for the technical effect of the process which the computer program is intended to carry out when it is run (see F-IV, 4.5.2, last sentence). An objection under Art. 84 may arise if the claims contain program listings. Short excerpts from programs may be accepted in the description (see F-II, 4.12). In the following three sections, a distinction is made between three situations. The practice defined in F-IV, 3.9.1 is confined to inventions in which all the method steps can be carried out by generic data processing means. F-IV, 3.9.2, on the other hand, relates to inventions in which at least one method step defines the use of specific data processing means or other technical devices. Inventions that are realised in a distributed computing environment are discussed in F-IV, 3.9.3.",
                    "subsections": {
                        "3.9.1": {
                            "content": "Cases where all method steps can be fully implemented by generic data processing means A common type of CII relates to subject-matter where all the method steps can fully be carried out by computer program instructions running on means which, in the context of the invention, provide generic data processing functions. Such means can, for example, be embedded in a personal computer, smartphone, printer etc. In such inventions, although different claim structures are possible, the set of claims usually starts with a method claim. Further claims in other categories with subject-matter corresponding to that of the method may be included to obtain complete protection of the invention. If the invention concerns software which can be loaded into memory, transmitted over a network or distributed on a data carrier, a claim to a computer program [product] may also be present in addition to a computer-implemented method. The category of a computer program [product] claim is distinguished from that of a corresponding computer-implemented method (T 424/03 and G 3/08). The following non-exhaustive list comprises examples of acceptable claim formulations (T 410/96, T 1173/97 and T 2140/08) in such a set of claims: (i) Method claim (claim 1) - A computer-implemented method comprising steps A, B, ... - A method carried out by a computer comprising steps A, B, ... (ii) Apparatus/device/system claim (claim 2) - A data processing apparatus/device/system comprising means for carrying out [the steps of] the method of claim 1. - A data processing apparatus/device/system comprising means for carrying out step A, means for carrying out step B, ... - A data processing apparatus/device/system comprising a processor adapted to/configured to perform [the steps of] the method of claim 1. (iii) Computer program [product] claim (claim 3) - A computer program [product] comprising instructions which, when the program is executed by a computer, cause the computer to carry out [the steps of] the method of claim 1. - A computer program [product] comprising instructions which, when the program is executed by a computer, cause the computer to carry out steps A, B, .... (iv) Computer-readable [storage] medium/data carrier claim (claim 4) - A computer-readable [storage] medium comprising instructions which, when executed by a computer, cause the computer to carry out [the steps of] the method of claim 1. - A computer-readable [storage] medium comprising instructions which, when executed by a computer, cause the computer to carry out steps A, B, ... - A computer-readable data carrier having stored thereon the computer program [product] of claim 3. - A data carrier signal carrying the computer program [product] of claim 3. In formulation (ii) above, apparatus features of the means-plus-function type (\"means for ...\") are interpreted as means adapted to carry out the respective steps/functions, rather than merely means suitable for carrying them out (T 410/96). There is no particular preference of wording among \"comprising means for\", \"adapted to\", \"configured to\" or equivalents. In this way, novelty is conferred over an unprogrammed data processing apparatus or a data processing apparatus programmed to perform a different function. An objection under Rule 43(2) is not raised if the claim set comprises one claim from each of the above formulations (i)-(iv). In these cases, an invitation under Rule 62a(1) is therefore not sent at the search stage since the requirements of Rule 43(2) are fulfilled. However, an objection under Rule 43(2) is raised if there are multiple independent claims present from a given heading (i)-(iv) and they do not fall under the exceptions of Rule 43(2) (F-IV, 3.2) (e.g. two or more computer program [product] claims which cannot be considered as falling under one of the exceptions of Rule 43(2)). When assessing the novelty and inventive step of a set of claims as defined above (formulations (i)-(iv)), the division usually starts with the method claim. If the subject-matter of the method claim is considered novel and inventive, the subject-matter of the other claims in a set formulated in accordance with the headings above will normally be novel and inventive as well, provided they comprise the features corresponding to all those which assure the patentability of the method. Claims related to CII which are formulated differently to those in the formulations (i)-(iv) defined above are assessed on a case-by-case basis in view of the requirements of clarity, novelty and inventive step (see also F-IV, 3.9.2). For example, when the invention is realised in a distributed computing environment or involves interrelated products, it may be necessary to refer to the specific features of the different entities and to define how they interact to ensure the presence of all essential features, rather than making a mere reference to another claim as in the above formulations (ii)-(iv). In such cases, further independent claims to interrelated products and their corresponding methods may also be allowable under Rule 43(2)(a) (F-IV, 3.2 and F-IV, 3.9.3). Similarly, if user interaction is required, an objection under Art. 84 may arise if it is not possible to determine from the claim which steps are carried out by the user. Furthermore, a claim to a computer-implemented data structure in addition to formulations (i)-(iv) may be allowable under Rule 43(2) if it is defined by its own technical features, e.g. by a well-defined structure as in T 858/02, possibly with references to the corresponding method or system in which it is used. However, a computer-implemented data structure does not necessarily comprise features of the process by which it is generated. It is not necessarily restricted by a method in which it is used, either. Therefore, a claim to a computer-implemented data structure usually cannot be defined merely by reference to a method or as an outcome of a process. For further information on data structures, see G-II, 3.6.3. For the assessment of inventive step for claims comprising features related to exclusions under Art. 52(2), as is often the case with CII, see G-VII, 5.4."
                        },
                        "3.9.2": {
                            "content": "Cases where method steps define additional devices and/or specific data processing means Where a method claim includes steps defined as being carried out by devices other than generic data processing means, a corresponding device and/or computer program claim may need more than a mere reference to the method claim as in formulations (i)-(iv) in F-IV, 3.9.1 to fulfil the requirements of Art. 84 (see also F-IV, 3.8). Furthermore, if not all the features of the method claim are reflected in claims in other categories referring to the method, said claims in other categories have to be construed and examined separately with respect to novelty and inventive step. In particular in applied fields such as medical devices, measuring, optics, electro-mechanics or industrial production processes, method claims frequently involve steps of manipulating or interacting with technical physical entities by using computer control. These method steps may not always be fully performed by the computer and the method claim may recite specific technical means for carrying out some of the steps. In such a case, defining a computer program claim as in F-IV, 3.9.1(iii) will normally lead to an objection under Art. 84 if the step carried out by the specific technical means cannot be carried out by a generic data processing means (see Example 1 below). An objection under Art. 84 may also arise if the claims do not define which steps are carried out by the data processor or by the additional devices involved, as well as their interactions. The same applies if specific data processing means (e.g. a particular parallel computer architecture) are required as opposed to the generic data processing means described in F-IV, 3.9.1. On the other hand, if the method claim defines the further processing, by generic computational means, of data received from specific technical means, such as sensors, it is not necessary that the computer or computer program claims referring to the method comprise those specific technical means. In this case the specific technical means recited in the method are not required for carrying out the method steps and formulations as in F-IV, 3.9.1 may be appropriate (see Example 2 below). Finally, as is the case for any essential feature, if the specific technical means are essential for defining the invention, they have to be present in all the independent claims. Whether or not a feature is essential is decided according to the principles defined in F-IV, 4.5 and subsections, taking due account of implicit features (F-IV, 4.5.4). Example 1"
                        }
                    }
                }
            }
        },
        "4. ": {
            "title": "A computer-readable medium having stored thereon the computer program of claim 3.",
            "subsections": {
                "4.1": {
                    "content": "Clarity The requirement that the claims must be clear applies to individual claims, i.e. to independent and dependent claims alike, and also to the claims as a whole. The clarity of the claims is of the utmost importance in view of their function in defining the matter for which protection is sought. Therefore, the meaning of the terms of a claim must, as far as possible, be clear for the person skilled in the art from the wording of the claim alone (see also F-IV, 4.2). In view of the differences in the scope of protection which may be attached to the various categories of claims, the division must ensure that the wording of a claim leaves no doubt as to its category. Where it is found that the claims lack clarity under Art. 84, this may have led to the issuing of a partial European or supplementary European search report under Rule 63 (see B-VIII, 3.1 and 3.2). In such cases, in the absence of appropriate amendment and/or convincing arguments from the applicant as to why the invitation under Rule 63(1) was not justified, an objection under Rule 63(3) will also arise (see H-II, 5)."
                },
                "4.2": {
                    "content": "Interpretation Each claim must be read giving the words the meaning and scope which they normally have in the relevant art, unless in particular cases the description gives the words a special meaning, by explicit definition or otherwise. Moreover, if such a special meaning applies, the division will, so far as possible, require the claim to be amended whereby the meaning is clear from the wording of the claim alone. This is important because it is only the claims of the European patent, not the description, which will be published in all the official languages of the EPO. The claim must also be read with an attempt to make technical sense out of it. Such a reading may involve a departure from the strict literal meaning of the wording of the claims. Art. 69 and its Protocol do not provide a basis for excluding what is literally covered by the terms of the claims (see T 223/05)."
                },
                "4.3": {
                    "content": "Inconsistencies Any inconsistency between the description and the claims must be avoided if it casts doubt on the subject-matter for which protection is sought and therefore render the claim unclear or unsupported under Art. 84, second sentence, or, alternatively, render the claim objectionable under Art. 84, first sentence. Such inconsistency can be of the following kinds: (i) Simple verbal inconsistency For example, there is a statement in the description which suggests that the invention is limited to a particular feature but the claims are not thus limited; also, the description places no particular emphasis on this feature and there is no reason for believing that the feature is essential for the performance of the invention. In such a case, the inconsistency can be removed either by broadening the description or by limiting the claims. Similarly, if the claims are more limited than the description, the claims may be broadened or the description may be limited. See also paragraph (iii) below. (ii) Inconsistency regarding apparently essential features For example, it may appear, either from general technical knowledge or from what is stated or implied in the description, that a certain described technical feature not mentioned in an independent claim is essential to the performance of the invention, or, in other words, is necessary for the solution of the problem to which the invention relates. In such a case, the claim does not meet the requirements of Art. 84, because Art. 84, first sentence, when read in conjunction with Rule 43(1) and (3), has to be interpreted as meaning not only that an independent claim must be comprehensible from a technical point of view but also that it must clearly define the subject-matter of the invention, that is to say indicate all the essential features thereof (see T 32/82). If, in response to this objection, the applicants show convincingly, e.g. by means of additional documents or other evidence, that the feature is in fact not essential, they may be allowed to retain the unamended claim and, where necessary, to amend the description instead. The opposite situation in which an independent claim includes features which do not seem essential for the performance of the invention is not objectionable. This is a matter of the applicant's choice. The division therefore does not suggest that a claim be broadened by the omission of apparently inessential features; (iii) Part of the description and/or drawings is inconsistent with the subject-matter for which protection is sought - Description inconsistent with independent claim(s) According to Art. 84, second sentence, the claims must be supported by the description. This means that there must not be inconsistency between the claims and the description. Parts of the description that give the skilled person the impression that they disclose ways to carry out the invention but are not encompassed by the wording of the claims are inconsistent (or contradictory) with the claims. Such inconsistencies may be present in the application as originally filed or may result from amending the claims to such an extent that they are no longer consistent with the description or drawings. For example, an inconsistency may exist due to the presence of an alternative feature which has a broader or different meaning than a feature of the independent claim. Further, an inconsistency arises if the embodiment comprises a feature which is demonstrably incompatible with an independent claim. Moreover, features required by the independent claims may not be described in the description as being optional using wording such as \"preferably\", \"may\" or \"optionally\". The description must be amended to remove such terms if they make a mandatory feature of an independent claim appear as being optional. Examples: - the independent claim defines a feature as being made of \"purely substance X\", whereas the description defines it as being made of a blend of substances \"X and Y\"; - the independent claim defines the feature of an article comprising nicotine-free liquid material, whereas the description states that the liquid material may contain nicotine. However, it is not an inconsistency when an embodiment comprises further features which are not claimed as dependent claims as long as the combination of the features in the embodiment is encompassed by the subject-matter of an independent claim. Similarly, it is not an inconsistency when an embodiment fails to explicitly mention one or more features of an independent claim as long as they are present by reference to another embodiment or implicit. Example: Where the claim comprises features A, B and C taken in combination, the passages dealing individually with how each of A, B and C are realised are normally understood as describing the refinements of the combination defined in the claim unless there are indications to the contrary. The passages which describe only the realisation of feature A, for example by introducing features A1-A3 and discussing their advantages, but which can be interpreted as meant for being combined with the other features of the claim, would not need an amendment caused by the limitation of the claim from B to B2 unless one of A1-A3 is incompatible with B2. On the other hand, any passage explicitly referring to a sub-combination of the claimed features (e.g. only A or A+B) as being the invention is inconsistent with the claim. Subject-matter in the description regarded as an exception to patentability under Art. 53 needs to be excised, reworded such that it does not fall under the exceptions to patentability or prominently marked as not being according to the claimed invention (see G-II, 4.2 for adaptation of the description for methods of treatment of the human and animal body, G-II, 5.3 for adaptation of the description for the use of human embryonic stem cells and G-II, 5.4 for adaptation of the description for plant and animals). For borderline cases where there is doubt as to whether an embodiment is consistent with the claims, the benefit of the doubt is given to the applicant. - Procedural aspects and examples The applicant must remove any inconsistencies by amending the description either by deleting the inconsistent embodiments or marking appropriately so that it is clear that they do not fall within the subject-matter for which protection is sought. See paragraph (i) above for the case where an inconsistency can be removed by broadening the claims. Example: Independent claim defines a vehicle with a broad feature of a \"motor\", together with other features. The description and the drawings comprise Embodiment 1, in which the vehicle has an electric motor, and Embodiment 2, in which the vehicle has a combustion engine. During the prosecution, in order to fulfil the requirements of inventive step, the independent claim is amended to specify a vehicle employing an electric motor since the combination of claimed features using a combustion engine was anticipated by the prior art. Embodiment 2 is no longer consistent with the independent claim, unless it can be inferred from this embodiment that the combustion engine is used in combination with the electric motor. This inconsistency must be rectified either by removing Embodiment 2 from the description and drawings or by marking Embodiment 2 as not being covered by the claimed subject-matter (e.g. \"Embodiment 2 is not covered by the subject-matter of the claims\" or similar wording). An inconsistency between the description and the claims cannot be removed by introducing at the beginning of the description a generic statement such as \"embodiments not falling under the scope of the appended claims are to be considered merely as examples suitable for understanding the invention\" without indicating which parts of the description are no longer covered. To remove the inconsistency, such a statement has to refer to specific embodiments (e.g. \"Embodiments X and Y are not encompassed by the wording of the claims but are considered as useful for understanding the invention\"). The terms \"disclosure\", \"example\", \"aspect\" or similar, on their own, do not necessarily imply that what follows is not encompassed by an independent claim. Unambiguous expressions have to be adopted to mark an inconsistent embodiment (e.g. by adding \"not encompassed by the wording of the claims\", \"not according to the claimed invention\" or \"outside the subject-matter of the claims\") instead of merely replacing the terms \"embodiment\" or \"invention\" by one of the aforementioned terms. As long as the resulting text of the description does not present conflicting information to the reader, an inconsistent embodiment may also be remedied by ensuring that it is not referred to as being \"according to the invention\" throughout the description and by complementing the reference to it with an explicit statement to the effect that it is retained due to being useful for understanding the invention (e.g. \"embodiment useful for understanding the invention\", \"comparative example from background art\". When inviting the applicant to amend the description, the division provides examples of embodiments inconsistent with the independent claims and brief reasons why. If the inconsistency concerns describing a mandatory feature of an independent claim as optional, the division provides an example passage. See also H-V, 2 for the allowability of amendments to the description. An inconsistency between the description/drawings and the claims may frequently occur when, after a limitation of the claims following an invitation under Rule 62a(1) or Rule 63(1), the subject-matter excluded from the search is still present in the description. Unless the initial objection was not justified, such subject-matter is objected to under Art. 84 (inconsistency between the claims and the description). Furthermore, an inconsistency between the description/drawings and the claims will occur when, after a non-unity objection (Rule 64 or Rule 164), the claims have been limited to only one of the originally claimed inventions: the embodiments and/or examples of the non-claimed inventions must be either deleted or clearly indicated as not being covered by the claims."
                },
                "4.4": {
                    "content": "General statements, \"spirit of the invention\", claim-like clauses General statements in the description which imply that the extent of protection may be expanded in some vague and not precisely defined way are not allowed. In particular, any statement which refers to the extent of protection being expanded to cover the \"spirit of the invention\" or \"all equivalents\" of the claims must be deleted. Statements that refer to the extent of protection covering the \"scope of the claims\" or the invention being \"defined in the claims\" are allowed. This does not preclude the removal of inconsistencies (F-IV, 4.3). Analogously, in the case where the claims are directed to a combination of features, any statement that seems to imply that protection is nevertheless sought not only for the combination as a whole but also for individual features or sub-combinations thereof must be deleted. Finally, claim-like clauses must also be deleted or amended to avoid claim-like language prior to grant since they otherwise may lead to unclarity on the subject-matter for which protection is sought. \"Claim-like\" clauses are clauses present in the description which despite not being identified as a claim, appear as such and usually comprise an independent clause followed by a number of clauses referring to previous clauses. These claim-like clauses are usually found at the end of the description and/or in the form of numbered paragraphs, particularly in divisional or Euro-PCT applications, where the original set of claims from the parent or PCT application is appended to the description."
                },
                "4.5": {
                    "content": "Essential features",
                    "subsections": {
                        "4.5.1": {
                            "content": "Objections arising from missing essential features The claims, which define the matter for which protection is sought, must be clear, meaning not only that a claim must be comprehensible from a technical point of view, but also that it must define clearly all the essential features of the invention (see T 32/82). Furthermore, the requirement of Art. 84 that the claims be supported by the description applies to features which are explicitly presented in the description as being essential for carrying out the invention (see T 1055/92). A lack of essential features in the independent claim(s) is therefore to be dealt with under the clarity and support requirements."
                        },
                        "4.5.2": {
                            "content": "Definition of essential features Essential features of a claim are those necessary for achieving a technical effect underlying the solution of the technical problem with which the application is concerned (the problem usually being derived from the description). The independent claim(s) must therefore contain all features explicitly described in the description as being necessary to carry out the invention. Any features which, even if consistently mentioned in the context of the invention throughout the application, do not actually contribute to the solution of the problem are not essential features. As a general rule, the technical effect or result produced by the feature will provide the key to answering the question of whether or not the feature contributes to solving the problem (see also G-VII, 5.2). If a claim is to a process for producing the product of the invention, then the process as claimed must be one which, when carried out in a manner which would seem reasonable to a person skilled in the art, necessarily has as its end result that particular product; otherwise there is an internal inconsistency and therefore lack of clarity in the claim. In particular, where patentability depends on a technical effect, the claims must be so drafted as to include all the technical features of the invention which are essential for the technical effect (see T 32/82). Claims towards plants or animals which are not exclusively produced by an essentially biological process comprising a functionally defined phenotypic trait and which are worded as product-by-process claims (i.e. obtainable by crossing a plant with a plant grown from deposited seed having accession number XXX and selecting for a progeny plant comprising the phenotypic trait) must fulfil the clarity requirement of Art. 84, as must any other type of claim. In particular, the claimed subject-matter must be defined so that the public is left in no doubt about what the subject-matter for which protection is sought actually is. If the process through which the claimed plant or animal is defined does not impart identifiable and unambiguous technical features to the plant or animal, e.g. the genetic information present in the genome, the claim directed to a plant or animal lacks clarity."
                        },
                        "4.5.3": {
                            "content": "Generalisation of essential features In deciding how specific the essential features must be, the provisions of Art. 83 must be borne in mind: it is sufficient if the application as a whole describes the necessary characteristics of an invention in a degree of detail such that a person skilled in the art can perform the invention (see F-III, 3). It is not necessary to include all details of the invention in the independent claim. Thus a certain degree of generalisation of the claimed features may be permitted, provided that the claimed generalised features as a whole allow the problem to be solved. In this case a more specific definition of the features is not required. This principle applies equally to structural and functional features."
                        },
                        "4.5.4": {
                            "content": "Implicit features As detailed above, an independent claim must specify explicitly all of the essential features needed to define the invention. This applies except in so far as such features are implied by the generic terms used, e.g. a claim to a \"bicycle\" does not need to mention the presence of wheels. In the case of a product claim, if the product is of a well-known kind and the invention lies in modifying it in certain respects, it is sufficient that the claim clearly identifies the product and specifies what is modified and in what way. Similar considerations apply to claims for an apparatus."
                        },
                        "4.5.5": {
                            "content": "Examples Examples illustrating essential features can be found in the Annex to F-IV."
                        }
                    }
                },
                "4.6": {
                    "content": "Relative terms",
                    "subsections": {
                        "4.6.1": {
                            "content": "Clarity objections Relative or similar terms such as \"thin\", \"wide\" or \"strong\" constitute a potentially unclear element due to the fact that their meaning may change depending on the context. For these terms to be allowed, their meaning must be clear in the context of the whole disclosure of the application or patent. However, if a relative or similar term is used by the applicant as the only feature to distinguish the subject-matter of a claim from the prior art, the use of this term is objected to under Art. 84 unless the term has a well-recognised meaning in the particular art, e.g. \"high-frequency\" in relation to an amplifier, and this is the meaning intended. Where the relative term has no well-recognised meaning the division invites the applicant to replace it, if possible, by a more precise wording found elsewhere in the disclosure as originally filed. Where there is no basis in the disclosure for a clear definition and the term is no longer the only distinguishing feature, it may be retained in the claim, because excising it would generally lead to an extension of the subject-matter beyond the content of the application as filed – in contravention of Art. 123(2)."
                        },
                        "4.6.2": {
                            "content": "Interpretation of relative terms When the use of a relative term is allowed in a claim, this term is interpreted by the division in the least restrictive possible way when determining the extension of the subject-matter of the claim. As a consequence, in many cases, a relative term is not limiting the extension of the subject-matter of a claim. For example, the expression \"a thin metal plate\" does not limit the feature \"metal plate\" against the prior art: a metal plate is \"thin\" only when compared to another one, but it does not define an objective and measurable thickness. So a metal plate three millimetres thick is thin when compared to a plate five millimetres thick, but thick when compared to a plate one millimetre thick. As another example, when considering \"an element mounted near the end of a truck\", is this element mounted 1 mm from the end of the truck, 10 cm or 2 m? The only limitation of such an expression is that the element must be nearer to the end of the truck than to its middle, i.e. the element can be mounted anywhere in the quarter of the truck next to the end. Also, unless otherwise clear from the context, the term \"elastic\" does not limit the type of material, because elasticity is an intrinsic property of any solid material measured by Young's modulus. In other words, taken outside any context an elastic material can be anything from rubber to diamond."
                        }
                    }
                },
                "4.7": {
                    "content": "Terms such as \"about\", \"approximately\" or \"substantially\"",
                    "subsections": {
                        "4.7.1": {
                            "content": "Interpretation of terms such as \"about\", \"approximately\" or \"substantially\" Where terms such as \"about\" or \"approximately\" are applied to a particular value (e.g. \"about 200°C\" or \"approximately 200°C\") or to a range (e.g. \"about x to approximately y\"), the value or range is interpreted as being as accurate as the method used to measure it. If no error margins are specified in the application, the same principles described in G-VI, 7.1 apply, i.e. the expression \"about 200°C\" is interpreted as having the same round-off as \"200°C\". If error margins are specified in the application, they must be used in the claims in place of the expression containing \"about\" or similar terms. When terms such as \"substantially\" or \"approximately\" qualify a structural unit of an apparatus (e.g. \"a tray plate with a substantially circular circumference\" or \"a tray plate with an approximately curved base\"), the expression containing the term \"substantially\" or \"approximately\" will be interpreted as a technical feature being produced within the technical tolerance of the method used to manufacture it (e.g. cutting a metal is much more accurate than cutting a plastic; or cutting with a CNC machine is more accurate than cutting by hand) unless the application suggests otherwise. In other words, in the absence of any indication to the contrary in the application, the expression \"a tray plate with a substantially circular circumference\" is interpreted as claiming the same technical feature as \"a tray plate with a circular circumference\"; in turn both expressions are considered as claiming any tray whose base the skilled person in the manufacturing field would consider as being circular. The same applies when the expression containing \"substantially\" or \"approximately\" implies that a certain effect or result can be obtained within a certain tolerance and the skilled person knows how to obtain that tolerance. For example, \"a substantially vertical seat back\" is interpreted as allowing for a certain +/- variation around 90° where the skilled person can recognise that a functionality for supporting the sitting person's back is present."
                        },
                        "4.7.2": {
                            "content": "Clarity objections If the application suggests that the use of terms such as \"about\", \"approximately\" or \"substantially\" extends either the interval claimed by a value and/or range outside the error margins of the measurement system or the structural unit beyond the manufacturing tolerances or any other tolerance that the skilled person would take into consideration in the technical field concerned, then the wording of the claims becomes vague and undefined. This leads to an objection under Art. 84 because the presence of this wording prevents the subject-matter of the claims from being unambiguously distinguished from the prior art with respect to novelty and inventive step. For example, if the application suggests that an icosagon (20-sided polygon) is also a \"substantially circular circumference\" for a metal tray realised by a CNC waterjet cutting machine, this renders the scope of the claims unclear because: (i) the tolerance indicated by the application is outside the tolerance of the manufacturing method (a CNC waterjet cutting machine approximates a circular circumference by using a polygon with hundreds of sides); and (ii) if an icosagon is also a \"substantially circular circumference\", what about an enneadecagon (19-sided polygon) or an octadecagon (18-sided polygon)? When does a polygon stop being a \"substantially circular circumference\"? How can this be assessed objectively by the person skilled in the art?"
                        }
                    }
                },
                "4.8": {
                    "content": "Trade marks The use of trade marks and similar expressions in claims is not allowed as it does not guarantee that the product or feature referred to is not modified while maintaining its name during the term of the patent. They may be allowed exceptionally if their use is unavoidable and they are generally recognised as having a precise meaning. With regard to the need to acknowledge trade marks as such in the description, see F-II, 4.14. With regard to the effect of references to trade marks on sufficiency of disclosure (Art. 83), see F-III, 7."
                },
                "4.9": {
                    "content": "Optional features Optional features, i.e. features preceded by expressions such as \"preferably\", \"for example\", \"such as\" or \"more particularly\" are allowed if they do not introduce ambiguity. In such a case, they are to be regarded as entirely optional. These expressions introduce ambiguity and render the scope of the claim unclear if they do not lead to a restriction of the subject-matter of the claim. For example, the wording \"a method to manufacture an artificial stone, such as a clay brick\" does not fulfil the requirements of Art. 84, because a clay brick will never be an artificial stone. Hence it is unclear if either an artificial stone or a clay brick is manufactured by the method of the claim. Analogously, the wording \"the solution is heated up to between 65 and 85°C, particularly to 90°C\" does not fulfil the requirements of Art. 84 because the temperature after the term \"particularly\" contradicts the range before it."
                },
                "4.10": {
                    "content": "Result to be achieved The area defined by the claims must be as precise as the invention allows. As a general rule, claims which attempt to define the invention by a result to be achieved are not allowed, in particular if they only amount to claiming the underlying technical problem. However, they may be allowed if the invention either can only be defined in such terms or cannot otherwise be defined more precisely without unduly restricting the scope of the claims and if the result is one which can be directly and positively verified by tests or procedures adequately specified in the description or known to the person skilled in the art and which do not require undue experimentation (see T 68/85). For example, the invention may relate to an ashtray in which a smouldering cigarette end will be automatically extinguished due to the shape and relative dimensions of the ashtray. The latter may vary considerably in a manner difficult to define whilst still providing the desired effect. So long as the claim specifies the construction and shape of the ashtray as clearly as possible, it may define the relative dimensions by reference to the result to be achieved, provided that the specification includes adequate directions to enable the skilled person to determine the required dimensions by routine test procedures (see F-III, 1 to F-III, 3). However, these cases have to be distinguished from those in which the product is defined by the result to be achieved and the result amounts in essence to the problem underlying the application. It is established case law that an independent claim must indicate all the essential features of the object of the invention in order to comply with the requirements of Art. 84 (see G 2/88 and G 1/04). Art. 84 also reflects the general legal principle that the extent of monopoly conferred by a patent, as defined in the claims, must correspond to the technical contribution to the art. It must not extend to subject-matter which, after reading the description, would still not be at the disposal of the person skilled in the art (T 409/91). The technical contribution of a patent resides in the combination of features which solve the problem underlying the application. Therefore, if the independent claim defines the product by a result to be achieved and the result amounts in essence to the problem underlying the application, that claim must state the essential features necessary to achieve the result claimed (T 809/12), see also F-IV, 4.5. The above-mentioned requirements for allowing a definition of subject-matter in terms of a result to be achieved differ from those for allowing a definition of subject-matter in terms of functional features (see F-IV, 4.22 and F-IV, 6.5)."
                },
                "4.11": {
                    "content": "Parameters Parameters are characteristic values, which may be values of directly measurable properties (e.g. the melting point of a substance, the flexural strength of a steel, the resistance of an electrical conductor) or may be defined as more or less complicated mathematical combinations of several variables in the form of formulae. The characteristics of a product may be specified by parameters related to the physical structure of the product, provided that those parameters can be clearly and reliably determined by objective procedures which are usual in the art. Where the characteristics of the product are defined by a mathematical relation between parameters, each parameter needs to be clearly and reliably determined. The same applies to process-related features defined by parameters. The requirements of Art. 84 with regard to the characterisation of a product by parameters can be summarised as follows (see T 849/11): (i) the claims must be clear in themselves when read by the skilled person (not including knowledge derived from the description); (ii) the method for measuring a parameter (or at least a reference thereto) must appear completely in the claim itself; and (iii) an applicant who chooses to define the scope of the claim by parameters needs to ensure that the skilled person can easily and unambiguously verify whether they are working inside or outside the scope of the claim. If the description of the method for measuring a parameter is so long that its inclusion makes the claim unclear through lack of conciseness or difficult to understand, the requirement under point (ii) can be met by including in the claim a reference to the description, in accordance with Rule 43(6). Furthermore the requirement under point (ii) can still be met if it can be convincingly shown that (see T 849/11): (a) the measurement method to be employed belongs to the skilled person's common general knowledge, e.g. because there is only one method, or because a particular method is commonly used; or (b) all the measurement methodologies known in the relevant technical field for determining this parameter yield the same result within the appropriate limit of measurement accuracy. For further issues relating to lack of support and sufficiency of disclosure regarding parameters, see F-III, 11 and F-IV, 6.4.",
                    "subsections": {
                        "4.11.1": {
                            "content": "Unusual parameters Unusual parameters are parameters not commonly used in the field of the invention. Two main situations can present themselves: (i) The unusual parameter measures a property of the product/process for which another generally recognised parameter is used in the field of the invention. (ii) The unusual parameter measures a property of the product/process that was not measured before in the field of the invention. In addition to the requirements contained in F-IV, 4.11: - Cases in which an unusual parameter of type (i) is employed and no straightforward conversion from the unusual parameter to the parameter generally recognised in the art is possible, or a non-accessible apparatus for measuring the unusual parameter is used are prima facie objectionable on grounds of lack of clarity, as no meaningful comparison with the prior art can be made. Such cases might also disguise lack of novelty (see G-VI, 5). - Use of unusual parameters of type (ii) is allowable if it is evident from the application that the skilled person would face no difficulty in carrying out the presented tests and would thereby be able to establish the exact meaning of the parameter and to make a meaningful comparison with the prior art. In addition, the onus of proof that an unusual parameter is a genuine distinctive feature vis-à-vis the prior art lies with the applicant. No benefit of doubt can be accorded in this respect (see G-VI, 5). Example of an allowable unusual parameter of type (ii) The application explains that the abrasive action of sandpaper of very fine grade is improved if strips with abrasive grain are alternated with strips without abrasive grain. Claim 1 contains an unusual parameter of type (ii) that measures the relationship between the widths of the abrasive strips and the non-abrasive strips within a certain length of the sandpaper. The skilled person has no problem in establishing the exact meaning of the parameter, measuring it and determining its genuine distinctive feature against the prior art."
                        }
                    }
                },
                "4.12": {
                    "content": "Product-by-process claim A claim defining a product in terms of a process is to be construed as a claim to the product as such. The technical content of the invention lies not in the process per se, but rather in the technical properties imparted to the product by the process. Claims defining plants or animals produced by a method including a technical step which imparts a technical feature to a product constitute an exception in so far as the requirements of Art. 53(b) as interpreted by Rule 28(2) are concerned. The exclusion under Rule 28(2) regarding plants and animals exclusively obtained by means of an essentially biological process does not apply to patents granted before 1 July 2017 nor to pending patent applications with a filing date and/or a priority date before 1 July 2017 (see G 3/19, OJ EPO 2020, A119). If a technical feature of a claimed plant or animal, e.g. a single nucleotide exchange in the genome, can be the result of both a technical intervention (e.g. directed mutagenesis) and an essentially biological process (a natural allele), a disclaimer is necessary to delimit the claimed subject-matter to the technically produced product (see examples in G-II, 5.4.2.1 and G-II, 5.4). If, on the other hand, the feature in question can unambiguously be obtained by technical intervention only, e.g. a transgene, no disclaimer is necessary. For the general principles governing disclaimers see H-V, 4.1 and H-V, 4.2. If the process through which the claimed plant or animal is defined does not impart identifiable and unambiguous technical features to the plant or animal, e.g. the genetic information present in the genome, the claim directed to a plant or animal lacks clarity. Claims for products defined in terms of a process of manufacture are allowable only if the products as such fulfil the requirements for patentability, i.e. inter alia that they are new and inventive, and it is impossible to define the claimed product other than in terms of a process of manufacture. A product is not rendered novel merely by the fact that it is produced by means of a new process. The claim may for instance take the form \"Product X obtainable by process Y\". Irrespective of whether the term \"obtainable\", \"obtained\", \"directly obtained\" or an equivalent wording is used in the product-by-process claim, it is still directed to the product per se and confers absolute protection upon the product. As regards novelty, when a product is defined by its method of manufacture, the question to be answered is whether the product under consideration is identical to known products. The burden of proof for an allegedly distinguishing \"product-by-process\" feature lies with the applicant, who has to provide evidence that the modification of the process parameters results in another product, for example by showing that distinct differences exist in the properties of the products. Nevertheless, the division needs to furnish reasoned argumentation to support the alleged lack of novelty of a product-by-process claim, especially if this objection is contested by the applicant (see G 1/98, T 828/08). Similarly, examination of product or product-by-process claims in respect of their patentability under the EPC is unaffected by the extent of the protection conferred by the patent or the patent application (see G 2/12 and G 2/13, Reasons VIII(2)(6)(b)).",
                    "subsections": {
                        "4.12.1": {
                            "content": "Product claim with process features Provided that they are allowable, the process features in a product claim comprising both product features and process features can establish the novelty of the claimed product only if they cause the claimed product to have different properties from the products known from the prior art. As in the case of product-by-process claims (see F-IV, 4.12), the burden of proof for an allegedly distinguishing \"product-by-process\" feature lies with the applicant."
                        }
                    }
                },
                "4.13": {
                    "content": "Interpretation of expressions stating a purpose",
                    "subsections": {
                        "4.13.1": {
                            "content": "Interpretation of expressions such as \"Apparatus for ...\", \"Product for ... \" If a claim commences with such words as \"Apparatus for carrying out the process ...\", this must be construed as meaning merely apparatus suitable for carrying out the process. An apparatus which otherwise possesses all of the features specified in the claims but which is unsuitable for the stated purpose or requires modifications to enable it to be so used for said purpose, is normally not considered as anticipating the claim. Similar considerations apply to a claim for a product for a particular use. For example, if a claim refers to a \"mould for molten steel\", this implies certain limitations for the mould. Therefore, a plastic ice cube tray with a melting point much lower than that of steel does not come within the claim. Similarly, a claim to a substance or composition for a particular use is construed as meaning a substance or composition which is in fact suitable for the stated use; a known product which prima facie is the same as the substance or composition defined in the claim, but which is in a form which renders it unsuitable for the stated use, does not deprive the claim of novelty. However, if the known product is in a form in which it is in fact suitable for the stated use, though it has never been described for that use, it deprives the claim of novelty. An exception to this general principle of interpretation is where the claim is to a known substance or composition for use in a surgical, therapeutic or diagnostic method (see G-II, 4.2 and G-VI, 6.1)."
                        },
                        "4.13.2": {
                            "content": "Interpretation of means-plus-function features (\"means for ... \") Means-plus-function features (\"means for ...\") are a type of functional feature and hence do not contravene the requirements of Art. 84. Any prior art feature suitable for carrying out the function of a means-plus-function feature will anticipate the latter. For example, the feature \"means for opening a door\" is anticipated by both the door key and a crowbar. An exception to this general principle of interpretation is where the function of the means-plus-function feature is carried out by a computer or similar apparatus. In this case the means-plus-function features are interpreted as means adapted to carry out the relevant steps/functions, rather than merely means suitable for carrying them out. Example: \"1. An eyeglass lens grinding machine for processing a lens such that the lens is fitted in an eyeglass frame, said machine comprising: at least a grinding wheel for bevelling the lens; means for receiving frame configurational data on the eyeglass frame and layout data to be used in providing a layout of the lens relative to the eyeglass frame; means for detecting an edge position of the lens on the basis of the received frame data and layout data; means for determining a first bevel path by calculation based on the result of detection by said edge position detecting means; means for determining a second bevel path obtained by tilting said first bevel path such that said second bevel path passes through a desired position on a lens edge; and means for controlling the grinding wheel during the bevelling of the lens on the basis of said second bevel path.\" \"1. An eyeglass lens grinding machine for processing a lens such that the lens is fitted in an eyeglass frame, said machine comprising at least a grinding wheel for bevelling the lens; a computer adapted to: - receive frame configurational data on the eyeglass frame and layout data to be used in providing a layout of the lens relative to the eyeglass frame; - detect an edge position of the lens on the basis of the received frame data and layout data; - determine a first bevel path by calculation based on the result of detection by said edge position detecting means; - determine a second bevel path that is obtained by tilting said first bevel path such that said second bevel path passes through a desired position on a lens edge; and - control the grinding wheel during the bevelling of the lens on the basis of said second bevel path.\" Each of these two claims is new over a prior art disclosing an eyeglass lens grinding machine comprising a grinding wheel and a computer for controlling the grinding wheel if the specific processing steps are not disclosed in the prior art. When \"means for\" refers to computer means, the processing steps being defined as \"means for + function\" (first claim) and \"computer adapted to + function\" (second claim) are to be interpreted as limiting. Therefore, a prior-art document disclosing an eyeglass lens grinding machine comprising at least a grinding wheel for bevelling the lens and a computer only anticipates these claims if the prior-art document also discloses that the computer is programmed to carry out the claimed steps. For further information on claim formulations commonly used in computer-implemented inventions, see F-IV, 3.9."
                        },
                        "4.13.3": {
                            "content": "Interpretation of expressions such as \"Method for ...\" In the context of a method, two different types of stated purpose are possible, namely those that define the application or use of a method, and those that define an effect arising from the steps of the method and are implicit therein (see T 1931/14). Where the stated purpose defines the specific application of the method, this purpose requires additional steps which are not implied by or inherent in the other remaining steps defined in the claim, and without which the claimed process would not achieve the stated purpose. Hence a method claim that defines a working method which, for example, commences with such words as \"Method for remelting galvanic layers\", the part \"for remelting ...\" is not to be understood as meaning that the process is merely suitable for remelting galvanic layers, but rather as a functional feature concerning the remelting of galvanic layers and, hence, defining one of the method steps of the claimed working method (see T 1931/14 and T 848/93). Analogously, in the case of a \"method of manufacture\", i.e. a claim directed to a method for manufacturing a product, the fact that the method results in the product is to be treated as an integral method step (see T 268/13). On the other hand, where the purpose merely states a technical effect which inevitably arises when carrying out the other remaining steps of the claimed method and is thus inherent in those steps, this technical effect has no limiting effect on the subject-matter of the claim. For example, a method claim concerning the application of a particular surface active agent to a specified absorbent product and defining its purpose as \"for reducing malodor\" in terms of an intended technical effect is anticipated by a prior-art document describing a method having such suitability \"for reducing malodor\" although not mentioning the specific use (see T 1931/14 and T 304/08)."
                        }
                    }
                },
                "4.14": {
                    "content": "Definition by reference to (use with) another entity A claim in respect of a physical entity (product, apparatus) may seek to define the invention by reference to features relating to another entity that is not part of the claimed first entity but that is related to it through use. An example of such a claim is \"a cylinder head for an engine\", where the former is defined by features of its location in the latter. Since the first entity (the cylinder head) can often be produced and marketed independently of the other entity (the engine), the applicant is normally entitled to independent protection of the first entity per se. Therefore, in first instance, such a claim is always interpreted as not including the other entity or its features: these limit the subject-matter of the claim only in so far as the first entity's features are suitable to be used with the second entity's features. In the above example, the cylinder head must be suitable to be mounted in the engine described in the claim, but the features of the engine do not limit the subject-matter of the claim per se. Only if the claim is directed without any doubt to a combination of the first and second entities, the features of the other entity are limiting for the subject-matter of the claim. In the above example, the claim should be written as an \"engine with a cylinder head\" or an \"engine comprising a cylinder head\" for the features of the engine to be considered as limiting the subject-matter of the claim. For the assessment of claims directed to computer-implemented inventions, where a claim to a computer program refers to a computer (a separate entity), see F-IV, 3.9.",
                    "subsections": {
                        "4.14.1": {
                            "content": "Clarity objections Once it has been established if a claim is directed to either one entity or to a combination of entities, the wording of the claim must be adapted appropriately to reflect it; otherwise the claim is objected to under Art. 84. For example, in the case of a claim directed to a single entity, the first entity is \"connectable\" to the second entity; in the case of a claim directed to a combination of entities the first entity is \"connected\" to the second entity."
                        },
                        "4.14.2": {
                            "content": "Dimensions and/or shape defined by reference to another entity It may be allowable to define the dimensions and/or shape of a first entity in an independent claim by general reference to the dimensions and/or corresponding shape of a second entity which is not part of the claimed first entity but is related to it through use. This particularly applies where the size of the second entity is in some way standardised (for example, in the case of a mounting bracket for a vehicle number-plate, where the bracket frame and fixing elements are defined in relation to the outer shape of the number-plate). Furthermore, references to second entities which cannot be seen as subject to standardisation may also be sufficiently clear in cases where the skilled person would have little difficulty in inferring the resultant restriction of the scope of protection for the first entity (for example, in the case of a covering sheet for an agricultural round bale, where the length and breadth of the covering sheet and how it is folded are defined by reference to the bale's circumference, width and diameter, see T 455/92). It is neither necessary for such claims to contain the exact dimensions of the second entity, nor do they have to refer to a combination of the first and second entities. Specifying the length, width and/or height of the first entity without reference to the second would lead to an unwarranted restriction of the scope of protection."
                        }
                    }
                },
                "4.15": {
                    "content": "The expression \"in\" To avoid ambiguity, particular care is exercised when assessing claims which employ the word \"in\" to define a relationship between different physical entities (product, apparatus), or between entities and activities (process, use), or between different activities. Examples of claims worded in this way include the following: (i) Cylinder head in a four-stroke engine; (ii) In a telephone apparatus with an automatic dialler, dial tone detector and feature controller, the dial tone detector comprising ...; (iii) In a process using an electrode feeding means of an arc-welding apparatus, a method for controlling the arc welding current and voltage comprising the following steps: ...; and (iv) In a process/system/apparatus etc. ... the improvement consisting of... In examples (i) to (iii) the emphasis is on the fully functioning sub-units (cylinder head, dial tone detector, method for controlling the arc welding current and voltage) rather than the complete unit within which the sub-unit is contained (four-stroke engine, telephone, process). This can make it unclear whether the protection sought is limited to the sub-unit per se, or whether the unit as a whole is to be protected. For the sake of clarity, claims of this kind must be directed either to \"a unit with (or comprising) a sub-unit\" (e.g. \"four-stroke engine with a cylinder head\"), or to the sub-unit per se, specifying its purpose (for example, \"cylinder head for a four-stroke engine\"). The latter course may be followed only at the applicant's express wish and only if there is a basis for it in the application as filed, in accordance with Art. 123(2). With claims of the type indicated by example (iv), the use of the word \"in\" sometimes makes it unclear whether protection is sought for the improvement only or for all the features defined in the claim. Here, too, it is essential to ensure that the wording is clear. However, claims such as \"use of a substance ... as an anticorrosive ingredient in a paint or lacquer composition\" are acceptable on the basis of second non-medical use (see G-VI, 6.2)."
                },
                "4.16": {
                    "content": "Use claims For the purposes of examination, a \"use\" claim in a form such as \"the use of substance X as an insecticide\" is regarded as equivalent to a \"process\" claim of the form \"a process of killing insects using substance X\". Thus, a claim in the form indicated is not to be interpreted as directed to the substance X recognisable (e.g. by further additives) as intended for use as an insecticide. Similarly, a claim for \"the use of a transistor in an amplifying circuit\" is equivalent to a process claim for the process of amplifying using a circuit containing the transistor and is not to be interpreted as being directed to \"an amplifying circuit in which the transistor is used\", nor to \"the process of using the transistor in building such a circuit\". However, a claim directed to the use of a process for a particular purpose is equivalent to a claim directed to that very same process (see T 684/02). Care is to be taken when a claim relates to a two-step process which combines a use step with a product production step. This may be the case e.g. when a polypeptide and its use in a screening method have been defined as the only contribution to the art. An example of such a claim would then be: \"A method comprising: (a) contacting polypeptide X with a compound to be screened and (b) determining whether the compound affects the activity of said polypeptide, and subsequently transforming any active compound into a pharmaceutical composition.\" Many variations of such a claim are conceivable, but in essence they combine (a) a screening step (i.e. using a specified test material to select a compound having a given property) with (b) further production steps (i.e. further transforming the selected compound for instance into the desired composition). According to decision G 2/88 there are two different types of process claim, (i) the use of an entity to achieve a technical effect and (ii) a process for the production of a product. G 2/88 makes clear that Art. 64(2) applies only to processes of type (ii). The above claim and its analogues thus represent a combination of two different and irreconcilable types of process claim. Step (a) of the claim relates to a process of type (i), step (b) to a process of type (ii). Step (b) builds on the \"effect\" achieved by step (a), rather than step (a) feeding into step (b) a specific starting material and resulting in a specific product. Thus, the claim is made up partly of a use claim and partly of a process for producing a product. This renders the claim unclear according to Art. 84."
                },
                "4.17": {
                    "content": "References to the description or drawings As indicated in Rule 43(6), the claims must not, in respect of the technical features of the invention, rely on references to the description or drawings \"except where absolutely necessary\". In particular they must not normally rely on such references as \"as described in part ... of the description\", or \"as illustrated in Figure 2 of the drawings\". The emphatic wording of the excepting clause is to be noted. The onus is upon the applicant to show that it is \"absolutely necessary\" to rely on reference to the description or drawings in appropriate cases (see T 150/82). An example of an allowable exception is an invention involving some peculiar shape, illustrated in the drawings, but which cannot be readily defined either in words or by a simple mathematical formula. Another special case is that in which the invention relates to chemical products some of whose features can be defined only by means of graphs or diagrams."
                },
                "4.18": {
                    "content": "Reference signs If the application contains drawings, and the comprehension of the claims is improved by establishing the connection between the features mentioned in the claims and the corresponding reference signs in the drawings, then appropriate reference signs need to be placed in parentheses after the features mentioned in the claims. If there are a large number of different embodiments, only the reference signs of the most important embodiments need be incorporated in the independent claim(s). Where claims are drafted in the two-part form set out in Rule 43(1), the reference signs need to be inserted not only in the characterising part but also in the preamble of the claims. Reference signs are not however to be construed as limiting the extent of the matter protected by the claims; their sole function is to make claims easier to understand. A comment to that effect in the description is acceptable (see T 237/84). If text is added to reference signs in parentheses in the claims, lack of clarity can arise (Art. 84). Expressions such as \"securing means (screw 13, nail 14)\" or \"valve assembly (valve seat 23, valve element 27, valve seat 28)\" are not reference signs within the meaning of Rule 43(7) but are special features, to which the last sentence of Rule 43(7) is not applicable. Consequently, it is unclear whether the features added to the reference signs are limiting or not. Accordingly, such bracketed features are generally not permissible. However, additional references to those figures where particular reference signs are to be found, such as \"(13 – Figure 3; 14 -  Figure 4)\" are unobjectionable. A lack of clarity can also arise with bracketed expressions that do not include reference signs, e.g. the expression \"(concrete) moulded brick\" is unclear because it cannot be determined if the feature moulded brick is limited or not by the word concrete. In contrast, bracketed expressions with a generally accepted meaning are allowable, e.g. \"(meth)acrylate\" which is known as an abbreviation for \"acrylate and methacrylate\". The use of brackets in chemical or mathematical formulae is also unobjectionable, as is their use when correcting physical values not complying with the requirements as determined by the President under Rule 49(2)."
                },
                "4.19": {
                    "content": "Negative limitations (e.g. disclaimers) A claim's subject-matter is normally defined in terms of positive features indicating that certain technical elements are present. Exceptionally, however, the subject-matter may be restricted using a negative limitation expressly stating that particular features are absent. This may be done e.g. if the absence of a feature can be deduced from the application as filed (see T 278/88). Negative limitations such as disclaimers may be used only if adding positive features to the claim either would not define more clearly and concisely the subject-matter still protectable (see G 1/03 and T 4/80) or would unduly limit the scope of the claim (see T 1050/93). It has to be clear what is excluded by means of the disclaimer (see T 286/06). A claim containing one or more disclaimers must also fully comply with the clarity and conciseness requirements of Art. 84 (see G 1/03, Reasons 3). Moreover, in the interests of the patent's transparency, the excluded prior art needs to be indicated in the description in accordance with Rule 42(1)(b), and the relation between the prior art and the disclaimer needs to be shown. For the allowability of disclaimers excluding embodiments that were disclosed in the original application as being part of the invention, see H-V, 4.2.2. With respect to the allowability of disclaimers not disclosed in the application as originally filed (so-called undisclosed disclaimers), see H-V, 4.2.1."
                },
                "4.20": {
                    "content": "\"Comprising\" vs. \"consisting of\" This section outlines how the terms \"comprising\" and \"consisting of\" are to be interpreted when construing a claim. A claim directed to an apparatus/method/product \"comprising\" certain features is interpreted as meaning that it includes those features, but that it does not exclude the presence of other features, as long as they do not render the claim unworkable. On the other hand, if the wording \"consist of\" is used, then no further features are present in the apparatus/method/product apart from the ones following said wording. In particular, if a claim for a chemical compound refers to it as \"consisting of components A, B and C\" by their proportions expressed in percentages, the presence of any additional component is excluded and therefore the percentages must add up to 100% (see T 711/90). In the case of chemical compounds or compositions, the use of \"consisting essentially of\" or \"comprising substantially\" means that specific further components can be present, namely those not materially affecting the essential characteristics of the compound or composition. For any other apparatus/method/product these terms have the same meaning as \"comprising\". Regarding Art. 123(2), \"comprising\" does not provide per se an implicit basis for either \"consisting of\" or \"consisting essentially of\" (T 759/10)."
                },
                "4.21": {
                    "content": "Functional definition of a pathological condition When a claim is directed to a further therapeutic application of a medicament and the condition to be treated is defined in functional terms, e.g. \"any condition susceptible of being improved or prevented by selective occupation of a specific receptor\", the claim can be regarded as clear only if instructions, in the form of experimental tests or testable criteria, are available from the patent documents or from the common general knowledge allowing the skilled person to recognise which conditions fall within the functional definition and accordingly within the scope of the claim (see T 241/95; see also G-II, 4.2)."
                },
                "4.22": {
                    "content": "Broad claims The Convention does not explicitly mention overly broad claims. However, objections to such claims may arise for various reasons. Where there are discrepancies between the claims and the description, the claims are not sufficiently supported by the description (Art. 84) and also, in most cases, the invention is not sufficiently disclosed (Art. 83) (see T 409/91, F-IV, 6.1 and F-IV, 6.4). Sometimes an objection of lack of novelty arises, for example if the claim is formulated in such broad terms that it also covers known subject-matter from other technical fields. Broad claims may also cover embodiments for which a purported effect has not been achieved. On raising an objection of lack of inventive step in such cases, see G-VII, 5.2. For broad claims in opposition proceedings, see also D-V, 4 and 5."
                },
                "4.23": {
                    "content": "Order of claims There is no legal requirement that the first claim must be the broadest. However, Art. 84 requires that the claims must be clear not only individually but also as a whole. Therefore, where there are a large number of claims, they need to be arranged with the broadest claim first. If the broadest of a large number of claims is a long way down, so that it could easily be overlooked, the applicant is required either to rearrange the claims in a more logical way or to direct attention to the broadest claim in the introductory part or in the summary of the description. Furthermore, if the broadest claim is not the first one, the later broader claim must also be an independent claim. Consequently, where these independent claims are of the same category, an objection may also arise under Rule 43(2) (see F-IV, 3.2 and 3.3)."
                },
                "4.24": {
                    "content": "Interpretation of terms such as identity and similarity in relation to amino or nucleic acid sequences Amino acid or nucleic acid sequences can be defined by a percentage of identity. The percentage of identity determines the number of identical residues over a defined length in a given alignment. If no algorithm or calculation method for determining the percentage of identity is defined, the broadest interpretation will be applied using any reasonable algorithm or calculation method known at the relevant filing date. Amino acid sequences can be defined by a degree of similarity (expressed as a percentage of similarity). The term similarity is broader than the term identity because it allows conservative substitutions of amino acid residues having similar physicochemical properties over a defined length of a given alignment. The percentage of similarity is determinable only if a similarity-scoring matrix is defined. If no similarity-scoring matrix is defined, a claim referring to a sequence displaying a percentage of similarity to a recited sequence is considered to cover any sequence fulfilling the similarity requirement as determined with any reasonable similarity-scoring matrix known at the relevant filing date. For amino acid sequences, if a percentage of homology is used by the applicant as the only feature to distinguish the subject-matter of a claim from the prior art, its use is objected to under Art. 84 (cf. F-IV, 4.6.1) unless the determination or calculation of the percentage of homology is clearly defined in the application as filed. For nucleic acid sequences, homology percentage and identity percentage are usually considered to have the same meaning."
                }
            },
            "content": " Remarks: In this example, the method claim comprises a step which is defined as being executed by specific technical means (the electromagnetic detector in a pulse oximeter). A computer program claim making reference only to the method would lack clarity because such a program could not be executed e.g. on a general-purpose computer which does not have a pulse oximeter with an electromagnetic detector. Therefore, the computer program claim should be defined as being executed on the pulse oximeter with an electromagnetic detector (by referring to the device of claim 2) rather than only referring to the method claim 1. Example 2 Remarks: In this example the invention lies in the further processing of acquired data for determining the oxygen saturation in blood. The data can be received for example from a data file storing data previously acquired by the electromagnetic detector. Such a method can therefore be carried out by generic data processing means, for example in the form of a desktop computer. It does not specify the electromagnetic detector as a required feature for receiving the input data. Hence, the device claim defined by reference to the method claim does not need to include the pulse oximeter or an electromagnetic detector either. Furthermore, the computer program claim can be executed on a general-purpose computer and not on a specific device in contrast to the case in Example 1. As a result, the formulations as in F-IV, 3.9.1 are appropriate for claims 2-4 of Example 2. For such distributed CIIs, the claim set may comprise claims directed to each entity of the distributed system and/or to the overall system and the corresponding methods. Such a claim set may be allowable under Rule 43(2)(a) (F-IV, 3.2). Each independent claim must nevertheless fulfil the requirements for patentability, in particular the requirements of Art. 54, Art. 56 and Art. 84. For example, if the invention lies in the implementation of a computer cloud using virtual machines enabling adaptation to workload changes by allocating resources in an automatic manner, a client device accessing the resources of the cloud may already be known in the art. The claim set must also fulfil the requirements of unity. It may be necessary to refer to the specific features of the different entities and to define how they interact to ensure the presence of all essential features. When referring to the interaction between the different entities, particular care must be taken that the claim is clear. In some situations, it may be necessary to limit the claim to the combination of the entities (see F-IV, 4.14). If the distribution of the steps of a method across the involved entities is essential to the invention, it will be necessary to define which method step is carried out by which entity in order to fulfil the requirements of Art. 84. Otherwise, this may be left undefined in generic CII claims (see F-IV, 3.9.1). Some considerations relating to these requirements are illustrated with the help of the following examples. Other formulations (F-IV, 3.9.1) than the ones given in the examples can also be part of the claim set but have been omitted for reasons of brevity. Example"
        },
        "5. ": {
            "title": "A computer program [product] comprising instructions which, when the program is executed by a second computer, cause the second computer to receive encoded data from a first computer and decode the received data by performing steps C and D.",
            "subsections": {},
            "content": " Remarks: The problem addressed by the invention is the transmission of data over a network. The transmitter device encodes the data using an algorithm comprising steps A and B and the receiver device performs the complementary function of decoding the data using an algorithm comprising steps C and D. The requirements of Rule 43(2) are fulfilled since the devices of claims 1 and 2 are interrelated in that they interact to perform the invention and solve the stated problem. Novelty and inventive step have to be assessed for each independent claim individually. For example, if encoding according to steps A and B enables encoding to a known coding format in a more efficient way, and decoding according to steps C and D is conventional, it may be that only claims 1, 3 and 4 are new and inventive. and T 246/91). Objection may also arise where there is a multiplicity of alternatives within a single claim, if this renders it unduly burdensome to determine the matter for which protection is sought. Where it is found that the claims lack conciseness under Art. 84, this may lead to the issuing of a partial European or partial supplementary European search report under Rule 63 (see B-VIII, 3.1 and 3.2). In such cases, in the absence of appropriate amendment and/or convincing arguments from the applicant as to why the invitation under Rule 63(1) was not justified, an objection under Rule 63(3) will also arise (see H-II, 5)."
        },
        "6. ": {
            "title": "Support in description",
            "subsections": {
                "6.1": {
                    "content": "General remarks The claims must be supported by the description. This means that there must be a basis in the description for the subject-matter of every claim and that the scope of the claims must not be broader than is justified by the extent of the description and drawings and also the contribution to the art (see T 409/91). Regarding the support of dependent claims by the description, see F-IV, 6.6."
                },
                "6.2": {
                    "content": "Extent of generalisation Most claims are generalisations from one or more particular examples. The extent of generalisation permissible is a matter which the division must judge in each particular case in the light of the relevant prior art. Thus an invention which opens up a whole new field is entitled to more generality in the claims than one which is concerned with advances in a known technology. A fair statement of claim is one which is not so broad that it goes beyond the invention nor yet so narrow as to deprive the applicant of a just reward for the disclosure of his invention. The applicants are allowed to cover all obvious modifications of, equivalents to and uses of that which they have described. In particular, if it is reasonable to predict that all the variants covered by the claims have the properties or uses the applicants ascribe to them in the description, they are allowed to draw the claims accordingly. After the date of filing, however, the applicants are allowed to do so only if this does not contravene Art. 123(2)."
                },
                "6.3": {
                    "content": "Objection of lack of support As a general rule, a claim is regarded as supported by the description unless there are well-founded reasons for believing that the skilled person would be unable, on the basis of the information given in the application as filed, to extend the particular teaching of the description to the whole of the field claimed by using routine methods of experimentation or analysis. Support must, however, be of a technical character; vague statements or assertions having no technical content provide no basis. The division raises an objection of lack of support only if it has well-founded reasons. Once the division has set out a reasoned case that, for example, a broad claim is not supported over the whole of its breadth, the onus of demonstrating that the claim is fully supported lies with the applicant (see F-IV, 4). Where an objection is raised, the reasons are, where possible, to be supported specifically by a published document. A claim in generic form, i.e. relating to a whole class, e.g. of materials or machines, may be acceptable even if of broad scope, if there is fair support in the description and there is no reason to suppose that the invention cannot be worked through the whole of the field claimed. Where the information given appears insufficient to enable a person skilled in the art to extend the teaching of the description to parts of the field claimed but not explicitly described by using routine methods of experimentation or analysis, the division raises a reasoned objection, and invites the applicant to establish, by suitable response, that the invention can in fact be readily applied on the basis of the information given over the whole field claimed or, failing this, to restrict the claim accordingly. The question of support is illustrated by the following examples: (i) a claim relates to a process for treating all kinds of \"plant seedlings\" by subjecting them to a controlled cold shock so as to produce specified results, whereas the description discloses the process applied to one kind of plant only. Since it is well-known that plants vary widely in their properties, there are well-founded reasons for believing that the process is not applicable to all plant seedlings. Unless the applicants can provide convincing evidence that the process is nevertheless generally applicable, they must restrict their claim to the particular kind of plant referred to in the description. A mere assertion that the process is applicable to all plant seedlings is not sufficient; (ii) a claim relates to a specified method of treating \"synthetic resin mouldings\" to obtain certain changes in physical characteristics. All the examples described relate to thermoplastic resins and the method is such as to appear inappropriate to thermosetting resins. Unless the applicants can provide evidence that the method is nevertheless applicable to thermosetting resins, they must restrict their claim to thermoplastic resins; (iii) a claim relates to improved fuel oil compositions which have a given desired property. The description provides support for one way of obtaining fuel oils having this property, which is by the presence of defined amounts of a certain additive. No other ways of obtaining fuel oils having the desired property are disclosed. The claim makes no mention of the additive. The claim is not supported over the whole of its breadth and objection arises. Where it is found that the claims lack support in the description under Art. 84, this may lead to the issuing of a partial European or supplementary European search report under Rule 63 (see B-VIII, 3.1 and 3.2). In such cases, in the absence of appropriate amendment and/or convincing arguments provided by the applicant in his response to the invitation under Rule 63(1) (see B-VIII, 3.2) or to the search opinion under Rule 70a (see B-XI, 8), an objection under Rule 63(3) will also arise (see H-II, 5)."
                },
                "6.4": {
                    "content": "Lack of support vs. insufficient disclosure Although an objection of lack of support is an objection under Art. 84, it can often, as in the above examples, also be considered as an objection of insufficient disclosure of the invention under Art. 83 (see F-III, 1 to 3), the objection being that the disclosure is insufficient to enable the skilled person to carry out the \"invention\" over the whole of the broad field claimed (although sufficient in respect of a narrow \"invention\"). Both requirements are designed to reflect the principle that the terms of a claim must be commensurate with, or be justified by, the invention's technical contribution to the art. Therefore, the extent to which an invention is sufficiently disclosed is also highly relevant to the issue of support. The reasons for failure to meet the requirements of Art. 83 may in effect be the same as those that lead to the infringement of Art. 84 as well, namely that the invention, over the whole range claimed, extends to technical subject-matter not made available to the person skilled in the art by the application as filed (see T 409/91, Reasons 2 and 3.3 to 3.5). For example, where a technical feature is described and highlighted in the description as being an essential feature of the invention, to comply with Art. 84 this feature must also be part of the independent claim(s) defining the invention (see F-IV, 4.5.1). By the same token, if the (essential) technical feature in question is absent from the claims, and no information is given on how to perform the claimed invention successfully without the use of said feature, the description does not disclose the invention defined in the claim(s) in the manner prescribed by Art. 83. An objection under both Art. 84 and Art. 83 may also be justified. An example would be a claim relating to a known class of chemical compounds defined by measurable parameters, when the description does not disclose a technical teaching allowing the skilled person to manufacture those compounds complying with the parametric definition, and this is not otherwise feasible by the application of common general knowledge or routine experimentation. Such a claim would be both technically not supported and not sufficiently disclosed, regardless of whether the parametric definition meets the clarity requirement of Art. 84. Whether the objection is raised as lack of support or as insufficiency is not important in examination proceedings; but it is important in opposition proceedings since there only the latter ground is available (see D-III, 5)."
                },
                "6.5": {
                    "content": "Definition in terms of function A claim may broadly define a feature in terms of its function, i.e. as a functional feature, even where only one example of the feature has been given in the description, if the skilled person would appreciate that other means could be used for the same function (see also F-IV, 2.1 and 4.10). For example, \"terminal position detecting means\" in a claim might be supported by a single example comprising a limit switch, it being evident to the skilled person that e.g. a photoelectric cell or a strain gauge could be used instead. In general, however, if the entire contents of the application are such as to convey the impression that a function is to be carried out in a particular way, with no intimation that alternative means are envisaged, and a claim is formulated in such a way as to embrace other means, or all means, of performing the function, then objection arises. Furthermore, it may not be sufficient if the description merely states in vague terms that other means may be adopted, if it is not reasonably clear what they might be or how they might be used."
                },
                "6.6": {
                    "content": "Support for dependent claims Where certain subject-matter is clearly disclosed in a claim of the application as filed, but is not mentioned anywhere in the description, it is permissible to amend the description so that it includes this subject-matter. Where the claim is dependent, it may suffice if it is mentioned in the description that the claim sets out a particular embodiment of the invention (see F-II, 4.5). Annex Examples concerning essential features Example 1 Claim 1 relates to a method for storing gel-coated seeds having a gel coat comprising an aqueous gel having been made water-insoluble by a metal ion. The method is characterised by storing the gel-coated seeds in an aqueous solution containing said metal ion. In the description the object of the invention is defined as providing a method for storing gel-coated seeds easily without causing reduction in yield and handling properties. It was emphasised in the description that it is necessary to confine the metal ion concentration to a specific range in order to achieve the goals of the invention. A metal ion concentration outside the specific range was presented as negatively influencing yield and handling properties. The subject-matter of claim 1 – which does not indicate the specific range - therefore does not solve the problem stated in the description. Example 2 The invention relates to an apparatus for concave shaping of a metal strip. In the closest prior art, the metal strip is passed transversely to its length through a shaping set of rollers at which the concave shape is applied to the strip. According to the description, the problem is that the rollers are unable to subject the lateral ends of the strip to a curve-creating force and so the lateral ends normally end up planar. The distinguishing feature of the independent claim specifies that a flexible belt or web-like member is provided to support the strip in its passage through the shaping set of rollers. This feature is sufficient to solve the problem. Further features, e.g. the details of the mechanism for advancing the strip into the shaping set of rollers or the provision of at least three rollers, are not necessary to solve the problem: such additional features would unduly restrict the claim (see T 1069/01). Example 3 Claim 1 is directed to an apparatus for coding television signals comprising, amongst other features, a parameter generating means which ensures that the error between the pixel data of the predicted and actual current fields is minimised. The description describes only one example for minimising the error, namely a method of least squares. What is important is that the skilled person would be able to realise how the error minimising function can be implemented: it is not relevant in this context whether the method of least squares is the only method applicable. It is therefore not necessary to further restrict the claimed parameter generating means in the sense that it uses a method of least squares (see T 41/91). Example 4 The description states that a compound C is obtained by reacting a mixture of A and B for at least 10 minutes at 100°C. It is emphasised that A and B must be reacted for this minimum amount of time, as otherwise the reaction will be incomplete and C will not be formed. Claim 1 is directed to a process for the production of compound C, characterised by reacting a mixture of A and B for 5 to 15 minutes at 100°C. The claim does not contain all the essential features of the invention, as the description clearly states that for the reaction to be complete, it is necessary to react A and B for at least 10 minutes. Example 5 The description identifies the problem to be solved as providing aerosol compositions wherein the percentage of undesirable volatile organic compounds (VOCs) required as propellant is dramatically decreased, resulting in less VOC release to the atmosphere. Claim 1 specifies the minimum amount of at least 15 weight% of propellant (which is a VOC) in the aerosol, but is completely silent about any maximum amount thereof. The problem underlying the application of releasing less VOCs into the environment is solved only when the propellant does not exceed a particular maximum amount in the aerosol composition: this maximum value is therefore an essential feature of the invention. Claim 1 covers aerosols comprising any amount of propellant greater than or equal to 15 weight%, thereby covering the deficient high percentage of propellant present in conventional aerosols. The percentage of undesirable VOCs in the claimed aerosol compositions is therefore not \"dramatically decreased\", and so the stated aim of the present invention is not achieved (see T 586/97). Example 6 As regards diagnostic methods, in G 1/04 it is indicated that if the deductive medical or veterinary decision phase is unambiguously derivable from the application or patent as a whole, it is to be included as an essential feature in the independent claim. In other words, if the inevitable outcome of the first three phases of such a method (see G-II, 4.2.1.3) is a specific diagnosis for curative purposes allowing the deviation to be attributed to a particular clinical picture, the decision phase must be included in the independent claim in order to fulfil the requirements of Art. 84. However, this may cause a claim to be excluded from patentability under Art. 53(c) (see also G-II, 4.2.1.3). The requirement that the final decision phase be included in the independent claim as an essential feature is to be applied only if it is clear from the application/patent as a whole that the inevitable result of the findings leads unambiguously to a particular diagnosis: this will have to be decided by the division on a case-by-case basis."
                }
            }
        }
    },
    "Chapter V – Unity of invention": {
        "1. ": {
            "title": "Introduction The basic principle behind the requirement of unity is that a patent is granted for each invention separately, i.e. in order to proceed to grant, a European patent application is required to contain claims relating to one invention only (G 2/92, Reasons 2).",
            "subsections": {},
            "content": " This requirement of unity is further justified by the principle of equal treatment of applicants: any applicant is entitled to the same rendered service against the paid fees, i.e. one search/examination against one search/examination fee. Therefore at the search stage, if an application as filed is considered by the search division to relate to more than one invention, a search fee may be paid for each such invention, and the search report will be drawn up only in respect of inventions for which search fees have been paid. At the examination stage the applicant can select only one searched invention in each application to be examined for conformity with the patentability and other requirements of the EPC (see G 2/92, Reasons 2). Art. 82 and Rule 44 govern the application of the requirement of unity to European patent applications. This requirement is not applicable in opposition proceedings (G 1/91). This chapter deals with the substantive aspects of the assessment of unity of invention (F-V, 2 and F-V, 3), as well as some procedural aspects relating to lack of unity during search (F-V, 4) and lack of unity during substantive examination (F-V, 5). Aspects of unity of invention in the case of amended claims and Euro-PCT applications are dealt with in F-V, 6 and F-V, 7 respectively. Further aspects related to the procedural implementation of unity of invention in search and examination are to be found in chapters B-VII and C-III respectively. Given the harmonisation of the definitions concerning unity of invention in Rules 13(1) PCT and Rule 13(2) PCT versus Art. 82 and Rule 44(1) respectively, the criteria for unity in both systems are the same. Hence, unity of invention is examined in search and substantive examination in both European and PCT procedures according to the same principles. This does not apply to the respective procedures themselves, where significant differences exist. Consequently, decisions of the boards of appeal rendered according to the former PCT protest procedures continue to be of interest for the consideration of unity in European applications."
        },
        "2. ": {
            "title": "Requirement of unity of invention A European patent application must relate to one invention only or relate to a group of inventions which must be so linked as to form a single general inventive concept (see also B-VII, 1).",
            "subsections": {
                "2.1": {
                    "content": "Insufficient grounds for lack of unity When determining unity of invention, a finding of lack of clarity of the claims is on its own not sufficient grounds for a finding of lack of unity. Normally, too, the sequence of the claims has no impact on the determination of unity of invention. However, it will have an impact on which invention is to be considered the first invention mentioned in the claims (see F-V, 3.4). Moreover, the fact that the claimed separate inventions belong to different groups of the classification is not in itself a reason for a finding of lack of unity. If an application contains claims of different categories or several independent claims of the same category, this is not in itself a reason for an objection of lack of unity of invention (the relationship between Rule 43(2) and Art. 82 is explained in more detail in F-V, 3.2.1). Lack of unity does not arise because of one claim containing a number of individual features, where these features do not present a technical interrelationship (i.e. a combination), but merely a juxtaposition (see G-VII, 7). By definition, no lack of unity can be present between an independent claim and its dependent claims, even if the features of the dependent claims are juxtaposed with the features of the independent claim (see F-V, 3.2.3)."
                },
                "2.2": {
                    "content": "Division's approach Lack of unity is not a ground of revocation in later proceedings. Therefore, although the objection is certainly made and amendment insisted upon in clear cases, it is neither raised nor insisted upon on the basis of a narrow, literal or academic approach. This is particularly so during search when the possible lack of unity does not necessitate a further search. When a lack of unity is established, the claimed subject-matter is divided into separate inventions and/or inventions grouped together in view of their technical relationships (see F-V, 3.2), i.e. according to any common matter comprising same or corresponding potential special technical features. In this context, an invention must have technical character and be concerned with a technical problem within the meaning of Art. 52(1) (see G-I, 1), but it does not necessarily need to meet other requirements for patentability, such as novelty and inventive step (see G-VI and G-VII). Lack of unity may be evident a priori, i.e. prior to carrying out a prior-art search, or may become apparent a posteriori, i.e. after taking into account the prior art revealed by the search in terms of novelty and inventive step."
                }
            },
            "content": " The requirement of unity of invention needs to be assessed only if a group of inventions is claimed. A group of inventions may be formed, for example, by a plurality of independent claims in the same or in different categories, a plurality of alternative inventions defined within a single independent claim (see also F-IV, 3.7) or a plurality of dependent claims where the independent claim is either not novel or not inventive. If a group of inventions is claimed, the requirement that the inventions in this group are so linked as to form a single general concept (Art. 82) is fulfilled only if there is a technical relationship among the claimed inventions involving one or more of the same or corresponding special technical features. The term \"special\" means that the features in question define the contribution that the invention considered as a whole makes over the \"prior art at hand\" in terms of novelty and inventive step. The \"prior art at hand\", i.e. the prior art relied upon in the non-unity assessment, may vary depending on the stage of proceedings (see F-V, 3). The term \"same\" means that the special technical features are identical or define an identical chemical structure. The term \"corresponding\" means that the special technical features achieve the same technical effect or solve the same technical problem. Correspondence may be found for example in alternative solutions, or interrelated features, e.g. the interaction between a plug and a socket causing a releasable electrical connection, or in a causal relationship such as a step in a manufacturing process that causes a certain structural feature in a product. For example, an application might include two sets of claims, one comprising a metal spring, and another comprising a block of rubber. The metal spring and block of rubber may be considered to be corresponding technical features as they both achieve the same technical effect of resilience. In contrast, features that are not shared, i.e. features that only appear in some but not in other claims, cannot be part of the single general inventive concept."
        },
        "3. ": {
            "title": "Assessment of unity The assessment of unity of invention serves to determine if the subject-matter of the claims have anything in common that represents a single general inventive concept (Art. 82). If any of the claims contain one or more alternatives, each of the alternatives is considered as if it were a separate claim for the purpose of assessing lack of unity.",
            "subsections": {
                "3.1": {
                    "content": "Non-unity and prior art",
                    "subsections": {
                        "3.1.1": {
                            "content": "Non-unity and prior art under Art. 54(3) Documents cited under Art. 54(3) should be disregarded in the evaluation of unity of invention since they cannot anticipate the inventive concept of the application under examination."
                        },
                        "3.1.2": {
                            "content": "Non-unity and prior art under Art. 54(2) Documents cited under Art. 54(2) as accidental anticipation should be disregarded in the evaluation of unity of invention since they cannot anticipate the inventive concept of the application under examination (see H-V, 4.2.1, G 1/03 and G 1/16)."
                        }
                    }
                },
                "3.2": {
                    "content": "Grouping of inventions As a general rule, after the initial identification of subject-matter lacking unity, the claims and alternatives contained in claims are assigned to the identified groups of inventions. This step comprises the assessment of which of the remaining claims or alternatives in claims could potentially relate to the same technical problem. By doing so, groups of inventions are identified wherein each group of inventions relates to unitary subject-matter in view of the prior art at hand. If, in the course of grouping, the same special technical feature, which provides a contribution over the prior art, is identified in two groups of inventions, both groups of inventions need to be combined into one single group. Conversely, if, within one initial single group of inventions, claims or alternatives in claims are identified that are not linked by a potentially special technical feature, which provides a contribution over the prior art at hand, they will normally be separated into different groups of inventions. See also F-V, 3(iii) for analysing features in their context rather than in isolation. The initial grouping of claims and alternatives in claims into different inventions may require re-evaluation during the course of assessment of unity of invention. Typically, different groups of inventions are based on different independent claims of the same category, on alternatives defined in one independent claim (see F-V, 3.2.1) or on dependent claims defining alternative embodiments, provided that the independent claim is either not novel or not inventive. However, different groups of inventions may also be based on independent claims in different categories if lack of unity is present between these claims.",
                    "subsections": {
                        "3.2.1": {
                            "content": "Plurality of independent claims in the same category Rule 43(2) defines in sub-paragraphs (a), (b) and (c) the situations where, without prejudice to the requirements of Art. 82, an application is allowed to comprise a plurality of independent claims in the same category (see F-IV, 3.2 and 3.3). The express reference to Art. 82 in Rule 43(2) makes clear that the requirement for unity of invention must still be met. Where the application both lacks unity of invention and fails to comply with the requirements of Rule 43(2), it is at the discretion of the division to raise an objection under Rule 43(2) or Art. 82, or both. A plurality of inventions in the same category may constitute a group of inventions so linked as to form a single general inventive concept. Examples of inventions in the same category are alternative forms of an invention or interrelated inventions. Alternative forms of an invention may be claimed either in a plurality of independent claims or in a single independent claim (see also F-IV, 3.7). In the latter case, the presence of the two alternatives as independent forms may not be immediately apparent. In either case, the same criteria are applied in deciding whether or not there is unity of invention, and lack of unity of invention may therefore also exist within a single claim. Several independent claims in the same category directed to interrelated subject-matter may meet the requirement of unity even if it appears that the claimed subject-matter is quite different, provided that technical features making a contribution over the prior art at hand are the same or corresponding. Examples of such situations include a transmitter and the corresponding receiver or a plug and the corresponding socket (see also F-IV, 3.2). Thus, special technical features relating to the single general inventive concept must be either implicitly or explicitly present in each of the independent claims."
                        },
                        "3.2.2": {
                            "content": "Plurality of independent claims in different categories A plurality of independent claims in different categories (see F-IV, 3.1) may constitute a group of inventions so linked as to form a single general inventive concept as defined in Rule 44(2). However, it is essential that a single general inventive concept link the claims in the various categories. The presence in each claim of expressions such as \"specially adapted\" or \"specifically designed\" does not necessarily imply that a single general inventive concept is present."
                        },
                        "3.2.3": {
                            "content": "Dependent claims A dependent claim and the higher-ranking claim on which it depends cannot be grouped into two different groups of inventions (see F-V, 2.1). If, however, the higher-ranking claim appears not to be patentable, then the question of whether there is still an inventive link between all the claims dependent on that higher-ranking claim needs to be carefully considered. In this context it is important to verify that a claim that is drafted as a dependent claim is in fact a true dependent claim comprising all the features of the corresponding independent claim, see F-IV 3.7. For a definition of a dependent claim, see F-IV, 3.4 and 3.8."
                        },
                        "3.2.4": {
                            "content": "Common dependent claims While an independent claim is always part of the common matter among its dependent claims, the opposite is not true: a claim dependent on several independent claims is never part of the common matter between these independent claims. Unity is assessed firstly between the independent claims. If a dependent claim comprises technical features common to several inventions, then it is part of all of these inventions at the same time. Example 1 An application contains two independent claims and one dependent claim:"
                        }
                    }
                },
                "3.3": {
                    "content": "Reasoning for a lack of unity objection An objection of lack of unity must consist of logically presented, technical reasoning containing the basic considerations behind the finding of lack of unity. If necessary, it must comprise considerations relating to the number and grouping of the claimed separate inventions.",
                    "subsections": {
                        "3.3.1": {
                            "content": "Minimum requirements for reasoning of lack of unity When raising a non-unity objection, the division must back it up with a minimum reasoning outlining at least the following elements: (i) the common matter, if any, between the groups of inventions. The common matter is based on the same or corresponding technical features. It is not confined to individual features but also includes synergistic effects being the result of a combination of features, see G-VII, 7; (ii) the reasons why this common matter cannot provide a single general inventive concept based on the same or corresponding special technical features. This includes prior art or general knowledge or the teaching of the application itself which anticipates or renders obvious the common matter (and the general problem if applicable). If prior art is relied upon, it must be identified, indicating any relevant passages and the reasons why they are considered relevant; (iii) the reasons why there is no technical relationship between the remaining technical features of the different groups of claims, including: (a) an identification of any remaining technical features of the different groups and the respective claims of each group, with an explicit statement that these technical features are different; (b) for each group, an identification, in the light of the description, of the objective technical problem(s) solved by these remaining technical features; (c) why the problem(s) solved are either known from the prior art or are different so that the different technical features cannot be considered to be \"corresponding special technical features\"; (iv) in all cases, the minimum reasoning comprises a concluding statement that, because neither the same nor corresponding special technical features are present in the claims, there is no single general inventive concept and the requirements for unity of invention are not met; (v) in special cases, point iii, parts (a) to (c), which prove that there is no technical relationship involving the same or corresponding special technical features, will be automatically covered if it is explained: (1) why grouped alternatives of chemical compounds are not of a similar nature; (2) in case of lack of unity between intermediate and final products, why the intermediate and final products do not have the same essential structural elements and are not technically closely interrelated; (3) why a process is not specially adapted to the production of a product; (4) why a product itself does not provide a single general inventive concept linking different uses as defined in the claims; (5) why a use in itself does not provide a single general inventive concept linking the subject-matter of the claims."
                        }
                    }
                },
                "3.4": {
                    "content": "Determination of the invention first mentioned in the claims When lack of unity is established, the sequence of the claimed (groups of) inventions will normally start with the invention first mentioned in the claims (\"first invention\"); see also B-VII, 1.1 and 2.3. In other words, as a general rule the division of subject-matter follows the order of appearance of the different inventions in the claims. The content of the dependent claims will be taken into account when determining the first invention. Trivial claims relating exclusively to features that seem unimportant in the light of the invention or that are generally known in the technical field of the invention are disregarded (see B-III, 3.8 for the search phase). However, if the filed claims do not fulfil the requirements of Rule 43(4), i.e. if the dependency of the claims is not correct, the claims will be re-ordered accordingly before assessing the fulfilment of the requirements of unity."
                }
            },
            "content": " A substantive assessment of unity of invention requires (i) determining, in the light of the application as a whole, the common matter, if any, between the claims of the different claimed inventions that the examiner provisionally identifies (see F-V, 2.2, 3.2 and 3.4); (ii) comparing the common matter with the \"prior art at hand\" to examine whether the common matter makes a contribution over that prior art, namely whether it comprises \"special\" technical features within the meaning of Rule 44(1); (iii) if the common matter does not comprise special technical features, analysing any remaining technical features which are not part of the identified common matter to determine if there is a unifying technical relationship among some of the claims. For example, lack of unity may arise among the dependent claims if the independent claim upon which they depend does not comprise any features making a technical contribution over the prior art at hand. In such a case, the independent claim would not provide a unifying technical relationship among the dependent claims as required by Rule 44(1) as it would not contain any \"special technical features\". (i) Determining the common matter Common matter represents a potential single general inventive concept among the claims. It may be present in features which are the same or corresponding (see F-V, 2), namely in features that are either identical to each other or that provide alone or in combination a common technical effect or a solution to a common technical problem. The technical problem in the non-unity assessment may be different from that in a patentability assessment since the overall object is to find out what the claims have in common. When analysing the technical problem in a non-unity assessment, the starting point is usually what is considered by the applicant in the description as having been achieved. In this regard, the applicant must disclose the invention in such terms that the technical problem and its solution can be understood, and state any advantageous effects of the invention with reference to the background art (Rule 42(1)(c)). This technical problem defines in the first instance the common matter of the claims. However, for the purpose of considering unity of invention, the division is not restricted to the general concept of what the applicant subjectively claims to be his invention (G 1/89 and G 2/89). The technical problem put forward by the applicant in the description may, on closer examination, reveal itself as unsuitable as a means of linking the subject-matter of the claims in such a way that they form a single general inventive concept. This may happen either where, in view of the information contained in the description and the common general knowledge of the skilled person, it is evident that different claims solve different problems (a priori assessment of lack of unity) or where the search reveals prior art which discloses or renders obvious a solution of the unifying technical problem stated by the applicant in the description (a posteriori assessment of lack of unity). In the latter case, the technical problem stated by the applicant may no longer constitute the single general inventive concept required by Art. 82 since it cannot be regarded as inventive. For example, a prior-art document under Art. 54(2) disclosing all the features of an independent claim also discloses, at least implicitly, the technical problem stated by the applicant since by definition this problem must be solved by the features of said independent claim. The division will then proceed to analyse if any other common matter is present among the claims, i.e. identify, in the light of the application as a whole, any technical features of the claims that are the same or corresponding. When determining whether technical features are corresponding, it is important that the technical problems solved, which are associated with the technical effects, are not formulated too narrowly or too generally. If the technical problems are too narrow when they could have been more general, they may have nothing in common leading to the possibly wrong conclusion that technical features are not corresponding. If they are too general when they could have been narrower, the common aspects of the problem may be known, also leading to the possibly wrong conclusion that there is a lack of unity. For example, a membrane and a diaphragm may achieve the technical effect of \"providing resilience\" and hence may be corresponding features. Common matter may not only be found in features of claims in the same category but may also be embodied in features of claims of different categories. For example, in the case of a product, a process specially adapted for the manufacture of said product and the use of said product, the product may represent the common matter which is present in the use and in the process as the effect or result of the process. Common matter may also be embodied in interrelated product features (e.g. a plug and a socket). Although corresponding features in interrelated products may be formulated quite differently, if in their interaction they contribute to the same technical effect or to the solution of the same technical problem, they may be part of the common matter. There may be cases where no common matter at all can be identified. Then the application lacks unity because neither a technical relationship within the meaning of Rule 44(1) is present between the independent claims, nor does the application entail a single general inventive concept within the meaning of Art. 82. (ii) Comparison of the common matter with the prior art at hand If common matter, namely subject-matter involving the same or corresponding technical features, is identified in the claims, it must be compared with the prior art at hand. If the common matter defines a non-obvious contribution over that prior art, it will involve \"special technical features\", and the inventions concerned will be so linked as to form a single general inventive concept. Otherwise, if the common matter is known or obvious from the prior art at hand, then the application lacks unity. This assessment is to be done on the basis of an assessment of novelty and inventive step vis-à-vis the prior art at hand. The obviousness is to be assessed, whenever appropriate, using the problem-solution approach. The common matter may involve features defining technical alternatives. If the common technical effect to be achieved by these technical alternatives is already known, or may be recognised as generally desirable (a mere desideratum), or is obvious, these alternative features cannot be considered as defining a technical relationship within the meaning of Rule 44(1) because there is no inventive merit in formulating the problem. The \"prior art at hand\", i.e. the prior art relied upon in the non-unity assessment, may vary depending on the stage of proceedings. For example, where the assessment is carried out before the search (\"a priori assessment\"), the only \"prior art at hand\" may be the background art provided by the applicant in the description and any common general knowledge. During the search, other prior art may be revealed and may form the basis for the \"a posteriori assessment\". Therefore, the \"prior art at hand\" may change during the course of the proceedings. For this reason the assessment of unity is iterative. (iii) Analysis of the remaining technical features If the comparison of the common matter under (ii) leads to the finding of a lack of unity, as a next step, the groups of different inventions present in the claims need to be confirmed or refined (see F-V, 3.2). In order to determine these groups of inventions, the remaining technical features not forming part of the identified common matter need to be analysed. In most cases, each group will comprise several claims. This grouping is performed on the basis of the technical problems associated with the remaining technical features of each of the claims. Those claims comprising remaining technical features associated with the same technical problem are combined into a single group. However, if the technical problem has been successfully solved in the prior art, claims associated with the same technical problem may be placed into different groups (see F-V, 3.3.1(iii)(c)). The technical problems associated with the claims must be formulated with care. It may not be sufficient to analyse the remaining technical features of each claim in isolation, but rather to analyse their effect when read in the context of the individual claim as a whole and in the light of the description. When formulating the technical problems of the various inventions in a unity assessment, a very narrow approach should be avoided since the aim of the exercise is to see whether any commonality may be established between the inventions. It is therefore often necessary to redefine the very specific problems associated with each of the claims to arrive at a more general problem, while bearing in mind the context in which the relevant features are disclosed. For the grouping, it is irrelevant whether or not the subject-matter of the claims or of the remaining technical features of the claims are novel or inventive over the prior art at hand. However, it is relevant for assessing whether or not the applicant is to be invited to pay an additional search fee for a group (see F-V, 4). If the problem(s) associated with the different groups is (are) either known from the prior art at hand or is (are) different from each other, then the finding of step (ii) that there exists a lack of unity is confirmed. In this example, independent claims 1 and 2 are not linked by a single general inventive concept; features A and B are neither the same nor corresponding special technical features. A lack of unity is present between claims 1 and 2, each of them being directed to a different invention. The content of dependent claim 3 has no bearing on this analysis. If dependent claims comprise features of two or more groups of inventions, then they belong to each of these group of inventions. In example 1, the subject-matter of claim 3 contains features of each of the two inventions (claim 1, claim 2), thus belonging to both inventions at the same time. Therefore, the search for the first invention mentioned in the claims should, in this example, cover the subject-matter of claim 1 and claim 3. The examiner also assesses if a further search fee should be paid for the second invention (see F-V, 2.2, F-V, 3.4, B-VII, B-III, 3.8). Example 2 An application comprises the following claims: Claim 3 is thus directed to the following subject-matter: (a) a device comprising features A and C; or (b) a device comprising features A, B and C. In this example, feature A is not a special technical feature (i.e. the subject- matter of claim 1 is either not new or not inventive). - If both features B and C are special technical features (new and inventive) and they are corresponding (that is, they have a technical relationship with each other), then the claimed devices A+B and A+C are the same invention. Consequently, the device A+B+C is part of the same invention as well. There is unity of invention. - If features B and C are different and are not corresponding (that is, they have no technical relationship with each other), then there is a lack of unity. There are two inventions: the device having the features A+B (claim 1 partially and claim 2 entirely) and the device having the features A+C (claim 1 partially and claim 3(a) entirely). The subject- matter of claim 3(b) has all the features of the first invention (A+B) and all the features of the second invention (A+C). Therefore it belongs entirely to both inventions at the same time. Therefore the search for the first invention mentioned in the claims should, in this example, cover not only claim 2 (A+B), but also the subject-matter of claim 3(b) (A+B+C). The examiner also assesses if a further search fee should be paid for the second invention (see F-V, 2.2, F-V, 3.4, B-VII, B-III, 3.8). Where a single claim defines several (chemical or non-chemical) alternatives, e.g. it contains a so called \"Markush grouping\", the requirement of Rule 44(1) for same or corresponding special technical features is considered met if the alternatives are of a similar nature (see F-IV, 3.7). When the Markush grouping is for alternatives of chemical compounds, they should be regarded as being of a similar nature where: (i) all alternatives have a common property or activity, and (ii) a common structure is present, i.e. a significant structural element is shared by all of the alternatives, or all alternatives belong to a recognised class of chemical compounds in the art to which the invention pertains. Thus, common matter is provided for a Markush grouping by the common property or activity of the alternatives (see (i) above) and the common structure defined by (ii) above. A \"significant structural element is shared by all of the alternatives\" if the compounds share a common chemical structure that occupies a large portion of their structures, or, if the compounds have in common only a small portion of their structures, the commonly shared structure constitutes a structurally distinctive portion and this structure or portion leads to a technical contribution in view of existing prior art at hand. The structural element may be a single component or a combination of individual components linked together. There is no need for a significant structural element to be novel in absolute terms (i.e. novel per se). Rather, the term \"significant\" means that in relation to the common property or activity, there must be a common part of the chemical structure that distinguishes the claimed compounds from any known compounds having the same property or activity. In other words, the significant structural element defines the technical contribution which the claimed invention, considered as a whole, makes over the prior art at hand. The alternatives belong to a \"recognised class of chemical compounds\" if there is an expectation from the knowledge in the art that members of the class will behave in the same way in the context of the claimed invention, i.e. that each member could be substituted one for the other, with the expectation that the same intended result would be achieved. However, if it can be shown that at least one Markush alternative is not novel, unity of invention must be reconsidered. In particular, if the structure of at least one of the compounds covered by a Markush claim is known, together with the property or technical effect under consideration, this is an indication of lack of unity of the remaining compounds (alternatives). This is because the Markush alternatives comprise no same (c.f. common structure) or corresponding (c.f. same property or technical effect) technical features that are \"special\". Claims covering different alternative nucleic acids or proteins defined by different sequences are equally considered to represent a Markush grouping and are also analysed according to the foregoing principles. \"intermediate\" is intended to mean intermediate or starting products. Such products are made available with a view to obtaining end products through a physical or chemical change in which the intermediate product loses its identity. The requirement for the same or corresponding special technical features (Rule 44(1)) is considered to be met in the context of intermediate and final products where: (i) the intermediate and final products have the same essential structural element, i.e. their basic chemical structures are the same or their chemical structures are technically closely interrelated, the intermediate incorporating an essential structural element into the final product, and (ii) the intermediate and final products are technically interrelated, i.e. the final product is manufactured directly from the intermediate or is separated from it by a small number of intermediates all containing the same essential structural element. An essential structural element is a chemical structure that defines the technical contribution that the claimed inventions, considered as a whole, make over the prior art. Typically, the above-mentioned conditions are met in the case of a precursor compound yielding the final product directly upon reaction. Unity of invention may also be present between intermediate and final products of which the structures are not known – for example, as between an intermediate having a known structure and a final product with unknown structure or as between an intermediate of unknown structure and a final product of unknown structure. In such cases, there should be sufficient evidence to lead one to conclude that the intermediate and final products are technically closely interrelated as, for example, when the intermediate contains the same essential element as the final product or incorporates an essential element into the final product. Different intermediate products used in different processes for the preparation of the final product may be claimed provided that they have the same essential structural element. The intermediate and final products should not be separated, in the process leading from one to the other, by an intermediate which is not new. Where different intermediates for different structural parts of the final product are claimed, unity should not be regarded as being present between the intermediates. If the intermediate and final products are families of compounds, each intermediate compound should correspond to a compound claimed in the family of the final products. However, some of the final products may have no corresponding compound in the family of the intermediate products, so the two families need not be absolutely congruent. The mere fact that, besides the ability to be used to produce final products, the intermediates also exhibit other possible effects or activities should not prejudice unity of invention."
        },
        "4. ": {
            "title": "Procedure in the case of lack of unity during search The search division may neither refuse the application for lack of unity nor require limitation of the claims, but must inform the applicant that, if the search report is to be drawn up to cover those inventions present other than the first mentioned, then further search fees must be paid within two months. This applies even if the search reveals prior art that renders the entire subject-matter of the first invention not novel.",
            "subsections": {
                "4.1": {
                    "content": "Provisional opinion accompanying the partial search results As from 1 April 2017, the EPO provides applicants with a provisional opinion on the patentability of the invention (or unitary group of inventions) first mentioned in the claims (see OJ EPO 2017, A20). This provisional opinion is sent together with the invitation to pay further/additional search fees and the partial search results. It also includes the reasons for the non-unity findings. The provisional opinion is sent for information only. A reply addressing the points raised in the provisional opinion is not required and will not be taken into account when the extended European search report (EESR) is issued. Only the EESR requires a response under Rule 70a. The provisional opinion accompanying the partial search results is available to the public via online file inspection."
                },
                "4.2": {
                    "content": "Consequences for the applicant There is no obligation for applicants to pay any additional fee. However, subject-matter that has not been searched will not be examined by the examining division (G 2/92). Hence, it cannot be prosecuted in an independent claim. If the lack of unity persists also in examination after the claims have been amended, the excision of the non-searched subject-matter from the application may be necessary (see C-III, 3.3 and F-IV, 4.3). Non-searched subject-matter can always be prosecuted in a divisional application."
                }
            },
            "content": " When lack of unity is raised a posteriori, the assessment of the search division is provisional (G 2/89) and is based on the prior art at hand when the assessment is done. In view of the fact that such novelty and inventive step considerations are being made without the applicant having had an opportunity to comment, the search division will exercise restraint in this assessment and in borderline cases, will preferably refrain from considering an application as not complying with the requirement of unity of invention. Before issuing an invitation to pay additional fees based on an a posteriori assessment (see B-VII, 1.2), the search division will assess the technical problem underlying a claimed group of inventions in the light of both the disclosure of the application as a whole and the relevant prior art at hand revealed by the search (see W 6/97, W 6/91). The consideration of the requirement of unity of invention is always made with a view to giving the applicant fair treatment and the invitation to pay additional fees is made only in clear cases. The applicant is never invited to pay an additional search fee for claimed inventions that are either not novel or do not possess an inventive step over the prior art at hand. Nevertheless, the search division may still raise an objection of lack of unity for such alleged \"sub-inventions\" in view of potential amendments that could be reasonably expected in the light of the description and any drawings. However, if the inventions concern non-obvious alternatives to the disclosure of the prior art at hand or technical details of different apparatuses/methods/products that require a complete new search for an enabling disclosure, the search division may invite the applicant to pay additional fees for all the inventions. Example: The independent claim is directed to a new method to dope a molecule so as to enhance its ability to bind to a cellular membrane's receptor. A dependent claim claims that the molecule can be doped to bind to several different receptors of the membrane. The search reveals that the method of the independent claim, applied to one receptor listed in the dependent claim, has already been disclosed in the prior art. If the search division is of the opinion that the application of the by now known method to the alternative receptor is an invention in view of the prior art at hand, it invites the applicant to pay additional fees for all the remaining alternatives since a complete search needs to be carried out in order to try to retrieve an enabling disclosure for each of them."
        },
        "5. ": {
            "title": "Procedure in the case of lack of unity during substantive examination",
            "subsections": {
                "5.1": {
                    "content": "General principles The final responsibility for establishing whether the application meets the requirement of unity of invention ultimately rests with the examining division (see T 631/97; see also C-III, 3.2). For Euro-PCT applications which have entered the European phase, see F-V, 7. Whether or not the question of unity of invention has been raised by the search division, it must always be considered by the examining division. The conclusion reached may change, e.g. when further prior art becomes available at a later stage of the proceedings. When lack of unity of invention arises only during substantive examination, the examining division should raise an objection only in clear cases, particularly if substantive examination is at an advanced stage (see also H-II, 6.3). Whenever unity is found to be lacking, the applicants should be required to limit their claims in such a way as to overcome the objection (see C-III, 3.2 and C-III, 3.3), which means restricting them to a single searched invention (see H-II, 6.1). Excision or amendment of parts of the description may also be necessary (see C-III, 3.3). One or more divisional applications, covering matter removed to meet this objection, may be filed (see C-IX, 1), provided that the parent application is pending (A-IV, 1.1.1)."
                },
                "5.2": {
                    "content": "Objections to unsearched inventions See H-II, 6.2 and H-II, 6.3."
                },
                "5.3": {
                    "content": "Review of non-unity findings The reviewing of non-unity findings and the refund of additional search fees are dealt with in C-III, 3.4. In so far as the examining division finds that unity of invention is given, if the applicant has paid the further search fee(s) and requested a full or partial refund thereof, the examining division will order refund of the relevant further search fee(s)."
                }
            }
        },
        "6. ": {
            "title": "Amended claims For the situation where the applicant submits new claims directed to subject-matter which has not been searched e.g. because it was only contained in the description and at the search stage it was not found to be appropriate to extend the search to this subject-matter, see H-IV, 4.1.2 and B-III, 3.5.",
            "subsections": {}
        },
        "7. ": {
            "title": "Euro-PCT applications",
            "subsections": {
                "7.1": {
                    "content": "International applications without supplementary search As indicated in B-II, 4.3.1, for certain international applications entering the European phase with an international search report, no supplementary European search is carried out. The following situations may then be distinguished during substantive examination: (i) If, during the international search, an objection of lack of unity has been raised and the applicant has not taken the opportunity to have the other invention(s) searched by paying additional search fees for them, but has taken the opportunity to amend the claims after receipt of the international search report (see E-IX, 3.3.1) so that they are limited to the invention searched and has indicated that examination is to be carried out on these amended claims, the examining division proceeds on the basis of these claims. (ii) If, during the international search, an objection of lack of unity has been raised and the applicant has neither taken the opportunity to have the other invention(s) searched by paying additional search fees for them, nor amended the claims so that they are limited to the invention searched, and the examining division agrees with the objection of the ISA (taking into account any comments on the issue of unity submitted by the applicant in the response to the WO-ISA or IPER, see E-IX, 3.3.1), the examining division will then proceed to issue an invitation under Rule 164(2) to pay search fees for any claimed invention in the application documents for which no additional search fee has been paid to the EPO, where it has acted as the ISA. (iii) If additional search fees have been paid during the international phase, the applicant may determine that the application is to proceed on the basis of any of the searched inventions, the other(s) being deleted, if the examining division agrees with the objection of the ISA. Where the applicants have not yet taken that decision, the examining division will, at the beginning of substantive examination, invite them to do so. (iv) If the claims to be examined relate to an invention which differs from any of the originally claimed inventions, the examining division will proceed to issue an invitation under Rule 164(2) to pay search fees for any claimed invention in the application documents not covered by the international search report or supplementary international search report, if any (see C-III, 3.1). (v) If the applicant has not paid additional search fees during the international phase and the examining division does not agree with the objection of the ISA (for example, because the applicant has convincingly argued in response to the WO-ISA or IPER, see E-IX, 3.3.1, that the requirement of unity of invention is satisfied), an additional search will be performed (see B-II, 4.2(iii)) and the examination will be carried out on all claims. In cases (i) to (iv), the applicant may file divisional applications for the inventions deleted to meet the objection of non-unity (see C-IX, 1 and A-IV, 1), provided that, when a divisional application is filed, the application being divided is still pending (see A-IV, 1.1.1)."
                },
                "7.2": {
                    "content": "International applications with supplementary search For international applications entering the European phase with an international search report established by an ISA other than the EPO, a supplementary European search is carried out by the search division in the cases listed in B-II, 4.3.2. If the search division, during the supplementary European search, notes a lack of unity, B-VII, 2.3 applies. The procedure before the examining division in such cases is described in E-IX, 4.2. In brief, the examining division will proceed with the examination of that invention (or group of inventions) covered by the supplementary European search report which has been chosen by the applicant in response to the ESOP."
                },
                "7.3": {
                    "content": "International preliminary examination report (IPER) For international applications entering the European phase with an international preliminary examination report, the examining division should carefully take into account the position taken in that IPER before deviating from it. This may be necessary where the claims have been changed, the applicant successfully refutes the objection (either of which may happen in response to the IPER, see E-IX, 3.3.1) or the interpretation of the rules regarding unity of invention was erroneous; see further F-V, 7.1 and F-V, 7.2 above."
                },
                "7.4": {
                    "content": "Restricted IPER If the EPO has established an IPER on the application and the applicant wishes to obtain protection pertaining to claims which were not the subject of this IPER because they were not searched during the international phase in consequence of an objection of lack of unity, the applicant can decide to have such claims searched in response to the invitation to pay additional search fees under Rule 164(2) and choose them for further prosecution. Alternatively, the applicant can decide to file one or more divisional applications for the inventions not searched, provided that, when a divisional application is filed, the application being divided is still pending (see A-IV, 1.1.1)."
                }
            }
        }
    },
    "Chapter VI – Priority": {
        "1. ": {
            "title": "The right to priority In this respect see also A-III, 6.",
            "subsections": {
                "1.1": {
                    "content": "Filing date as effective date According to Art. 80, a European application is accorded as its date of filing the date on which it satisfies the requirements of Rule 40, or, if filed under the PCT, the date on which it satisfies Art. 11 PCT. This date remains unchanged except in the special circumstances of late-filed drawings or parts of the description provided for in Rule 56 EPC and late-filed correct application documents or parts filed under Rule 56a. The date of filing may be the only effective date of the application. It will be of importance for fixing the expiry of certain time limits (e.g. the date by which the designation of the inventor must be filed under Rule 60), for determining the state of the art relevant to the novelty or obviousness of the subject-matter of the application, and for determining, in accordance with Art. 60(2), which of two or more European applications from separate persons for the same invention is to proceed to grant."
                },
                "1.2": {
                    "content": "Priority date as effective date However, in many cases, a European application will claim the right of priority of the date of filing of a previous application. In such cases, it is the priority date (i.e. the date of filing of the previous application) which becomes the effective date for the purposes mentioned in the preceding paragraph."
                },
                "1.3": {
                    "content": "Validly claiming priority For a valid claim to priority, the following conditions must be satisfied: (i) the previous application was filed in or for a state or WTO member recognised as giving rise to a priority right in accordance with the provisions of the EPC (see also A-III, 6.2); (ii) the applicant for the European patent was the applicant, or is the successor in title to the applicant, who made the previous application (see also A-III, 6.1 and, for transfer of partial priority, F-VI, 1.5); (iii) the European application is made during a period of twelve months from the date of filing of the previous application (subject to certain exceptions, see A-III, 6.6); and (iv) the European application is in respect of the same invention as the invention disclosed in the previous application, which must be the \"first application\" (see F-VI, 1.4 and 1.4.1). The words \"in or for\" any member state of the Paris Convention or member of the WTO, referred to in A-III, 6.2, mean that priority may be claimed in respect of a previous national application, a previous European application, a previous application filed under another regional patent treaty or a previous PCT application. If the previous application was filed in or for an EPC contracting state, this state may also be designated in the European application. The previous application may be for a patent or for the registration of a utility model or for a utility certificate. However, a priority right based on the deposit of an industrial design is not recognised (see J 15/80). So long as the contents of the application were sufficient to establish a filing date, it can be used to create a priority date, no matter what the outcome of the application may be; for example, it may subsequently be abandoned or refused (see A-III, 6.2). The expression \"the same invention\" in Art. 87(1) means that the subject-matter of a claim in a European application may enjoy the priority of a previous application only if the skilled person can derive the subject-matter of the claim directly and unambiguously, using common general knowledge, from the previous application as a whole. This means that the specific combination of features present in the claim must at least implicitly be disclosed in the previous application (see F-VI, 2.2 and G 2/98)."
                },
                "1.4": {
                    "content": "First application The filing date of the \"first application\" must be claimed as a priority, i.e. the application disclosing for the first time any or all of the subject-matter of the European application. If it is found that the application to which the priority claim is directed is in fact not the first application in this sense, but some or all of the subject-matter was disclosed in a still earlier application filed by the same applicant or a predecessor in title, the priority claim is invalid in so far as the subject-matter was already disclosed in the still earlier application (see F-VI, 1.4.1). To the extent the priority claim is invalid, the effective date of the European application is the date of its filing. The previously disclosed subject-matter of the European application is not novel if the still earlier application referred to above was published prior to the effective date of the European application (Art. 54(2)) or if the still earlier application is also a European application which was published on or after the effective date of the European application in question (Art. 54(3)).",
                    "subsections": {
                        "1.4.1": {
                            "content": "Subsequent application considered as first application A subsequent application for the same subject-matter and filed in or for the same state or member of the WTO is considered as the \"first application\" for priority purposes if, at the date this subsequent application was filed, the still earlier application had been withdrawn, abandoned or refused, without being open to public inspection and without leaving any rights outstanding, and had not served as a basis for claiming priority. The EPO will not consider this question unless there is evidence of the existence of a still earlier application as, for example, in the case of a United States continuation-in-part application. Where it is clear that a still earlier application for the same subject-matter exists, and where the priority right is important because of intervening prior art (see F-VI, 2.1), the applicant is required to establish by evidence from an appropriate authority (normally a national patent office) that there were no rights outstanding in the still earlier application in respect of the subject-matter of the application being examined. Examples of applications that cannot be recognised as a \"first application\" within the meaning of Art. 87(4) are: (i) US applications which are a \"continuation\" of a previous application (\"con\"); (ii) US applications which are a \"continuation in part\" of a previous application (\"cip\"), in so far as the subject-matter in question was already disclosed in the original US application; (iii) national applications claiming priority from a previous national application or national utility model. In the case of US con or cip applications, the first sentence of the description reads as follows: \"This application is a continuation in part (continuation) of Serial Number .... filed .....\". The following information is found on the title page under the heading \"CONTINUING DATA******\": \"VERIFIED THIS APPLICATION IS A CIP (or CON) OF ........\" A form headed \"Declaration for Patent Application\" must also be attached to the end of the application (in this case the priority document), listing earlier foreign or US applications under the heading \"foreign priority benefits under Title 35, United States Code, 119\" or \"benefit under Title 35, U.S.C., 120 of any United States application(s)\". Applications may be filed by reference to a previously filed application (see A-II, 4.1.3.1). If no priority is claimed from this previously filed application, the filing by reference itself does not generate outstanding rights according to Art. 87(4). For example, in the case of national applications GB1 (filed on 1 February 2002, without claiming priority) and GB2 (filed on 2 January 2008, without claiming priority), pertaining to the same subject-matter, a European application EP1 (filed on 2 January 2009) claims priority of GB2 but refers to GB1 for its content according to Rule 40(1)(c). If GB1 is withdrawn, abandoned or refused, without being open to public inspection and without having served as a basis for claiming a right of priority, the mere reference to it under Rule 40(1)(c) does not amount to an outstanding right within the meaning of Art. 87(4). Consequently, in this case the priority claim to GB2 has to be considered valid for EP1."
                        }
                    }
                },
                "1.5": {
                    "content": "Multiple priorities and partial priorities \"Multiple priorities may be claimed\" – i.e. a European application may claim rights of priority based on more than one previous application (G 2/98). \"Partial priority\" refers to a situation in which only a part of the subject-matter encompassed by a generic \"OR\" claim is entitled to the priority date of a previous application (G 1/15). The previous application may have been filed in or for the same or different states or members of the WTO, but in all cases the earliest application must have been filed not more than 12 months before the date of filing of the European application. Subject-matter of a European application will be accorded the priority date of the earliest priority application which discloses it. If, for instance, the European application describes and claims two embodiments (A and B) of an invention, A being disclosed in a French application and B in a German application, both filed within the preceding 12 months, the priority dates of both the French and German applications may be claimed for the appropriate parts of the European application; embodiment A will have the French priority date and embodiment B the German priority date as effective dates. If embodiments A and B are claimed as alternatives in one claim, these alternatives will likewise have the different priority dates as effective dates. If, on the other hand, a European application is based on one previous application disclosing a feature C and a second previous application disclosing a feature D, neither disclosing the combination of C and D, a claim to that combination will be entitled only to the date of filing of the European application itself. In other words, it is not permitted to \"mosaic\" priority documents. An exception might arise where one priority document contains a reference to the other and explicitly states that features from the two documents can be combined in a particular manner. According to G 1/15, entitlement to partial priority may not be refused for a claim encompassing alternative subject-matter by virtue of one or more generic expressions or otherwise (generic \"OR\" claim) provided that said alternative subject-matter has been disclosed for the first time, directly, or at least implicitly, unambiguously and in an enabling manner in the priority document. No other substantive conditions or limitations apply in this respect. In assessing whether subject-matter within a generic \"OR\" claim may enjoy partial priority, the first step is to determine the subject-matter disclosed in the priority document that is relevant, i.e. relevant in respect of prior art disclosed in the priority interval. This is to be done in accordance with the disclosure test laid down in the conclusion of G 2/98 and on the basis of explanations put forward by the applicant or patent proprietor to support the claim to priority, in order to show what the skilled person would have been able to derive from the priority document. The next step is to examine whether this subject-matter is encompassed by the claim of the application or patent claiming said priority. If the answer is yes, the claim is de facto conceptually divided into two parts, the first corresponding to the invention disclosed directly and unambiguously in the priority document, the second being the remaining part of the subsequent generic \"OR\" claim not enjoying this priority but itself giving rise to a right to priority as laid down in Art. 88(3). For example, if the priority document discloses the use of a specific composition whereas the application claims the use of a composition defined in more generic terms, two alternative groups of subject-matters are identified as being encompassed by the claim, even if the claim does not expressly spell them out: - alternative (a), concerning the use of a specific composition (e.g. calcium salt of the active ingredient and tribasic phosphate salt in which the cation was multivalent) and - alternative (b), concerning the use of a composition defined in more generic terms (e.g. acid form or acceptable salt thereof as the active, inorganic salt in which the cation was multivalent, wherein active ingredient and inorganic salt were other than calcium salt of the acid and tribasic phosphate salt in combination). Alternative (a) is the subject-matter disclosed in the priority document, not defined as such in the claim but encompassed by it. Alternative (b) is the remaining subject-matter of the claim, which was not disclosed in the priority document. In such a situation, the subject-matter of alternative (a) enjoys priority whereas that of alternative (b) does not. The rationale of decision G 1/15 also applies in the context of deciding whether an application from which priority is claimed is the first application within the meaning of Art. 87(1). Just as a priority application and a patent claiming priority from it may partially relate to the same invention, the priority application and an earlier application filed by the same applicant may also partially relate to the same invention. In that case, the priority application would be the first application in respect of only that part of the invention which is not the same as in the earlier application (T 282/12). Partial priority may also be transferable separately (T 969/14). This, however, has consequences for the remaining priority right because the assignor is left with a limited right and may no longer keep claiming that partial priority (an applicant can only claim a right which they own). The transfer agreement of the partial priority gives a respective partial priority right to the assignor and the assignee corresponding to two clearly distinct and precisely defined alternatives."
                }
            }
        },
        "2. ": {
            "title": "Determining priority dates",
            "subsections": {
                "2.1": {
                    "content": "Examining the validity of a right to priority As a general rule, the division does not make any investigation as to the validity of a right to priority. However, the priority right assumes importance if prior art has to be taken into account which has been made available to the public within the meaning of Art. 54(2) on or after the priority date claimed and before the date of filing (e.g. an intermediate document, see G-IV, 3) or if the content of the European patent application is totally or partially identical with the content of another European application within the meaning of Art. 54(3), such other application claiming a priority date within that period. In such cases (i.e. cases where the art in question would be relevant if of earlier date), the division must investigate whether the priority date(s) claimed may be accorded to the appropriate parts of the application it is examining and informs the applicant of the outcome and whether, in consequence, the particular prior art under consideration, e.g. the intermediate document, or the other European application forms part of the state of the art within the meaning of Art. 54. Also, in the case of possible conflict with another European application under Art. 54(3), it may be necessary in addition to allocate effective dates to the appropriate parts of that other application and to communicate this to the applicant analogously (see also G-IV, 3). When the division needs to consider the question of priority date, it has to bear in mind all the matters which are mentioned in F-VI, 1.3 to 1.5 above. If in the case of a Euro-PCT application, where the EPO is acting as a designated or elected Office, the priority document is not on file, substantive examination may nevertheless be started. In such a case, without the priority document being on file, the application may even, where appropriate, be refused because the claimed subject-matter lacks novelty or inventive step, provided that the relevant state of the art is neither an intermediate document nor an Art. 54(3) application. However, no European patent may be granted until such time as the priority document is on file. In such a case, the applicant is informed that the decision to grant will not be taken as long as the priority document is missing. If intermediate documents or Art. 54(3) applications exist and the patentability of the subject-matter claimed depends on the validity of the priority right, substantive examination cannot be finalised as long as the priority document is missing. Where the applicants have complied with Rule 17.1(a), (b) or (b-bis) PCT, they may not be requested to file the priority document. The proceedings have to be stayed and the applicant is informed that, since the patentability of the subject-matter claimed depends on the validity of the priority right, substantive examination cannot be finalised as long as the priority document is not on file."
                },
                "2.2": {
                    "content": "The same invention The basic test to determine whether a claim is entitled to the date of a priority document is, as far as the requirement of \"the same invention\" is concerned (see F-VI, 1.3(iv)), the same as the test for determining whether or not an amendment to an application satisfies the requirement of Art. 123(2) (see H-IV, 2). That is to say, for the priority date to be valid in this respect the subject-matter of the claim must be directly and unambiguously derivable from the disclosure of the invention in the priority document, also taking into account any features implicit to a person skilled in the art in what is expressly mentioned in the document (see G 2/98). As an example of an implicit disclosure, a claim to an apparatus including \"releasable fastening means\" would be entitled to the priority date of a disclosure of that apparatus in which different embodiments of releasable fastening elements such as a nut and bolt, a spring catch and a toggle-operated latch are shown. It is not necessary that the subject-matter for which priority is claimed be found among any claims in the previous application. It is sufficient that the documents of the previous application taken as a whole \"specifically disclose\" such subject-matter. The description and any claims or drawings of the previous application are, therefore, to be considered as a whole in deciding this question, except that account is not taken of subject-matter found solely in that part of the description referring to prior art, or in an explicit disclaimer. The requirement that the disclosure must be specific means that it is not sufficient if the subject-matter in question is merely referred to in broad and general terms. A claim to a detailed embodiment of a certain feature would not be entitled to priority on the basis of a mere general reference to that feature in a priority document. Exact literal correspondence is not required, however. It is enough that, on a reasonable assessment, there is in substance a disclosure of the same subject-matter of the claim. A disclaimer which is allowable under Art. 123(2) (see H-V, 4.2.1 and 4.2.2) does not change the identity of the invention within the meaning of Art. 87(1). Therefore, such a disclaimer could be introduced when drafting and filing a successive European patent application, without affecting the right to priority from the first application not containing the disclaimer (see G 1/03, G 2/03 and G 2/10)."
                },
                "2.3": {
                    "content": "Priority claim not valid If the tests set out in F-VI, 2.2 are not satisfied in relation to a particular previous application, then the effective date of the subject-matter of the claim in question will either be the filing date of the earliest application which does provide the required disclosure and of which the priority is validly claimed (see G 3/93) or, in the absence of such, will be the date of filing of the European application itself (or the new date of filing if the application has been redated under Rule 56 or Rule 56a)."
                },
                "2.4": {
                    "content": "Some examples of determining priority dates Note: the dates used are merely illustrative; they do not take account of the fact that the filing offices of the EPO are closed on weekends and certain public holidays.",
                    "subsections": {
                        "2.4.1": {
                            "content": "Intermediate publication of the contents of the priority application P is the application from which priority is claimed by EP, D is the disclosure of the subject-matter of P. 1.1.90 1.5.90 1.6.90 Filing Publication Filing P D EP D is state of the art under Art. 54(2) if the priority claim of P is not valid."
                        },
                        "2.4.2": {
                            "content": "Intermediate publication of another European application P1 is the application from which priority is claimed by EP1, P2 the one from which EP2 claims priority. EP1 and EP2 are filed by different applicants. 1.2.89 1.1.90 1.2.90 1.8.90 1.1.91 Filing Filing Filing Publication Filing P1 P2 EP1 EP1 EP2 A + B A + B A + B A + B A + B EP1 is state of the art under Art. 54(3) if the respective priority claims of P1 and P2 are valid. This does not change if the publication of EP1 takes place after the filing date of EP2. The publication of EP1 is state of the art under Art. 54(2) if the priority claim of P2 is not valid."
                        },
                        "2.4.3": {
                            "content": "Multiple priorities claimed for different inventions in the application with an intermediate publication of one of the inventions EP claims priority of P1 and P2, D is the disclosure of A+B. 1.1.90 1.2.90 1.3.90 1.6.90 Filing Publication Filing Filing P1 D P2 EP A + B A + B A + B + C claim 1: A + B claim 2: A + B + C Claim 1 has a valid priority of P1 for its subject-matter, thus publication D is not state of the art under Art. 54(2) against this claim. Claim 2 cannot benefit from the priority of P1, as it does not concern the same subject-matter. Thus publication D is state of the art under Art. 54(2) for this claim (see G 3/93). It is immaterial whether claim 2 is in the form of a dependent or an independent claim."
                        },
                        "2.4.4": {
                            "content": "A situation in which it has to be checked whether the application from which priority is actually claimed is the \"first application\" within the meaning of Art. 87(1) P1 is the earliest application of the same applicant containing the invention. EP claims the priority of the later US application P2, which is a \"continuation-in-part\" of P1. D is a public disclosure of A+B. 1.7.89 1.1.90 1.6.90 1.12.90 Filing Filing Publication Filing P1 P2 (cip) D EP A + B A + B A + B claim 1: A + B A + B + C claim 2: A + B + C The priority claim of P2 for claim 1 is not valid as P2 is not the \"first application\" for this subject-matter within the meaning of Art. 87(1), but P1 is, which has \"left rights outstanding\" in that P2 is a \"continuation-in-part\" thereof. Therefore Art. 87(4) does not apply and this is not altered by an abandonment, withdrawal, refusal or non-publication of P1. D is prior art pursuant to Art. 54(2) against claim 1, but not against claim 2, as the latter claim has the earlier priority of P2."
                        }
                    }
                }
            }
        },
        "3. ": {
            "title": "Claiming priority",
            "subsections": {
                "3.1": {
                    "content": "General remarks An applicant who wishes to claim priority must file a declaration of priority giving particulars of the previous filing, as specified in Rule 52(1), together with a certified copy of the previous application and, if necessary for the assessment of patentability, a translation of it into one of the EPO official languages (see A-III, 6.7 and A-III, 6.8)."
                },
                "3.2": {
                    "content": "Declaration of priority A declaration of priority from an earlier filing should preferably be made at the time of filing the European application, although this can be done at any time within 16 months from the earliest priority date claimed (see A-III, 6.5.1). The declaration of priority must indicate the date of the priority application, the relevant state party to the Paris Convention or member of the WTO, and the file number. A declaration of priority may be corrected within 16 months from the earliest priority date. This time limit cannot expire earlier than four months after the filing date (see A-III, 6.5.2)."
                },
                "3.3": {
                    "content": "Certified copy of the previous application (priority document) The certified copy of the previous application, i.e. the priority document, must be filed within 16 months of the priority date (see A-III, 6.7; for Euro-PCT cases see, however, E-IX, 2.3.5), unless such a copy is already on file because it has been supplied in the context of Rule 40(3), see A-II, 4.1.3.1, or of a request pursuant to Rule 56 or Rule 56a, see A-II, 5.4.3 and A-II, 6.4.2. Moreover, in accordance with Rule 53(2) and the decision of the President of the EPO dated 9 August 2012, OJ EPO 2012, 492, the EPO will include a copy of the previous application in the file of the European patent application without charging a fee in the cases indicated in A-III, 6.7."
                },
                "3.4": {
                    "content": "Translation of the previous application A translation of the previous application into one of the official languages of the EPO is required only if it is needed for determining the validity of the priority claim, where this is of relevance to the patentability of the underlying invention. The translation must be filed within the time limit set by the EPO. For more details on the procedure, see A-III, 6.8 and subsections. Alternatively, under Rule 53(3), a declaration that the European patent application is a complete translation of the previous application may be submitted within that same time limit. This declaration must be unambiguous, stating that the translation is \"complete\" or, for example, \"identical\" or \"literal\". Declarations in diluted or modified form (stating, for example, that the translation is \"practically complete\" or that the contents \"are essentially the same\") cannot be accepted. The same applies to cases where the declaration is obviously incorrect (e.g. if several priorities are claimed for a single European application or if the European application contains more or less text than is contained in the previous application as filed). In all these cases a complete translation must be filed. Where the European application contains claims on its date of filing and the priority application did not contain claims on its filing date or contained fewer claims on its filing date than the subsequent European application, the declaration cannot be accepted. A merely different arrangement of the various elements of the application (e.g. presenting the claims before the description, or vice versa) does not affect the validity of such a declaration. See also A-III, 6.8.6. The translation or declaration under Rule 53(3) must also be filed in those cases where the EPO adds a copy of the previous application to the file (see the notice from the EPO, OJ EPO 2002, 192). If the applicant has already provided the EPO with a translation of the priority document as part of a request under Rule 56 (see A-II, 5.4(vi)) to base missing parts of the description or drawings on the priority application itself or under Rule 56a to base correct application documents or parts on it (see A-II, 6.4.3), then there is no need for the applicant to file the translation a second time. The request for translation cannot be made by telephone (regardless of whether this is mentioned in the minutes). Because of the time limit and its possible legal consequences, the request must always be made in writing. In examination proceedings it may be issued alone or may accompany a communication under Art. 94(3). The translation of the priority document may become necessary only at later stages of the examination procedure, when documents are retrieved by carrying out a \"topping-up\" search for conflicting applications under Art. 54(3) (see C-IV, 7.1 and A-III, 6.8.2). This may also happen during opposition proceedings where the applicant was not requested to file the translation before grant and the opponent raises patentability issues which require examination of the validity of the priority. If the required translation or declaration is not filed within the time limit, the right of priority is lost and the applicant or proprietor is informed accordingly (see A-III, 6.11). This has the effect that the intermediate document(s) will become prior art under Art. 54(2) or Art. 54(3), as applicable, and therefore relevant for the assessment of patentability (see A-III, 6.8.3). However, for reasons of legal certainty the right of priority remains effective for determining the state of the art for the purposes of Art. 54(3) (see F-VI, 2.1 and 3.5) in respect of any other European patent application. In that respect it is immaterial whether the translation or declaration has been filed, as changes taking effect after the date of publication do not affect the application of Art. 54(3). If the required translation or declaration is filed within the time limit, ideally with accompanying observations, the extent of the validity of the priority and the co-dependent substantive issues will be examined."
                },
                "3.5": {
                    "content": "Withdrawal of priority claim Applicants may voluntarily withdraw a claimed priority at any time. If they do so before the technical preparations for publication have been completed, then the priority date is not effective and the publication is deferred until 18 months after the filing date. If it is withdrawn after the technical preparations for publication have been completed, then the application is still published 18 months after the priority date originally claimed (see A-VI, 1.1 and G-IV, 5.1.1)."
                },
                "3.6": {
                    "content": "Re-establishment of rights in respect of the priority period Applicants may file a request for re-establishment of rights in respect of the priority period under Art. 122 (see A-III, 6.6). Any request for re-establishment of rights in respect of the period specified in Art. 87(1) must be filed within two months of expiry of that period, according to Rule 136(1), second sentence. Where a request for re-establishment in respect of the priority period has been allowed, the examining division carefully reviews the relevance of prior-art documents cited previously in the search report or communications."
                }
            }
        }
    }
}