{
    "Chapter II – Admissibility of amendments - general rules": {
        "1. ": {
            "title": "Introduction How the admissibility of amendments is assessed will depend on the type of procedure (examination, opposition or limitation) and on the stage of the proceedings, as detailed in the following sections.",
            "subsections": {}
        },
        "2. ": {
            "title": "Admissibility in the examination procedure",
            "subsections": {
                "2.1": {
                    "content": "Before receipt of the search report – Rule 137(1) In the case of a European patent application filed directly at the EPO (not via the PCT), it is not possible for the applicant to amend the application before receiving the European search report (Rule 137(1)). In the case of a Euro-PCT application requiring a supplementary European search according to Art. 153(7), the applicant may amend the originally filed claims, description and/or drawings before the application is subject to the supplementary search either by maintaining amendments filed in the international phase under Art. 19 PCT and/or Art. 34(2)(b) PCT or by filing amendments on and/or after entry into the European phase under Rule 159(1)(b) and/or Rule 161(2) respectively (see also E-IX, 3 and B-III, 3.3.2). For replies to an invitation under Rule 62a or 63, see H-II, 5."
                },
                "2.2": {
                    "content": "After receipt of the search report – Rule 137(2) After receiving the European search report and the search opinion, applicants must respond to the search opinion (see B-XI, 8) and may amend the description, claims and drawings of their own volition, provided that the amendment and their reply are filed within the time limit for responding to the search opinion (see C-II, 1, C-II, 3.1 and C-III, 2.1). Likewise, for applications for which no supplementary European search report is prepared (see B-II, 4.3) when entering the European phase from the PCT, the applicant is required to respond to the WO-ISA, IPER or SISR where the ISA and, if applicable, the IPEA or SISA was the EPO (see E-IX, 3.1 and 3.2). This response to the WO-ISA, IPER or SISR may include amendments made by the applicant of their own volition to the description, claims and drawings. After expiry of the relevant time limit for the reply (or, if the applicant waives the remainder of the reply period, after the reply), the applicant may amend the application only with the consent of the examining division. For applications: (i) for which no search opinion is prepared (see B-XI, 1.1 and B-XI, 7), (ii) for which a search opinion was prepared, but where the search report was drawn up before 1 April 2010 (in which case Rule 70a does not apply and the applicant is not required to respond to the search opinion), or (iii) which enter the European phase from the PCT, where the EPO was the ISA, IPEA or SISA and prepared a written opinion, but for which a communication under Rule 161 was already issued before 1 April 2010, it is after receipt of the first communication from the examining division in examination proceedings that applicants may \"of their own volition, amend once the description, claims and drawings\", provided that the amendment and the reply are filed within the time limit for replying to that communication."
                },
                "2.3": {
                    "content": "After receipt of the first communication – Rule 137(3) Subsequent to the applicable event mentioned in H-II, 2.2, the prosecution of further amendments proposed by the applicant is within the discretion of the examining division. Giving the examining division this discretion is intended to ensure that the examination procedure is brought to a conclusion in as few actions as possible (see C-IV, 3). In exercising its discretion the examining division must consider all relevant factors; in particular, it must balance the applicant's interest in obtaining a patent which is legally valid and the EPO's interest in bringing the examination procedure to a close in an effective way (in accordance with the principles set out in G 7/93). Furthermore, the exercise of discretion to refuse amendments under Rule 137(3) must be reasoned (see T 755/96). The examining division also cannot refuse to admit amendments in advance (T 1105/96; T 246/08). As an exception to Rule 137(3), paragraph (b) of Rule 164(2) provides for a right to amend the application in response to the results of any search under Rule 164(2). This means that applicants may make amendments of their own volition once in response to the communication under Art. 94(3) to which the search results under Rule 164(2) are annexed (see also H-II, 6.4.1). If an amendment is admitted, subsequent proceedings are based on the description, claims and drawings as amended. Admitting an amendment does not necessarily imply that the application as amended is allowable, i.e. free from any objection under the EPC. In exercising its discretion under Rule 137(3), the examining division will take into account the circumstances of each individual case and the stage of the proceedings which the application has reached to date. A further important element is whether the applicant has already had sufficient opportunity to make amendments. In particular, amendments reintroducing deficiencies previously pointed out by the examining division and removed by the applicant are not admitted (see T 1326/11 and T 1064/04). The applicant has to bear in mind that it is easier to secure an amendment at an earlier rather than at a later stage: the later amendments are filed, the more important the aspect of procedural economy becomes in balancing the interest of the applicant in obtaining a patent and the EPO's interest in bringing the examination procedure to a close (see T 951/97 and G 7/93). On the other hand, amendments limiting a claim which is already considered allowable are normally admitted. The same applies to amendments improving the clarity of the description or claims in a clearly desirable manner (see T 1929/13). If amendments clearly remedy a deficiency in response to the preceding communication, they are always admitted, provided they do not give rise to some new deficiency. A further factor is the amount of alteration to the application documents involved. Extensive reworking of the description or claims may be a proper response to highly relevant further prior art of which the applicant has only just become aware (e.g. either through further citation by the examining division or through knowledge obtained from another source). Regarding less extensive amendments, the examining division will adopt a reasonable approach, trying to balance fairness to the applicant against the need to avoid unnecessary delay and excessive and unjustified additional work for the EPO. Additional reasons for not admitting amendments according to Rule 137(3) include the non-admittance of: - auxiliary requests in certain circumstances (see H-III, 3.3.2.1), and - a request filed in, or in preparation for, oral proceedings, where Rule 137(4) is not complied with in respect of the request in question (see H-III, 2.1.3), for reasons of procedural economy (taking into account the applicant's right to comment according to Art. 113(1)). Further limitations may apply after a remittal by a board of appeal under Art. 111(2).",
                    "subsections": {
                        "2.3.1": {
                            "content": "Examples of the exercise of discretion under Rule 137(3) 2.3.1.1 Rule 137(3) in conjunction with Art. 83 The examining division has raised an objection under Art. 83 that the entire application, i.e. claims, description and drawings, does not disclose to a person skilled in the art how to carry out the invention without using inventive skill. The examining division will not admit any (further) amendment under Rule 137(3) unless the applicant is able to demonstrate to the satisfaction of the examining division that the application contains enough information to enable the person skilled in the art to carry out the invention; for example the applicant could demonstrate that an embodiment in the description is sufficiently disclosed for the person skilled in the art to put it into practice. If the applicant cannot demonstrate the above, then the objection under Art. 83 EPC can only be overcome by adding information to the application as filed, which usually infringes Art. 123(2) EPC. 2.3.1.2 Rule 137(3) in conjunction with Art. 123(2) The examining division has raised an objection under Art. 123(2) indicating that a certain feature introduced into the claims extends the subject-matter of the application as filed. Unless the applicant is able to demonstrate to the satisfaction of the examining division that the application as filed disclosed this feature directly and unambiguously, the examining division will normally not admit under Rule 137(3) any further set of claims containing the feature in question. 2.3.1.3 Rule 137(3) in conjunction with Art. 84 – missing essential feature The examining division has raised an objection under Art. 84 that the claims are missing an essential feature (see F-IV, 4.5). Unless the applicant is able to demonstrate to the satisfaction of the examining division that the indicated feature is not essential for carrying out the invention, the examining division will normally not admit under Rule 137(3) any further set of claims not containing the feature in question. 2.3.1.4 Rule 137(3) in conjunction with auxiliary requests See H-III, 3.3.2.1."
                        }
                    }
                },
                "2.4": {
                    "content": "At an advanced stage of the proceedings When the applicant files an extensively revised request to replace the text of the application on the basis of which a patent could be granted, they must provide good reasons for proposing the changes only at this stage in the proceedings. This applies particularly in cases where the examining division has indicated that a version of the claims proposed by the applicant is grantable and that the applicant has only to bring the description into line with that version. Normally only those amendments which do not appreciably delay the preparations for grant of the patent will be admitted under Rule 137(3). To this end, the examining division carries out a prima facie analysis of the amendments to determine the amount of time their examination might require. It is this amount of time that determines whether the amendments are extensive. If the examining division comes to the conclusion that a request is prima facie not allowable, for example, because it introduces new deficiencies, they refuse the request under Rule 137(3)."
                },
                "2.5": {
                    "content": "Amendments filed in reply to a Rule 71(3) communication If, in reply to the communication under Rule 71(3) and within the period specified in Rule 71(6), the applicant files a request for amendments and/or a correction of errors, the procedure is as defined in C-V, 4. This applies regardless of whether the request is an explicit request for amendment or is drafted as an approval which is conditional on the filed amendments and/or corrections.",
                    "subsections": {
                        "2.5.1": {
                            "content": "Criteria for admitting such amendments Decision G 7/93 dealt with the criteria to be applied when examining the admissibility of late-filed amendments in examination. The particular case to which that decision relates arose when the rules were differently formulated, and in a situation where the applicant had already consented to the version proposed by the examining division. However, what was said by the Enlarged Board in that case can be considered generally applicable to new requests put forward at a late stage of the proceedings, i.e. when the applicant has already had at least one opportunity to amend the application and the examining division has already completed substantive examination of the application (see T 1064/04). In particular, applying the principles of G 7/93 to amendments filed in response to the communication under Rule 71(3) (see C-V, 1 to C-V, 3) means that this communication does not constitute an opportunity for the applicant to call into question the outcome of the earlier procedure. In deciding whether to admit such amendments, a balance must be struck between the applicant's interest in obtaining a patent which is valid in all of the designated states and the EPO's interest in bringing the examination procedure to a close by the issue of a decision to grant the patent. At this stage of the proceedings, the substantive examination has already been completed and the applicant has had the opportunity to amend the application. Therefore normally only those amendments which do not appreciably delay the preparations for grant of the patent will be admitted under Rule 137(3). It is, however, appropriate to admit separate sets of claims for one or more designated states for which prior national rights exist (see H-III, 4.4). The rejection of amendments proposed by the examining division in a Rule 71(3) communication which have been introduced without prior consultation and agreement of the applicant (C-V, 1.1) does not amount to a request for amendment to which discretion under Rule 137(3) applies."
                        },
                        "2.5.2": {
                            "content": "Further course of proceedings If the examining division gives its consent under Rule 137(3) to these amendments and/or the correction and considers them allowable without issuing a further communication under Art. 94(3), it issues a second communication under Rule 71(3) based on the amended/corrected text (see C-V, 4.6), after which it then proceeds to the grant of the patent pursuant to Art. 97(1). Where amendments or corrections are not admitted, or where they are admitted but not considered allowable, examination will be resumed (see C-V, 4.7)."
                        },
                        "2.5.3": {
                            "content": "Exceptional case where amendments must be admitted If the application was one of the exceptional cases (i), (ii) or (iii) mentioned in H-II, 2.2 and no communication under Art. 94(3) has preceded the communication under Rule 71(3), the applicant may amend the description, claims and drawings of their own volition (see C-III, 2; see also C-II, 3.1) within the time limit for replying to the communication under Rule 71(3). If the examining division finds that these amendments are allowable, a second communication according to Rule 71(3) is issued based on the text as amended (see C-V, 4.6). However, if the examining division is of the opinion that the amendments are not allowable (a finding of inadmissibility with regard to these amendments not being possible), the examination procedure is normally resumed in accordance with C-V, 4.7."
                        },
                        "2.5.4": {
                            "content": "Rule 137(4) applies to amendments filed at this stage Amendments filed in reply to the communication under Rule 71(3) must satisfy the requirements of Rule 137(4) by identifying the amendments and indicating the basis for them in the application as filed (see H-III, 2.1 and in particular the transitional provisions in H-III, 2.1.4). If these requirements are not met: (i) if the application is of one of the types mentioned in H-III, 2.1.4, the examining division may send a Rule 137(4) communication before proceeding further, as provided for in H-III, 2.1.1; (ii) otherwise, if the basis for any amendments is not apparent, the examining division objects to these amendments under Art. 123(2). In case (i), if the applicant replies to the communication under Rule 137(4) in time, the examining division will then decide if it consents to the amendments and will proceed accordingly as indicated in C-V, 4."
                        }
                    }
                },
                "2.6": {
                    "content": "Further requests for amendment after approval Once the applicant has approved the text communicated to him pursuant to Rule 71(3), by paying the fees and filing the translation of the claims, further requests for amendment will only exceptionally be admitted under the discretionary power of the examining division given by Rule 137(3). A clear example of an admissible request is where the applicant files separate sets of claims for designated states for which prior national rights exist (see H-III, 4.4). Similarly, it is appropriate to admit minor amendments which do not require re-opening of the substantive examination and which do not appreciably delay the issue of the decision to grant (see G 7/93). If amendments are filed and do not comply with the requirements of Rule 137(4), the examining division may send a communication under Rule 137(4) (see H-III, 2.1.1). When exercising its discretion under Rule 137(3) an examining division must consider and balance the applicant's interest in obtaining a patent which is legally valid in all of the designated states and the EPO's interest in bringing the examination procedure to a close by the issue of a decision to grant the patent. The criteria for exercising its discretion under Rule 137(3) at this late stage are whether the request can be decided on in a reasonable period of time, and whether the amendments are allowable. If either of these criteria is not satisfied, the request for amendments is refused by the division in the exercise of its discretion according to Rule 137(3). Refusal of amendments must be reasoned, and both Art. 113(1) and Art. 116(1) must be observed (see C-V, 4.7.1). It must be shown that the conditions defined in G 7/93 are not met. This means that arguments must be given as to why the amendments are not minor in nature but in fact necessitate resuming substantive examination while considerably delaying the issue of a decision to grant the patent. However, once the decision to grant is handed over to the EPO's internal postal service for transmittal to the applicant, the examining division is bound by it (see G 12/91) and can only amend it to the limited extent provided for in Rule 140 (see H-VI, 3.1). In examination procedure, this corresponds to the date on which the centrally generated Form 2006, \"Decision to grant a European patent pursuant to Art. 97(1) EPC\", is forwarded to the postal service. This date is shown at the bottom right-hand corner of Form 2006. The examining division is no longer competent to decide on a request for amendments or corrections under Rule 139 if the filing of the request and the completion of the proceedings occur on the same date (T 798/95)."
                },
                "2.7": {
                    "content": "Late-filed requests after summons to oral proceedings in examination If requests are filed after the final date set in accordance with Rule 116(1), they are usually treated as late-filed unless a summons to oral proceedings was issued as the first action of the examining division. Another exception is a request filed in response to a change of the subject of the proceedings, e.g. when a further relevant document is cited for the first time during the oral proceedings. In such a case, the request has to be admitted under Rule 116(2) (T 951/97). The examining division will first consider the requests before deciding on their admissibility. The mere fact that they are filed late is not per se a reason for not admitting them. This issue will normally be dealt with during oral proceedings. In exercising its discretion under Rule 137(3) (see G 7/93), the examining division needs to take into account whether the applicant has good reasons for filing the request late. In the absence of such reasons, and if the applicant has already had sufficient opportunity to address the reasoned objections, when balancing the relevant interests the examining division may give more weight to bringing the examination procedure to a close. In such cases, late-filed requests will be subject to the \"clear allowability\" criterion (see H-II, 2.7.1) in addition to the criteria indicated in H-II, 2.3.",
                    "subsections": {
                        "2.7.1": {
                            "content": "Concept of \"clear allowability\" The examining division will apply the criterion of \"clear allowability\" in exercising its discretion under Rule 137(3) for treating requests filed after the final date set in accordance with Rule 116(1) without proper justification (T 153/85). These late-filed claims will only be admitted into the proceedings if they are clearly allowable. This means that it must be immediately apparent to the examining division that the amendments successfully overcome the objections without giving rise to new ones (prima facie assessment). For example, late-filed requests will not be admitted if they do not clearly meet the requirements under Art. 123(2) or Art. 84. Likewise, late-filed requests may be rejected if the newly defined subject-matter does not constitute a convergent development of the subject-matter which has been the subject of examination (for a definition of convergence, see H-III, 3.3.2.2). For ascertaining whether or not the claims are clearly allowable, the examining division must take into account the reasons given by the applicant which explain why the amendments have been made and how they are intended to overcome the objections raised. If, after discussions, the examining division comes to the conclusion that the late-filed requests are not clearly allowable, it rejects them under Rule 116(2) and Rule 137(3) on the grounds that they do not contain subject-matter which is clearly allowable, i.e. because the subject-matter does not clearly meet the requirements of the EPC (for cases where the applicant does not attend the oral proceedings, see H-III, 3.3.3 and E-III, 8.3.3). In the decision, reasoning is also to be given as to why the specific requirement(s) for allowability is (are) not met. The \"clear allowability\" criterion is generally also applied to patent proprietors' late-filed requests in opposition proceedings (see E-VI, 2.1, and E-VI, 2.2; see also T 98/96 with regard to opposition appeal proceedings)."
                        }
                    }
                }
            }
        },
        "3. ": {
            "title": "Admissibility in opposition procedure",
            "subsections": {
                "3.1": {
                    "content": "Amendments in reply to the notice of opposition Any amendments made in opposition proceedings must be occasioned by the grounds for opposition specified in Art. 100. That is to say, amendments are admissible only if they represent a genuine attempt to overcome a ground for opposition. However, the ground for opposition does not actually have to have been invoked by the opponent. For example, in opposition proceedings admissibly opened on grounds of non-patentability, the patent proprietor can also submit amendments to remove added subject-matter. Opposition proceedings cannot be used merely to tidy up and improve the disclosure in the patent specification (see T 127/85). The mere addition of new claims to the claims as granted is inadmissible because such amendments cannot be said to meet a ground for opposition. However, the replacement of one independent claim as granted by multiple, e.g. two, independent claims each directed to a respective specific embodiment covered by the independent claim as granted is admissible if such a replacement is occasioned by a ground for opposition specified in Art. 100 (see T 223/97)."
                },
                "3.2": {
                    "content": "Amendments not related to the grounds for opposition If the proprietor proposes amendments to the patent in reply to the grounds for opposition and the opposition division intends to maintain the patent in amended form pursuant to those grounds, other amendments not related to the grounds for opposition (e.g. clarifications), or corrections (H-VI, 3.1), may be allowed provided that the patent thus amended still fulfils the requirements of the EPC and that the amendments are considered necessary and appropriate. In particular, if one part of a claim has been amended, it may be necessary or appropriate to amend other parts of the claim as well. Moreover, where a \"clarification\" can be considered as a limitation of the claim, it would be admissible under Rule 80 and could form the basis for maintaining the patent in amended form, provided the other requirements of the EPC are also met by the amended text (with the exception of unity of invention – G 1/91). If the division is of the opinion that such a limiting clarification is not necessary, it needs to consider that the practice of interpreting a claim in a contracting state may be quite different from that of the EPO, and hence the patentee may see a need for such a limiting clarification. Such amendments, however, are not proposed by the opposition division and they can only be taken into consideration up to the pronouncement of the decision (in oral proceedings) or until the date the decision is handed over to the EPO's internal postal service for transmittal to the parties (in written proceedings) (see G 12/91). If an otherwise allowable request for maintenance of the opposed patent either as granted or in amended form has been submitted, the following amendments are not allowed: (a) filing of further claims (see T 829/93); (b) comprehensive redrafting of the dependent claims; (c) comprehensive redrafting of the description (see D-V, 5). In the absence of any amendments submitted by the patent proprietor with a view to meeting the grounds for opposition, there is no possibility to make any other amendments (see for example T 223/97). Publication errors and exceptionally formatting/editing errors may however be corrected (see H-VI, 4)."
                },
                "3.3": {
                    "content": "Amendments occasioned by national rights Apart from the above (H-II, 3.1 and H-II, 3.2), amendments occasioned by national rights of earlier date are admissible pursuant to Rule 138 (see also G-IV, 6, H-III, 4.4 and H-III, 4.5)."
                },
                "3.4": {
                    "content": "Insistence on inadmissible amendments If the patent proprietors request amendments going beyond those permissible under Rule 80 (see H-II, 3.1 and H-II, 3.2), they are invited to withdraw them. If they then maintain their request, it is not admitted (for the reasoning see for example T 127/85, Headnote, and T 406/86, Headnote 1). If, in addition to requests containing unnecessary amendments, there is an auxiliary request which meets the requirements of the Convention and in particular does not comprise amendments not complying with Rule 80, the decision must include the grounds for not admitting the higher-ranking requests. It may occur that there is only one request which would be allowable, but for amendments which clearly do not comply with Rule 80. If the amendments cannot be admitted, the opposition division explains to the patentee that revocation of the patent is to be expected solely for reasons of the request's non-compliance with Rule 80."
                },
                "3.5": {
                    "content": "Late-filed requests in opposition proceedings With respect to how late-filed requests are dealt with in opposition proceedings, reference is made to E-VI, 2.1 (general examples) and E-VI, 2.2 (examples concerning oral proceedings)."
                }
            }
        },
        "4. ": {
            "title": "Amendments in limitation procedure For admissibility of amendments in the limitation procedure, reference is made to D-X, 4 and D-X, 10.",
            "subsections": {}
        },
        "5. ": {
            "title": "Amendments required by a limitation of the search under Rule 62a and/or Rule 63",
            "subsections": {},
            "content": " Where the search was limited to certain subject-matter by application of Rule 63 (see B-VIII, 3.1 and 3.2), the claims must be amended in such a way as to remove the unsearched subject-matter and the description adapted accordingly. Where the search was limited to certain claims by application of Rule 62a (see B-VIII, 4.1 and 4.2), the claims must be amended in such a way as to remove the unsearched independent claims and the description adapted accordingly. To this end, the claims may be amended, for example, by deleting an unsearched independent claim or, where this complies with Art. 123(2) and Art. 84, by making an unsearched independent claim dependent on another independent claim of the same category which has been searched. In both of these cases, a specific amendment is necessary unless the examining division finds that the limitation of the search under Rule 62a and/or Rule 63 or the declaration of no search under Rule 63 was not justified, e.g. in view of arguments provided by the applicant. Such amendments may, however, be made only in examination proceedings or, preferably, in reply to the search opinion (see F-IV, 3.3). Since the applicant may not amend the claims before receipt of the search report (Rule 137(1)), any claims filed in reply to an invitation under Rule 62a or Rule 63 will be taken only as an indication of what the applicant wants the EPO to search and dealt with accordingly (see B-VIII, 3.2 and B-VIII, 4.2). The applicant will then have to confirm maintenance of these amendments formally on entry into the examination phase (see A-V, 2.2)."
        },
        "6. ": {
            "title": "Amendments in the case of non-unity",
            "subsections": {
                "6.1": {
                    "content": "Restriction to a single, searched invention In reply to an objection of lack of unity, the applicant must restrict the claims to a single invention which has been searched unless the applicant can convince the examining division that the objection was not justified. If the claims have been restricted to a single searched invention, the examination can be continued as for a unitary application but limited to that invention (see C-III, 3). If the objection is withdrawn in view of the arguments put forward by the applicant, an additional search may be necessary (see C-IV, 7.3) in order for the examination of the claimed invention to be continued. However, if in response to a negative opinion concerning that invention the applicant later amends the claims to switch to a different searched invention, the division will exercise its discretion under Rule 137(3) and refuse to admit the amendments since only one invention in each application can be examined for conformity with the requirements of the EPC (see G 2/92 and T 158/12)."
                },
                "6.2": {
                    "content": "Restriction to an unsearched invention If not all of the claimed inventions have been searched, in accordance with G 2/92 the applicant must restrict the claims to one of the searched inventions. Thus, if in reply to the search opinion the applicant then restricts the claims to one of the originally claimed inventions which has not been searched, the examining division will write a first communication repeating the lack-of-unity objection raised in the search opinion. Any arguments of the applicant must be duly considered and dealt with in the communication. If the application is restricted to an unsearched but originally claimed invention, it can be refused under Rule 64 in line with G 2/92 (subject to the applicant's rights under Art. 113(1) and Art. 116(1)). Rule 137(5) cannot be invoked. It does not apply when the applicant has not paid the search fee in respect of a non-unitary invention relating to the originally filed claims. If the application is a Euro-PCT application (see also H-II, 6.4) the examining division, depending on the case: - either objects under Rule 164(2)(c) to the restriction of the claims to an invention searched neither (on grounds of lack of unity) by the EPO as (Supplementary) International Searching Authority nor as part of a search under Rule 164(2)(a), - or objects under Rule 164(1) in line with G 2/92 in the context of a supplementary search in the European phase (see B-II, 4.3.2, B-VII, 2.3 and E-IX, 4.2). In both cases, if the applicant declines to limit the claims to a searched invention, the application is refused under Rule 164 in accordance with G 2/92 (subject to the applicant's rights under Art. 113(1) and Art. 116(1)). The objection under Rule 164(2)(c) mentioned above is drafted in the communication sent under Rule 164(2)(b) issuing the results of any additional search. If the applicant does not reply to the invitation to pay additional search fees under Rule 164(2)(a), they do not receive a communication under Rule 164(2)(b). In this case, the examining division issues a communication under Art. 94(3) and Rule 71(1) and (2) inviting the applicant to limit the application under Rule 164(2)(c) before the application can be refused. Concerning the application of G 2/92, it is to be kept in mind that the prohibition on pursuing an application for subject-matter for which no search fees have been paid applies to inventions; it does not apply to features which were originally claimed with a different invention and had not been searched, but which were originally disclosed in combination with the searched invention or group of inventions (see T 998/14)."
                },
                "6.3": {
                    "content": "No restriction to a single invention searched If in response to the search opinion the applicant does not restrict the application to a single invention searched, the objection of lack of unity raised at the search stage will be reviewed and if the examining division considers that it remains valid, a first communication repeating the lack-of-unity objection raised in the search opinion will be issued. In Rule 164(2) cases, a lack of unity objection is addressed in the communication under Rule 164(2)(b) (see also H-II, 6.4.1). If the applicant does not restrict the application at all, or does restrict it, but still maintains two or more inventions, the application can be refused under Art. 82 (subject to the applicant's rights under Art. 113(1) and 116(1)). If the claims still cover an unsearched invention, an objection under Rule 64 would also apply, in line with decision G 2/92 as discussed in H-II, 6.2. If the claims have not been simply restricted, but have instead, or additionally, been amended, such amendments can often result in the previously raised lack-of-unity objection no longer being valid, or in the arguments on which the objection was based no longer being complete. Such amendments would thus result in the objection having to be either withdrawn or at least newly argued. Sometimes lack of unity of invention arises only during substantive examination, for example following an amendment of one or more claims so as to overcome an objection of lack of inventive step. In such situations the examining division may raise an objection, but only in very clear cases."
                },
                "6.4": {
                    "content": "Further procedural aspects concerning Euro-PCT applications",
                    "subsections": {
                        "6.4.1": {
                            "content": "Where the EPO does not perform a supplementary search Where the EPO does not perform a supplementary search, the application must be limited to an invention searched either in the international phase by the EPO or in the European phase in a search under Rule 164(2)(a). The above principles (H-II, 6.1 to H-II, 6.3) then apply mutatis mutandis (see also E-IX, 4.2). In Rule 164(2) cases, a further communication according to Art. 94(3) and Rules 71(1) and (2) repeating a lack of unity objection is not necessary, as a communication according to Art. 94(3) and Rule 71(1) and Rule 71(2) addressing (also) unity of invention has already been issued under Rule 164(2)(b) (see also H-II, 2.3 and 6.2)."
                        },
                        "6.4.2": {
                            "content": "Where the EPO performs a supplementary search Where the EPO performs a supplementary search on an application which is considered to lack unity, the applicant will be invited to pay additional fees, and the supplementary search report will be established for those inventions for which a search fee has been paid. The application must then be limited to one of the inventions searched in the supplementary search. The above principles (H-II, 6.1 to 6.3) then apply mutatis mutandis (see also E-IX, 4.2)."
                        }
                    }
                }
            }
        }
    },
    "Chapter III – Admissibility of amendments - other procedural matters": {
        "1. ": {
            "title": "Introduction This chapter deals with procedural matters and formal requirements relating to the admissibility of amendments. An important requirement dealt with is the applicant's obligation to identify amendments and indicate the basis for them in the application as filed (Rule 137(4); for transitional provisions, see H-III, 2.1.4). The chapter also deals with the format of and procedure for making amendments, as well as issues relating to auxiliary requests and how to deal with different texts for different contracting states.",
            "subsections": {}
        },
        "2. ": {
            "title": "Procedure for amendments to documents",
            "subsections": {
                "2.1": {
                    "content": "Indication of amendments and their basis under Rule 137(4) When filing amendments, the applicant must identify them and indicate the basis for them in order to enable the division to assess compliance of the amendments with the provisions of Art. 123(2). To this end, the division may request that amendments have to be indicated either with respect to the immediate previous amendments in the sequence or with respect to the application as filed. The requirement to indicate amendments is to be understood as an opportunity for the applicant to provide convincing arguments to the division as to why the amendment(s) is/are directly and unambiguously derivable from the application as filed. These arguments are particularly important for the outcome of the division's assessment of Art. 123(2) where literal support for the amendment(s) is not present in the application as filed. The requirement that the basis for amendments be indicated is met if, on consulting those parts of the application indicated, it is not necessary to look further in order to assess the amendment's compliance with Art. 123(2). Non-specific indications such as \"see the description as filed\" or \"see the claims as filed\" or \"see the examples as filed\" are generally not considered sufficient. This requirement also applies in cases where the applicant requests the examining division to amend the application (see H-III, 2.4). Whether the requirements of Rule 137(4) are met is assessed independently of whether the amendments in question comply with Art. 123(2). For example, the applicant may indicate that a particular amendment is based on a technical feature disclosed only in a schematic drawing. If the feature supposedly forming the basis for the amendment is indeed disclosed in the drawing indicated by the applicant, the requirements of Rule 137(4) are met, irrespective of whether the amendment based on that technical feature is allowable according to Art. 123(2). Where the application was not filed in an official language of the EPO, in the absence of evidence to the contrary, for the purpose of assessing compliance with Art. 123(2) the EPO assumes that any translation of the application as filed is accurate. Consequently, in order to comply with Rule 137(4) it is sufficient to indicate the basis of an amendment in the translation of the application as filed.",
                    "subsections": {
                        "2.1.1": {
                            "content": "Rule 137(4) communication and response thereto If the amendments and/or their basis cannot be properly identified such that compliance with Art. 123(2) cannot be assessed, the examining division notes a failure to meet either requirement of Rule 137(4). It consequently issues a communication requesting the correction of this deficiency within a period of one month. The amendments in respect of which such a communication may be sent include, inter alia: (i) claims filed after the date of filing under Rule 58 (see A-III, 15) (ii) amendments filed before entry into the European phase from the PCT under Art. 19 PCT and/or Art. 34 PCT, if maintained on entry (see E-IX, 3) (iii) amendments filed on entry into the European phase from the PCT under Art. 28 PCT or Art. 41 PCT (see E-IX, 3) (iv) amendments filed after entry into the European phase from the PCT under Rule 161(1) or Rule 161(2) (see E-IX, 3) (v) amendments filed in response to the search opinion (see B-XI, 8) (vi) amendments filed during the examination procedure (see, however, H-III, 2.1.3), including those filed after the communication according to Rule 71(3). Such a communication can only be sent in respect of amendments which are part of a current request. It cannot relate to amendments which have since been withdrawn or superseded. A communication under Rule 137(4) can only be issued by the examining division (see B-XI, 2). If the applicant fails to comply with either requirement of Rule 137(4) within the above-mentioned period of one month, the application is deemed to be withdrawn, because the applicant is considered not to have replied to the communication from the examining division. The applicant may request further processing for failure to observe this time limit (see E-VIII, 2). If the amendments are filed in response to a communication according to Rule 71(3) and the requirements of Rule 137(4) are not satisfied in respect of them, the examining division may send a Rule 137(4) communication. Thereafter, if the applicant replies in time, the examining division will then decide whether to admit the amendments (see H-II, 2.5.4). Regarding the application of Rule 137(4) to auxiliary requests, see H-III, 3.3.1."
                        },
                        "2.1.2": {
                            "content": "Amendments withdrawn or superseded in the Rule 137(4) period If the applicant replies in time to the Rule 137(4) communication by withdrawing the amendments in respect of which the communication was sent but without identifying those amendments or indicating their basis in the application as filed, then no loss of rights will occur according to Rule 137(4). However, where the withdrawal results in the re-introduction of subject-matter that has already been objected to, the amendment introducing this subject-matter may be deemed to be inadmissible according to Rule 137(3) (see H-II, 2.3). No further Rule 137(4) communication will be sent in respect of further amendments filed in a timely response to the Rule 137(4) communication. By the expiry of the one-month period, the applicant must have identified and indicated the basis of: (i) amendments in respect of which the Rule 137(4) communication was sent and which are not superseded by further amendments filed during the one-month period under Rule 137(4), and (ii) amendments filed during that one-month period. The applicant does not need to comply with Rule 137(4) in respect of amendments which are superseded by further amendments filed in the one-month period. For example: 3 June 2020 Application filed: 10 claims 25 March 2021 Extended European search report drawn up 21 August 2023 Amended claims 1-10 filed in examination proceedings, no basis indicated 6 November 2023 Examining division sends a Rule 137(4) communication in respect of amended claims 1-10 filed on 21 August 2023 16 November 2023 Amended claims 6-10 filed 6 December 2023 One-month period under Rule 137(4) expires In the above example, the applicant must, by expiry of the one-month period according to Rule 137(4) on 6 December 2023, indicate the basis for amended claims 1-5 as filed on 21 August 2023 and for amended claims 6-10 as filed on 16 November 2023, and failure to do so results in the application being deemed to be withdrawn according to Art. 94(4). It is not necessary for the applicant to indicate the basis for the superseded amendments to claims 6-10 filed on 21 August 2023. Note in particular that, where the basis for the amendments to claims 6-10 filed on 16 November 2023 is not indicated by 6 December 2023, then no further Rule 137(4) communication is sent in respect of these amendments and the application is deemed to be withdrawn on expiry of the one-month period on 6 December 2023."
                        },
                        "2.1.3": {
                            "content": "Rule 137(4) and oral proceedings A Rule 137(4) communication will not be sent where the amendments in question are filed during oral proceedings. Nonetheless, it is a requirement of Rule 137(4) that amendments and their basis be identified. If the applicant fails to fulfil this requirement in respect of amendments filed during oral proceedings, the amendments may, for reasons of procedural economy and taking into account the applicant's right to be heard in accordance with Art. 113(1), be rejected as inadmissible by the examining division, exercising its discretion under Rule 137(3). Amendments filed in preparation for oral proceedings in response to the invitation according to Rule 116(2) will be dealt with in those oral proceedings as indicated above. However, if the oral proceedings are cancelled or applicants do not attend and the procedure is continued in writing after the oral proceedings are held in their absence, a Rule 137(4) communication may be sent by the examining division in respect of those amendments."
                        },
                        "2.1.4": {
                            "content": "Transitional provisions relating to Rule 137(4) The procedure described in H-III, 2.1.1 to H-III, 2.1.3 applies to the following applications (see Art. 2(2) of the decision of the Administrative Council of 25 March 2009, OJ EPO 2009, 299): (i) European applications for which the search report is drawn up on or after 1 April 2010, (ii) Euro-PCT applications for which the supplementary European search report is drawn up on or after 1 April 2010, and (iii) Euro-PCT applications for which the international search report is drawn up by the EPO acting as International Searching Authority on or after 1 April 2010 (Art. 153(6); see also E-IX, 3.4)."
                        }
                    }
                },
                "2.2": {
                    "content": "Amendment by submitting missing documents or by filing replacement pages The content of a European patent application or patent may be amended within the limits laid down in Art. 123(2) and (3). (For the conditions governing amendments, see also A-V, 2, H-II, H-IV, H-V and D-V, 6.) This will normally be done by submitting missing documents or by filing replacement pages. Where replacement pages are filed, the applicant or patent proprietor is advised, in the interests of procedural efficiency, to identify clearly all amendments made, and indicate on which passages of the original application these amendments are based. Where whole paragraphs have been added or deleted, it is not necessary to renumber the paragraphs throughout the entire application or patent. If handwritten amendments are filed during oral proceedings in opposition, the proprietor is invited in a Rule 82(2) communication to submit replacement paragraphs and/or claims only, and not replacement pages (see E-III, 8.7.3, and OJ EPO 2016, A22, points 8 to 14). Amendments should preferably be identified using functions available in a text editor to clearly indicate deletions and insertions in the amended text. Pages with such indications should be submitted in addition to clean copies. Alternatively, handwritten form is appropriate to fulfil the requirements of Rule 137(4), provided that clean copies are free from handwritten amendments. The basis for amendments should preferably be indicated by including in the letter of reply a list of the amendments made and the precise basis for amendments in the application as filed (see H-III, 2.1). Where the basis is not explicit, e.g. where a different wording is used or features are taken only from drawings or generalised from a specific embodiment, it is advisable to give a short explanation of why Art. 123(2) is fulfilled."
                },
                "2.3": {
                    "content": "Amendments using copies Amendments, particularly to the description or claims, may be made by using copies in accordance with the following procedure: If deemed expedient, the examining division or formalities officer may, on a copy of one or more pages of the documents to be amended, put forward suggestions as to how amendments should be made in such a way as to take account of the objections raised. The annotated copies (not the working documents which are to remain in the dossier) will then be forwarded to the applicant or, in opposition proceedings, to the proprietor of the patent and the other parties, in the communication setting out the objections. In this communication, the applicant or proprietor will not only be informed of the deficiencies recorded and invited to adopt a position or submit amendments within a fixed time limit, but will also be invited simultaneously to resubmit the said copy and – as an alternative to submitting replacement pages – to indicate on this copy, separately from the comments of the examining division (typewritten and in such a way as to be well legible after photocopying), any amendments to be made to the pages concerned. Opponents may also be invited to submit their comments in the same way. The parties may also submit copies of one or more amended pages on their own initiative. The filing of completely retyped documents is normally objected to, for reasons of procedural economy, as these documents will have to be checked for correspondence with the original documents (see T 113/92). Requests to this effect will, therefore, normally not be admitted under Rule 137(3). Only where the amendments are so extensive as to affect the legibility of the copies, replacement pages must be filed. In this case such pages may also be requested by the examining division on its own initiative."
                },
                "2.4": {
                    "content": "Amendments made by the EPO at the request of a party Where necessary, deficient documents may also be amended at the request of a party by the competent department of the EPO. This could be the procedure for minor amendments, e.g. where it is necessary to insert details which were omitted in the request for grant, and the number of amendments involved is reasonable, or where whole pages or paragraphs are to be deleted. The party concerned is advised to submit a list summarising the amendments to be undertaken by the EPO. It is, however, at the discretion of the examining division to decide whether the number of changes requested is in fact unreasonable and would take a considerable amount of time to deal with. If so, the examining division will require that the party makes the amendments and submits amended pages. This procedure could also be followed for minor amendments to drawings, e.g. for amending a reference number or deleting one or more whole figures (as regards the removal of references following an amendment to the description, see F-II, 4.8). In the case of complicated amendments to drawings, where it is not immediately clear how the changes are to be made, the party concerned, who as a rule is the applicant or proprietor, must submit replacement pages."
                },
                "2.5": {
                    "content": "Withdrawal of amendments/abandonment of subject matter Any subsequent request to withdraw an amendment is itself a request for further amendment; thus, if this subsequent request occurs after reply to the first communication from the examining division, the corresponding amendment will be admitted only if the examining division consents. In deleting subject-matter from an application, the applicant should avoid any statement which could be interpreted as abandonment of that subject-matter. Otherwise the subject-matter cannot be reinstated (see J 15/85, confirmed in G 1/05 and G 1/06)."
                }
            }
        },
        "3. ": {
            "title": "Auxiliary requests In examination, opposition and limitation proceedings, parties may submit a main request followed by one or more auxiliary requests (see also D-IV, 5.3).",
            "subsections": {
                "3.1": {
                    "content": "General principles If the main request is allowable, the division will ignore any auxiliary requests. If the main request is not allowable, the division will consider the auxiliary requests, in the sequence chosen by the requester. If an auxiliary request is allowable, the division will ignore all subsequent requests.",
                    "subsections": {
                        "3.1.1": {
                            "content": "Sequence of requests When a group of auxiliary requests is filed, these requests must be filed in a clear order and must not be worded such that they leave it for the examining division to identify and speculate on the intended text of the claims (R 14/10). Furthermore, all auxiliary requests must relate to one invention: the examining division will exercise its discretion under Rule 137(3) and will refuse to admit auxiliary requests which involve switching from the searched invention chosen for examination to another invention (see C-III, 3.5 and H-II, 6). Under Art. 113(2), the EPO decides upon European patent applications or patents only in the text submitted to it, or agreed, by applicants or proprietors. These parties must therefore clearly indicate the text they are proposing or, if they are submitting more than one text, the sequence in which they want the EPO to consider them. Otherwise the division does not know which version to base its decision on and would ultimately have to refuse the application, revoke the patent or reject the request for limitation for lack of any clear request."
                        },
                        "3.1.2": {
                            "content": "Obligation to give reasons In examination, opposition and limitation proceedings, whenever a request by any of the parties is refused, reasons must always be given."
                        },
                        "3.1.3": {
                            "content": "Neither main nor auxiliary requests allowable If the examining or opposition division cannot allow the main request or any of the auxiliary requests, it must issue a decision to that effect, taking Art. 113(1) and 116 into account. The decision must include the reasons for rejecting/refusing the main request and each of the auxiliary requests, except where the requests in question have been withdrawn."
                        }
                    }
                },
                "3.2": {
                    "content": "In the search phase In the search phase, under Rule 137(1) amendments to the claims are not admissible before the applicant receives the European search report, and therefore no auxiliary requests can be submitted. If auxiliary requests are submitted before the establishment of a supplementary European search report (see H-II, 2.1), only the main request will be taken into account in the search (see, however, B-VIII, 3.2.2 and B-VIII, 4.2.2)."
                },
                "3.3": {
                    "content": "In examination proceedings",
                    "subsections": {
                        "3.3.1": {
                            "content": "Indication of the amendments made in the requests and of their basis Where requests (main and/or auxiliary) are filed in examination proceedings and the applicant does not identify the amendments and/or does not indicate the basis for them in the application as filed, a communication according to Rule 137(4) may also be sent in respect of one or more of the newly filed main and/or auxiliary requests. For requests filed in preparation for oral proceedings, late filed requests or requests filed during oral proceedings, see H-III, 2.1.3."
                        },
                        "3.3.2": {
                            "content": "Admissibility of auxiliary requests 3.3.2.1 Criteria for admissibility of auxiliary requests As a matter of principle, the examining division must, when exercising its discretion under Rule 137(3) not to admit one or more auxiliary requests, balance the interests of the applicant and procedural efficiency (see also H-II, 2.3, H-II, 2.5.1, H-II, 2.6 and H-II, 2.7). Thus, an auxiliary request which contains minor deficiencies but otherwise complies with the requirements of the EPC is normally admitted into the procedure. When deciding on the admissibility of auxiliary requests the principles set out in H-II are considered for each of the requests, since each request is in fact a set of amended claims. Auxiliary requests reintroducing subject-matter which has already been considered unallowable and has been removed by the applicant will not be admitted (see also H-II, 2.3). The same may apply to auxiliary requests introducing new deficiencies. 3.3.2.2 Timeliness and structure of auxiliary requests If auxiliary requests are filed after the final date set in accordance with Rule 116(2), they are usually treated as late-filed unless a summons to oral proceedings was issued as the first action. For late-filed requests, in addition to the criteria set out in H-III, 3.3.2.1, the subject-matter of the new claims must not diverge considerably from the claims already filed. The requests normally need to represent a convergent development, i.e. the subject-matter of the auxiliary requests constitutes a sequential limitation in the direction of an intended invention and does not make use of different characteristics in order to branch out in different directions (T 1273/04). In particular, the applicant cannot shift to the examining division the responsibility for defining the subject-matter of the application by filing a large number of unstructured requests or requests involving different variants: this leads to the requests not being admitted."
                        },
                        "3.3.3": {
                            "content": "Preparing the decision If the examining division is able to allow an auxiliary request (but not the main request or any higher-ranking auxiliary requests), it will inform the applicant accordingly in a communication under Rule 71(2) or in an annex to the communication according to Rule 71(3), giving a brief indication of the essential reasons for refusing the main and higher-ranking auxiliary requests (see C-V, 1.1). Where an auxiliary request appears to comprise subject-matter that offers a good starting point for an allowable request, but it is considered expedient to issue a communication under Art. 94(3), a brief indication is given of the essential reasons for the non-allowability or non-admissibility of the subject- matter of the higher-ranking requests, and a suggestion is provided as to the most promising request (see C-III, 4.1.2). Care needs to be taken where oral proceedings have been specifically requested in cases where the examining division has not allowed the main request: the applicant must be summoned to oral proceedings even if the examining division considers one of the auxiliary requests to be patentable. In such cases it may be appropriate to ask applicants in a telephone call whether, in view of the examining division's intention to issue a communication under Rule 71(3) for the allowable auxiliary request, they would be prepared either to withdraw the request for oral proceedings for the main request or to replace the main request with the allowable auxiliary request. During oral proceedings, the division addresses the main request and decides on the admissibility of the auxiliary requests, if any, filed in reply to the summons to oral proceedings (see H-II, 2.3 and H-III, 2.1.3). Moreover, it may be appropriate to ask applicants whether, in view of an allowable request, they would be prepared to withdraw the unallowable higher- ranking request(s). However, the applicant is not obliged to do so. The summons to oral proceedings must indicate the essential reasons that led the examining division not to allow or not to admit the auxiliary requests already filed so that the applicant is not taken by surprise by the refusal of the application in case the applicant decides not to attend the oral proceedings (C-V, 1.1 and C-V, 4.9). This applies regardless of whether oral proceedings are held in the absence of the applicant or are cancelled. In deciding on the admissibility of the auxiliary requests, the examining division will apply the criteria set out in: (i) H-III, 3.3.2.1 if auxiliary requests are submitted by the date set according to Rule 116(1); (ii) H-III, 3.3.2.1 and H-III, 3.3.2.2 if auxiliary requests are submitted after the date set according to Rule 116(1). The examining division may then exercise its discretion under Rule 137(3) not to admit one or more of the requests (see H-II, 2.3, H-II, 2.7, H-II, 2.7.1 and H-III, 3.3.1), and it may do so in the absence of the applicant/representative. A decision to refuse the application in these circumstances must not take the applicant by surprise (E-III, 8.3.3.1 and E-III, 8.3.3.3)."
                        },
                        "3.3.4": {
                            "content": "Complete text for auxiliary request not yet available If a complete text corresponding to the allowable auxiliary request does not yet exist, the applicant must be asked to make the necessary amendments. In oral proceedings, the division does always try to have the description brought into line with the version of the claims it considers allowable. If necessary, the oral proceedings are interrupted for this purpose."
                        },
                        "3.3.5": {
                            "content": "Complete text for auxiliary request available If a complete text of the application according to the allowable auxiliary request already exists, a communication under Rule 71(3) is issued. In an annex to this communication the division must give a brief indication of the reasons on which the refusal of the higher-ranking requests is based (see also C-V, 1.1). Where appropriate, this may be done by reference to earlier communications. If applicants approve this proposed text, then in accordance with Rule 71(3) they indicate this by filing the translations of the claims and paying the fees for grant and publishing without filing any request for amendment or correction of the proposed text (if such a request is filed, the procedure is as indicated in C-V, 4). If they do so, the application proceeds to grant on the basis of the text of the auxiliary request as proposed in the communication under Rule 71(3) (see C-V, 2)."
                        },
                        "3.3.6": {
                            "content": "Applicant does not approve the text proposed for grant If the applicant does not approve the text according to the auxiliary request as proposed in the communication under Rule 71(3), the procedure is as set out in C-V, 4 (see in particular C-V, 4.7 and C-V, 4.6.2)."
                        }
                    }
                },
                "3.4": {
                    "content": "In opposition proceedings In opposition proceedings, if an auxiliary request by the proprietor for maintenance of the patent in amended form is allowable, the division cannot revoke the patent (see T 234/86).",
                    "subsections": {
                        "3.4.1": {
                            "content": "Written procedure If the opposition division, after examining the parties' submissions, considers it can maintain the patent only in amended form as per an auxiliary request from the proprietor, it must first ensure that the parties have been allowed to comment under Art. 113(1) on the grounds and evidence behind the non-allowance of the higher-ranking request(s) and on the grounds and evidence behind the allowance of the lower-ranking request (where oral proceedings have been requested, see also H-III, 3.5.2). If, despite the existence of an allowable request, the proprietor continues to maintain one or more unallowable higher-ranking requests, an interlocutory decision is issued. This decision must include the finding that the patent and the invention to which it relates, as amended in accordance with the allowable auxiliary request, meet the requirements of the EPC. It must also set out the reasons, based on grounds and evidence already communicated to the parties, for refusing the higher-ranking requests and for allowing the lower-ranking request."
                        },
                        "3.4.2": {
                            "content": "Oral proceedings If the opposition division is able to allow an auxiliary request but not the main or higher-ranking auxiliary requests, the chair informs the parties (possibly after interrupting the proceedings) which request is allowable and that the higher-ranking request(s) is/are not allowable (and on which grounds they are not allowable), ensuring beforehand that the parties have already had the opportunity to comment on all grounds and evidence underlying this finding. The chair will then normally ask proprietors if they are prepared to convert the allowable auxiliary request into a main request (by abandoning all higher-ranking unallowable requests). The division cannot, however, insist on the proprietor making such a declaration. If, despite the existence of an allowable auxiliary request, the proprietor continues to maintain higher-ranking unallowable requests, the division issues an interlocutory decision to the effect that: (a) the main request and possibly one or more auxiliary requests is/are not allowable (b) in respect of the allowable auxiliary request, the amended patent and the invention to which it relates satisfy the requirements of the EPC. If, on the other hand, the proprietor withdraws the higher-ranking requests such that the allowable auxiliary request becomes the main request, the division will issue an interlocutory decision to the effect that this request satisfies the EPC. The division tries as far as possible to ensure that, if it allows an auxiliary request at oral proceedings, the complete final text is available at the end of the proceedings."
                        }
                    }
                },
                "3.5": {
                    "content": "In limitation proceedings",
                    "subsections": {
                        "3.5.1": {
                            "content": "General principles The filing of auxiliary requests (e.g. claim versions) together with a main request is possible in limitation proceedings, just as in examination proceedings. However, there are restrictions with regard to the possibility of filing amendments in limitation proceedings (see D-X, 4.3 and D-X, 4.5). The procedure to be applied, subject to any request for oral proceedings, is slightly different to that applicable in pre-grant proceedings under Rule 71(3), especially in view of the requirements of Art. 113(1) and (2). In particular, in a case where an auxiliary request is allowable and the main request is not, if this were communicated under Rule 95(3), this would no longer leave the requester the option of having the main request rejected with an appealable decision. Thus, the following applies: (a) if the main request is allowable, the invitation under Rule 95(3) to file the translations and pay the fees will be issued on that basis; (b) if an auxiliary request is allowable, but not the main request (and possibly other higher-ranking requests), proprietors will be informed of the reasons in a communication under Rule 95(2) and invited to abandon the non-allowable request(s); if they do not do so, the request will be rejected as in (c) below; (c) if none of the requests is allowable, initially a communication under Rule 95(2) setting out the reasons and indicating a possible remedy is sent to the requester; if no remedy is undertaken, a decision rejecting the request is issued, and the annex prepared by the examining division will need to set out the reasons why none of the requests are allowable. In cases (b) and (c), the decision may be appealed by the requester."
                        },
                        "3.5.2": {
                            "content": "Written procedure If the examining division, after examining the request for limitation, considers that the patent can be limited only on the basis of an auxiliary request, it informs the requester accordingly in a communication under Rule 95(2), giving reasons why the main request and any higher-ranking auxiliary requests are not allowable and informing the requester which auxiliary request is considered allowable. Where appropriate, the division also informs the requester what amendments must be made to the patent specification documents to bring them into line (Art. 105b(1) and Rule 95(2)). If in response to the communication under Rule 95(2) the requester withdraws the unallowable request(s) and (where applicable) makes any amendments still outstanding, the examining division will issue a communication under Rule 95(3) inviting him to pay the prescribed fee and to file the translation of the limited claims of the allowable request (see D-X, 5). If the requesters insist on maintaining an unallowable request, and fail to comply with the examining division's request that they file documents corresponding to the allowable auxiliary request, the request for limitation must be rejected (Art. 105b(2) and Rule 95(4)). The decision must give the reasons for not allowing the higher-ranking request(s) and must point out, as regards the allowable auxiliary request, that the requester failed to comply with the division's request to submit a text enabling the patent to be limited on the basis of the allowable request."
                        },
                        "3.5.3": {
                            "content": "Oral proceedings If the examining division is able to allow an auxiliary request but not the main or higher-ranking requests, the chair informs the requesters (possibly after interrupting the proceedings) which request is allowable and why the higher-ranking request(s) is/are not. The requesters will then normally be asked if they are prepared to convert the allowable auxiliary request into a main request. The division cannot however insist on the requester making such a declaration. If, despite the existence of an allowable text, the requester continues to maintain an unallowable higher-ranking request, the request for limitation shall be rejected (Rule 95(4)). The division will issue a decision giving the reasons for not allowing the higher-preference requests and pointing out that, as regards the allowable auxiliary request, the requester failed to comply with its request to submit a text enabling the patent to be limited on the basis of the allowable request."
                        }
                    }
                }
            },
            "content": " Example 1: \"We request grant of a patent as per the documents originally filed or, alternatively, as per the amended documents now enclosed.\" Example 2: \"We request that the opposition be rejected or, alternatively, that the patent be maintained in amended form as per the enclosed documents.\" Such further (auxiliary) requests are made in case the examining or opposition division cannot allow the main (first) request. If in examination proceedings applicants file text labelled as an auxiliary request, but also indicate that they are not yet willing to restrict themselves to that request, the text is not to be considered as a true auxiliary request within the meaning of this chapter, such that it is not possible to proceed directly to the issue of a communication under Rule 71(3) based on this text (see C-V, 1.1). In such circumstances it is appropriate to contact applicants by telephone to establish whether they are prepared to proceed to grant on the basis of that text. The applicant's agreement or non-agreement that a Rule 71(3) communication can be based on such an auxiliary request must be mentioned in the minutes of the telephone conversation or, in the case of agreement, in the Rule 71(3) communication (see C-VII, 2.5)."
        },
        "4. ": {
            "title": "Different texts in respect of different contracting states In the cases discussed in H-III, 4.2 to H-III, 4.4, an application or a patent may contain a different set of claims (and descriptions) for different contracting states (also see G-IV, 6). For examination and opposition proceedings, see H-III, 4.1 to H-III, 4.4; for limitation proceedings, see D-X, 10.",
            "subsections": {
                "4.1": {
                    "content": "Dealing with different texts in examination If the examining or opposition division considers that the description and drawings are so inconsistent with any set of claims as to create confusion, it will require the applicant or proprietor to amend the description and drawings to remedy this. If the applicant or proprietor voluntarily proposes such an amendment the examining or opposition division will admit it only if it considers this necessary. In particular, different descriptions and drawings will be required only if it is not possible to set out clearly in a common description which subject-matter is to be protected in the different contracting states. For adaptation of the description in the case of national rights of earlier date, see H-III, 4.4. Hence this type of application or patent will, after amendment, either consist of two or more distinct sets of claims each supported by the same description and drawings, or two or more sets of claims each supported by different descriptions and drawings. For the application of Rules 80 and 138 in opposition proceedings, see H-III, 4.2, H-III, 4.4 and H-III, 4.5."
                },
                "4.2": {
                    "content": "Different text in respect of the state of the art according to Art. 54(3) EPC and Art. 54(4) EPC 1973 If the EPO notes that in respect of one or more of the designated contracting states the content of an earlier European patent application forms part of the state of the art pursuant to Art. 54(3), two situations can arise: (i) the application under examination was pending at the date of entry into force of the EPC 2000 (13 December 2007), or the patent under examination had already been granted at that date. Art. 54(4) EPC 1973 is still transitionally applicable (see Art. 1 of the decision of the Administrative Council of 28 June 2001, OJ EPO 2003 Special edition No. 1, 202), with Rule 23a EPC 1973 and the first part of Rule 87 EPC 1973 as implementing regulations thereto. Here, if conflicting prior art gives rise to different texts of the claims for different contracting states and if the relevant designation fee(s) for the earlier European patent application has/have been paid, different sets of claims for the contracting states concerned may be filed, if required to establish novelty over that prior art. In opposition proceedings, Rule 80 also applies to amendments occasioned by the state of the art according to Art. 54(4) EPC 1973. (ii) the application or patent under examination is not one of those covered under (i). As Art. 54(4) EPC 1973 has been deleted, the conflicting prior art belongs to the state of the art for all contracting states, irrespective of the effected designations (see also F-II, 4.3). Likewise, it is irrelevant if the designation fee(s) for the earlier European patent application has/have been paid, since there is no provision in the EPC 2000 corresponding to Rule 23a EPC 1973. Consequently, the possibility of having different texts for different contracting states on the basis of Art. 54(3) no longer exists."
                },
                "4.3": {
                    "content": "Different text where a transfer of right takes place pursuant to Art. 61 or Rule 78 in respect of certain designated states",
                    "subsections": {
                        "4.3.1": {
                            "content": "Different text where a transfer of right takes place pursuant to Art. 61 in examination proceedings If by a final decision pursuant to Art. 61 it is adjudged that a third party is entitled to the grant of a European patent, the original European patent application must contain, \"where appropriate\", for the designated contracting states in which the decision was taken or recognised or must be recognised on the basis of the Protocol on Recognition, claims, a description and drawings which are different from those for the other designated contracting states (see also H-III, 4.1 and C-IX, 2)."
                        },
                        "4.3.2": {
                            "content": "Different texts where a transfer of the patent in respect of certain designated states takes place in opposition proceedings Where a third party has, in accordance with Art. 99(4), replaced the previous proprietor for one or some of the designated contracting states (see D-I, 6, third paragraph), the patent as maintained in opposition proceedings may for those states contain claims, a description and drawings which are different from those for the other designated contracting states (see also D-VII, 3.2). However, Rule 80 applies to amendments by each of the proprietors."
                        },
                        "4.3.3": {
                            "content": "Opposition cases with different texts where a transfer of rights by virtue of a final decision pursuant to Art. 61 takes place in examination proceedings The substance of H-III, 4.3.2 applies mutatis mutandis (see also D-I, 6, third paragraph and D-VII, 3.2)."
                        }
                    }
                },
                "4.4": {
                    "content": "Different texts where national rights of earlier date exist National rights of earlier date are not comprised in the state of the art (Art. 54) for the purposes of the EPO examination for patentability. However, under Art. 139(2), national rights of earlier date can be invoked, after the grant of the European patent, in national proceedings as a ground for revocation. These rights represent exceptions to the uniformity of European substantive patent law. Where national rights exist, therefore, the applicant or proprietor has a legitimate interest in submitting different claims to ensure that the patent granted will not be partly revoked in some contracting states (see Rule 80 and Rule 138). The filing of different claims is, however, neither required nor suggested. If an applicant or proprietor produces evidence in examination/opposition proceedings of the existence of pertinent national rights of earlier date in a particular (designated) contracting state, it is appropriate to admit separate claims for the contracting state in question. The evidence must be in the form of a specification or, where applicable, a copy of the utility model or utility certificate or of the application for it (see Art. 140); this is necessary to prevent unjustified deviation from the unity of the European patent. In opposition proceedings, a national right of earlier date is neither a ground for opposition nor a ground for revocation. Hence, it is not admissible for an opponent to introduce a national right of earlier date into opposition proceedings to support a novelty attack. The effect of the national right of earlier date is determined by the relevant national provisions. The examining or opposition division does not decide whether the applicant or proprietor has limited the scope of the application/patent to the extent required to overcome the effect of the national right (see G-IV, 6). That is the responsibility of the applicant or proprietor. The examining or opposition division must check that the separate claims do not contravene Art. 123(2) and Art. 123(3), and that they meet the other requirements of the EPC. The same applies to a separate description (see H-III, 4.1). Moreover, in general, there is no justification for a separate description. However, at a suitable point in the preamble to the description, preferably in a separate paragraph following the information pursuant to Rule 42(1)(a), a reference to this situation must be made, for example along the following lines: \"With reference to ... (e.g. earlier application No. ... in ...), the applicant has voluntarily limited the scope of the application /patent for... (contracting state) by submitting separate claims for this (these) state(s).\""
                },
                "4.5": {
                    "content": "Opposition proceedings where the claims as granted are different for different contracting states Where a patent has been granted with different sets of claims for the reasons set out in H-III, 4.2 to H-III, 4.4, the proprietor might wish to bring the claims into line either by applying a limitation already introduced for one or more contracting states to the other contracting states or by filing a new single set of claims for all contracting states. In such a case, the amendments to each different set of claims as granted must separately fulfil the requirements of Rule 80 and Art. 123(3) (and Rule 138, if applicable)."
                }
            },
            "content": " It is not possible to have different text in respect of extension or validation states, as the relevant provisions allowing an exception to the principle of unity of the European patent application/patent relate only to EPC contracting states. However, where there are different text versions for the contracting states, the applicant may determine which one applies to the respective extension/validation state."
        },
        "5. ": {
            "title": "Calculation of claims fees The claims fees are calculated in accordance with A-X, 11.2, C-V, 1.4, C-V, 4.2 and C-V, 4.8.1.",
            "subsections": {}
        }
    },
    "Chapter IV – Allowability of amendments": {
        "1. ": {
            "title": "Introduction Chapters H-II and H-III deal with the admissibility of amendments, i.e.",
            "subsections": {},
            "content": " whether the competent department of the EPO will admit amended application documents or an amended patent specification into the procedure. After an amendment has been admitted into the procedure, the competent department must then decide whether the amendment is allowable, i.e. whether it satisfies the requirements of the EPC. It is important to note that an admissible amendment is not automatically allowable."
        },
        "2. ": {
            "title": "Allowability of amendments under Art. 123(2)",
            "subsections": {
                "2.1": {
                    "content": "Basic principle The question of allowability of amendments is legally a question of whether the application as so amended is allowable. An amended application must of course satisfy all the requirements of the EPC including, in particular, inventive step and the other matters listed in B-XI, 3.6 (see also C-III, 2). If, however, the applicant seeks to amend the description (other than references to the prior art, see H-IV, 2.2.7), the drawings or the claims in such a way that subject-matter which extends beyond the content of the application as filed is thereby introduced, the application as so amended cannot be allowed. The underlying idea of Art. 123(2) is that applicants are not allowed to improve their position by adding subject-matter not disclosed in the application as filed, which would give him an unwarranted advantage and could be damaging to the legal security of third parties relying on the content of the original application (see G 1/93). An amendment is regarded as introducing subject-matter which extends beyond the content of the application as filed, and therefore unallowable, if the overall change in the content of the application (whether by way of addition, alteration or excision) results in the skilled person being presented with information which is not directly and unambiguously derivable from that previously presented by the application, even when account is taken of matter which is implicit to a person skilled in the art (see G 2/10)."
                },
                "2.2": {
                    "content": "Content of the application as \"originally\" filed – general rules Under Art. 123(2), it is impermissible to add to a European application subject-matter which the skilled person cannot derive directly and unambiguously, using common general knowledge and also taking into account any features implicit to a person skilled in the art in what is expressly mentioned in the document, from the disclosure of the application as filed. Literal support is, however, not required by the wording of Art. 123(2) (see T 667/08). The term \"implicit disclosure\" means no more than the clear and unambiguous consequence of what is explicitly mentioned in the application as filed. Thus, the common general knowledge must be taken into account in deciding what is clearly and unambiguously implied by the explicit disclosure of a document. However, the question of what may be rendered obvious by that disclosure in the light of common general knowledge is not relevant to the assessment of what is implicitly disclosed by that document (T 823/96, T 1125/07). When assessing the conformity of the amended claims with the requirements of Art. 123(2), the focus is placed on what is really disclosed to the skilled person by the documents as filed as directed to a technical audience. In particular, the examining division needs to avoid disproportionally focusing on the structure of the claims as filed to the detriment of the subject-matter that the skilled person would directly and unambiguously derive from the application as a whole. Furthermore, the assessment of the requirements of Art. 123(2) is made from the standpoint of the skilled person on a technical and reasonable basis, avoiding artificial and semantic constructions (T 99/13).",
                    "subsections": {
                        "2.2.1": {
                            "content": "Features described in a document cross-referenced in the description Features which are not disclosed in the description of the invention as originally filed but which are only described in a cross-referenced document which is identified in such description are prima facie not within \"the content of the application as filed\" for the purpose of Art. 123(2). It is only under particular conditions that such features can be introduced by way of amendment into the claims of an application. Such an amendment would not contravene Art. 123(2) if the description of the invention as originally filed leaves no doubt to a skilled reader (see T 689/90) that: (i) protection is or may be sought for such features; (ii) such features contribute to solving the technical problem underlying the invention; (iii) such features at least implicitly clearly belong to the description of the invention contained in the application as filed (Art. 78(1)(b)) and thus to the content of the application as filed (Art. 123(2)); and (iv) such features are precisely defined and identifiable within the disclosure of the reference document. Moreover, documents not available to the public on the date of filing of the application can only be considered if (see T 737/90): (a) a copy of the document was available to the EPO, or to the receiving Office if the application is a Euro-PCT application which was not filed at the EPO as the receiving Office, on or before the date of filing of the application; and (b) the document was made available to the public no later than on the date of publication of the application under Art. 93 (e.g. by being present in the application dossier and therefore made public under Art. 128(4))."
                        },
                        "2.2.2": {
                            "content": "Missing parts of the description or missing drawings filed under Rule 56 after the date of filing Rule 56 allows the applicant to file missing drawings or parts of the description subsequently, and to rely on the priority document in order to avoid redating of the application to the date of filing of the missing parts. Under Rule 56(3), redating is only avoided where the missing parts were \"completely contained\" in the priority document (see C-III, 1 and A-II, 5). Rule 56(3) applies only at the filing stage of the application. At later stages of the procedure it is not permissible to rely on the priority documents to correct or amend the application as filed (in keeping with G 3/89 and G 11/91). For Euro-PCT applications a similar provision exists under Rule 20.6 PCT, whereby a review by the EPO as elected or designated Office is possible under Rule 82ter PCT. Missing parts of the description and/or missing drawings allowed under Rule 56(3) are always considered to be part of the application documents \"as originally filed\"."
                        },
                        "2.2.3": {
                            "content": "Erroneously filed application documents or parts under Rule 56a Rule 56a allows the applicant to file correct application documents or parts if wrong application documents or parts have been filed erroneously. Under Rule 56a(4) the applicant can rely on the priority document to avoid redating the application to the date of filing of the correct application documents or parts. If applicants realise on the filing date (or earlier if the filing date cannot yet be accorded) that they erroneously filed incorrect application documents, they can file correct application documents under Rule 56a(2) on or before the filing date, without changing the filing date (A-II, 6.6). If correct application documents or parts are filed later than the date of filing, under Rule 56a(4), redating is avoided if the correct documents or parts were \"completely contained\" in the priority document (see C-III, 1 and A-II, 6). Rule 56a(4) applies only at the filing stage of the application. It is not permissible to rely on the priority documents to correct or amend the application as filed at later stages of the procedure (in keeping with G 3/89 and G 11/91). For Euro-PCT applications a similar provision exists under Rule 20.5bis(d) PCT and Rule 20.6 PCT, whereby a review by the EPO as elected or designated Office is possible under Rule 82ter PCT. Correct application documents or parts allowed under Rule 56a(2) and Rule 56a(4) are always considered to be part of the application documents \"as originally filed\" (see A-II, 6.3 and A-II, 6.4). If erroneously filed application documents or parts remain in the application under Rule 56a(4), they are part of the application as filed (Art. 123(2))."
                        },
                        "2.2.4": {
                            "content": "Claims filed after the date of filing Claims filed after the date of filing under Rule 58 are never considered to be part of the application documents \"as originally filed\" and must therefore comply with the requirements of Art. 123(2) (see A-III, 15). For this reason, the examining division has to check that the claims satisfy the requirements of Art. 123(2), according to the same practice and standards as established in examination for amendments filed in other phases of the procedure (see H-V)."
                        },
                        "2.2.5": {
                            "content": "Sequence listings filed after the date of filing A standardised sequence listing filed after the date of filing does not form part of the description (Rule 30(2)). Such a standardised sequence listing is not published either as an annex to the application or together with the specification (see the notice from the EPO dated 9 December 2021, OJ EPO 2021, A97, point 15). Pages and electronic files disclosing sequences or constituting a non- standardised sequence listing which were filed at the date of filing are an integral part of the application as originally filed and are treated like any other parts of the description. A subsequently filed standardised sequence listing may contain only the sequence information – in a standardised form – already contained in the original application, and in particular the number of sequences and their numbering needs to be the same as in the original description (see the notice from the EPO dated 9 December 2021, OJ EPO 2021, A97). To this end the applicant must file a statement confirming that the subsequently filed standardised sequence listing does not include matter which goes beyond the content of the application as originally filed (Art. 2(2) of the decision of the President dated 9 December 2021, OJ EPO 2021, A96). In line with this, a subsequently filed standardised sequence listing cannot be used to determine the originally disclosed content of the application, but only for search purposes (see the notice from the EPO dated 9 December 2021, OJ EPO 2021, A97). A subsequently filed standardised sequence listing is not to be examined for compliance with the requirements of Art. 123(2), as it is not part of the description. Without prejudice to Rule 30, a sequence listing forming part of the description may be corrected or amended in accordance with Rule 139 and/or Art. 123(2). In this case a complete new sequence listing in TXT format containing the corrections or amendments is to be filed (see the notice from the EPO dated 9 December 2021, OJ EPO 2021, A97, point 10)."
                        },
                        "2.2.6": {
                            "content": "Priority documents Under Art. 123(2) it is impermissible to add to a European application matter present only in the priority document for that application (see T 260/85) unless this is done under the provisions of Rule 56(3) (H-IV, 2.2.2) or Rule 56a(4) (H-IV, 2.2.3). For correction of errors, see H-VI, 4."
                        },
                        "2.2.7": {
                            "content": "Citation of prior art in the description after the filing date There is normally no objection to an applicant introducing, by amendment, further information regarding prior art which is relevant; indeed this may be required by the examining division (see F-II, 4.3 and F-III, 8)."
                        },
                        "2.2.8": {
                            "content": "Clarifications The removal of a lack of clarity will normally not be objected to, provided that the change does not extend beyond the disclosure of the application as originally filed (Art. 123(2))."
                        },
                        "2.2.9": {
                            "content": "Trade marks If an amendment is made in order to clarify the meaning of a trade mark or to replace a registered trade mark with a corresponding technical term, the examining division needs to be particularly careful to ascertain that the amendment does not conflict with Art. 123(2). The composition of a trade- marked product may have changed over time."
                        }
                    }
                },
                "2.3": {
                    "content": "Content of the application as \"originally\" filed – special applications",
                    "subsections": {
                        "2.3.1": {
                            "content": "Applications filed by reference to an earlier application According to Rule 40(1)(c), the applicant may file a European application by reference to a previously filed application (A-II, 4.1.3.1). Since claims are no longer required in order for a date of filing to be accorded, the applicant has three options: (i) when filing the European application, indicate that the reference to the previously filed application includes the claims (ii) at the time of filing, file a new set of claims together with an indication that the description and any drawings are filed by reference to a previously filed application (iii) when filing the European application, indicate the reference to a previously filed application and file the claims after the date of filing (Rule 58). In cases (i) and (ii) the claims will form part of the application as originally filed, whereas in case (iii) the claims filed after the date of filing will not and will thus have to fulfil the requirements of Art. 123(2) (see H-IV, 2.2.4)."
                        },
                        "2.3.2": {
                            "content": "Divisional applications Under Art. 76(1), the subject-matter of a divisional application may not extend beyond the content of the parent application as originally filed. Furthermore, amendments made to the divisional application subsequent to its filing may not extend beyond the content of the divisional application as originally filed (Art. 123(2); for more details see C-IX, 1.4)."
                        },
                        "2.3.3": {
                            "content": "Applications resulting from a decision under Art. 61 If, as a result of a final decision, it is adjudged that a person other than the applicant is entitled to the grant of a patent, that person may file a new European patent application under Art. 61(1)(b). In this case, the provisions of Art. 76(1) apply mutatis mutandis to the new application filed under Art. 61(1)(b). This means that the new application must not contain any subject-matter extending beyond the content of the earlier (unentitled) application as originally filed. Furthermore, Art. 123(2) means that this new application may not be amended in such a way as to extend its subject-matter beyond its content as originally filed, even where the subject-matter in question is contained in the earlier application (for more details see C-IX, 2.1)."
                        },
                        "2.3.4": {
                            "content": "International applications For the purposes of Art. 123(2), the documents as originally filed are those originally filed in the PCT phase (normally published as a WO publication), a copy of which can always be obtained from the International Bureau. Therefore amendments made during the PCT phase (including amended, substitute or rectified sheets, even if attached to the WO publication) or upon entry into the regional phase before the EPO must, if maintained in the European phase, fulfil the requirements of Art. 123(2), and all such amendments must be carefully considered."
                        }
                    }
                }
            }
        },
        "3. ": {
            "title": "Allowability of amendments under Art. 123(3)",
            "subsections": {
                "3.1": {
                    "content": "Basic principles The European patent as granted or as amended in opposition, limitation or revocation proceedings determines retroactively the protection conferred by the European patent application. Opposition proceedings will frequently give rise to amendments to the claims, following from grounds for opposition raised under Art. 100. Reasoned requests filed independently by proprietors of the patent for an amendment to the claims, e.g. for limitation of the patent in view of an aspect of the state of the art which has come to their knowledge, may also result in amendments to the claims after examination by the opposition division. In such cases the claims of the European patent may not be amended in such a way as to extend the protection conferred by the patent. Art. 123(3) is directly aimed at protecting the interests of third parties by prohibiting any broadening of the claims of a granted patent, even if there is a basis for such broadening in the application as filed (see G 1/93, Reasons 9)."
                },
                "3.2": {
                    "content": "Protection conferred by the patent as granted The extent of protection conferred by a European patent is determined by the claims. Nevertheless, the description and drawings are to be used to interpret the claims. The Protocol on the Interpretation of Art. 69, which is, pursuant to Art. 164(1), an integral part of the EPC, specifies how Art. 69 is to be interpreted. Since, pursuant to Art. 69(1), amendments to the description and drawings will also influence the interpretation of the claims, and may therefore extend the protection conferred, any such amendments extending protection in this way are not allowable (see G 1/93)."
                },
                "3.3": {
                    "content": "Version of the granted patent to be considered In order to verify the criteria of Art. 123(3) the examining or opposition division needs to compare the text of the amended claims with the claims of the patent as granted or as amended in opposition or earlier limitation proceedings, whichever claims are the most recent in force."
                },
                "3.4": {
                    "content": "Assessment of impermissible extension of the protection conferred In view of the above considerations, all amendments made to claims and any connected amendments to the description and drawings in the course of opposition proceedings, such as a change in the technical features of the invention, must be examined to determine whether such amendments could result in the extension of the subject-matter beyond the content of the application as originally filed (Art. 123(2)) or in the extension of the protection conferred (Art. 123(3)). If, in view of Art. 84, the application documents have been adapted to amended claims before grant, thereby deleting part of the subject-matter originally disclosed in order to avoid inconsistencies in the patent specification, as a rule, subject-matter deleted for this reason cannot be reinserted either into the patent specification or into the claims as granted without infringing Art. 123(3). An analogous finding applies to subject-matter retained in the patent specification during such adaptation for reasons of comprehensibility, but indicated as not relating to the claimed invention. The requirements of Art. 123(2) and Art. 123(3) have to be dealt with separately: (a) Examination for compliance with Art. 123(2) is conducted in the same way as in examination proceedings. (b) Examination for compliance with Art. 123(3), on the other hand, is based on the claims as granted, or as amended in opposition or earlier limitation proceedings, where necessary using the description and drawings to interpret the claims (Art. 69 and the Protocol on the Interpretation of Art. 69). A composition which is specified in a claim as comprising a component in an amount which is defined by a numerical range of values is subject to an implicit proviso excluding the presence of that component in an amount outside of that range. An amendment restricting the breadth of that component, for instance by narrowing down a generic class or a list of chemical compounds defining that component, has the consequence of limiting the scope of this implicit proviso. However, a composition which is defined as comprising the components indicated in the claim is open to the presence of any further components unless otherwise specified. Therefore in a claim directed to such an openly defined composition, the restriction of the breadth of a component present therein may have the effect of broadening the scope of protection of that claim, with the consequence that in opposition/appeal proceedings such amended claim may extend the protection conferred by the granted patent (Art. 123(3)) (see T 2017/07 and T 287/11). Restricting the breadth of the component means that certain materials are no longer explicitly limited by the claim and therefore can be present in amounts which were excluded from the granted claim."
                },
                "3.5": {
                    "content": "Conflicts between Art. 123(2) and Art. 123(3) A possible conflict between the requirements of Art. 123(2) and (3) may occur where, in the procedure before grant, a feature was added to the application which is considered unallowable under Art. 123(2) in opposition proceedings. In that case, Art. 123(2) would require deletion of such a feature whereas Art. 123(3) would not allow deletion, as this would extend the protection conferred by the patent as granted. In such a case the patent will have to be revoked under Art. 100(c). However, where this feature can be replaced by a feature for which there is a basis in the application as filed and which does not extend the protection conferred by the patent as granted, maintenance in this amended form can be allowed. If the added feature, without providing a technical contribution to the subject-matter of the claimed invention, merely limits the protection conferred by the patent as granted by excluding protection for part of the subject-matter of the claimed invention as covered by the application as filed, this feature may be maintained (see G 1/93). The technical significance of a feature in a claim is governed by its contribution to the technical definition of the claimed subject-matter, and that contribution is to be assessed by the skilled person in the light of the original disclosure (see T 518/99)."
                },
                "3.6": {
                    "content": "Conflicts between Art. 123(3) and other requirements of the EPC Other requirements of the EPC may also interact with Art. 123(3) after grant. For instance, if a patent as granted only contains claims that in fact define a \"method for treatment of the human or animal body by therapy or surgery practised on the human or animal body\" or contain such a method step, and such a patent is opposed under Art. 53(c), then Art. 53(c) and 123(3) may operate in combination so that the patent must inevitably be revoked, in that: - the patent cannot be maintained as granted because its claims define subject-matter which is excluded from patentability under Art. 53(c); and - the patent cannot be maintained in amended form because amendment of the claims as granted by deletion of such \"method features\" would be contrary to Art. 123(3) (see T 82/93)."
                }
            }
        },
        "4. ": {
            "title": "Amendments relating to unsearched matter",
            "subsections": {
                "4.1": {
                    "content": "Rule 137(5) Rule 137(5) relates to a matter of substantive law rather than to procedural law. It sets out two further conditions for the allowability of amended claims, namely they may not relate to (i) unsearched subject-matter which does not combine with the originally claimed invention or group of inventions to form a single general inventive concept and (ii) subject-matter not searched in accordance with Rule 62a and Rule 63 (see, however, H-II, 5). Thus Rule 137(5), as opposed to Rule 137(3), does not provide a legal basis for the exercise of discretion by the division not to admit amended claims. The examination of the compliance of amended claims with Rule 137(5) therefore requires an in-depth assessment, not just a prima facie analysis.",
                    "subsections": {
                        "4.1.1": {
                            "content": "Rule 62a and/or Rule 63 cases Amended claims may not relate to subject-matter not searched in accordance with Rule 62a or Rule 63 (see, however, H-II, 5). Consequently, the presence of this subject-matter in the description cannot be used as a basis for its reintroduction into the claims (see also B-VIII, 3.2.2 and B-VIII, 4.2.2). However, the examining division does not raise an objection under Rule 137(5), second sentence, if the applicant only further limits a searched claim by introducing subject-matter taken from the description unless this subject-matter was explicitly declared as not searched under Rule 62a and/or Rule 63. When assessing the allowability of an amendment under Rule 137(5), second sentence, the examining division also evaluates if the limitation of the search under Rule 62a and/or Rule 63 or the declaration of no search was justified (see B-VIII, 3.2.2, B-VIII, 4.2.2, H-II, 5). If the invitation was not appropriate or the limitation not justified, an additional search may be necessary (see C-IV, 7.3)."
                        },
                        "4.1.2": {
                            "content": "Subject-matter taken from the description Within the framework of Art. 123(2) and Art. 82, Rule 137(5), first sentence, should be construed as permitting any limitation of searched subject-matter which is unitary with the originally claimed subject-matter, irrespective of whether the technical feature(s) used for the limitation has/have been searched. If amended claims are directed to subject-matter which has not been searched because it only appeared in the description (and the search division did not find it appropriate to extend the search to this subject-matter; see B-III, 3.5) and which does not combine with the originally claimed and searched invention or group of inventions to form a single general inventive concept (see F-V, 3), such amendments are not allowable. In other words, in order to assess whether or not amended claims fulfil the requirements of Rule 137(5), first sentence, the examining division needs to establish first whether or not the subject-matter to which they relate has or should have been searched (see B-III, 3) and second whether or not an objection of lack of unity would have been raised if the amended claims had been present in the set of claims on file at the time of the search. As a consequence, an objection under Rule 137(5), first sentence, will normally arise if the applicant attempts to replace a technical feature contained in a claim with a technical feature taken from the description and having an effect unrelated to the effect(s) of the features of the originally claimed invention(s). If an objection under Rule 137(5), first sentence, is raised, the examining division provides a reasoning why the subject-matter has not been searched (see B-III, 3) and why the subject-matter does not combine with the originally claimed invention or inventions to form a single general inventive concept (see F-V, 3). Applicants are informed that they may continue to pursue such subject-matter only in the form of a divisional application under Art. 76. The situation described above is different from amendments corresponding to an invention originally claimed but not searched under Rule 64, or Rule 164(1) or Rule 164(2), which are dealt with in H-II, 6.2. Applicants should bear in mind that the examination procedure should be brought to a conclusion in as few actions as possible. Therefore, the examining division may exercise its right not to admit further amendments under Rule 137(3) (see H-II, 2.3)."
                        }
                    }
                },
                "4.2": {
                    "content": "Euro-PCT applications For Euro-PCT applications where the EPO acted as ISA or SISA, the examining division has to issue an invitation under Rule 164(2) for any now claimed but unsearched invention contained in the originally filed application documents (description, claims and drawings, if any) which are to serve as the basis for examination upon expiry of the six-month time limit set in the communication under Rule 161 or Rule 162 (see C-III, 3.1)."
                }
            }
        },
        "5. ": {
            "title": "Compliance of amendments with other EPC requirements",
            "subsections": {
                "5.1": {
                    "content": "General principles The other EPC requirements with which amendments have to comply will depend on whether the amendments are filed in examination, opposition or limitation proceedings (see below)."
                },
                "5.2": {
                    "content": "In examination proceedings The question of allowability of amendments is legally a question of whether the application as so amended is allowable. An amended application must of course satisfy all the requirements of the EPC including, in particular, inventive step and the other matters listed in B-XI, 3.6 (see also C-III, 2). Also, however, especially when the claims have been substantially limited, the examining division needs to bear in mind that the following questions may require special consideration at the amendment stage. (i) Unity of invention Do the amended claims still satisfy the requirements of Art. 82? If the search report seems to reveal lack of novelty or inventive step in the concept common to all the claims, but the amended claims do not necessitate further search, the examining division will consider carefully whether an objection of lack of unity is justified at this stage of the proceedings (see F-V, 6). If, however, the claims lack a common inventive concept and a further search is necessary, then an objection is raised. (ii) Agreement of description and claims If the claims have been amended, will the description require corresponding amendment to remove serious inconsistency between them? For example, is every embodiment of the invention described still within the scope of one or more claims? (see F-IV, 4.3 and H-V, 2.7). Conversely, are all of the amended claims supported by the description? (see F-IV, 6). Also, if the categories of claims have been altered, will the title require corresponding amendment (see H-V, 8)?"
                },
                "5.3": {
                    "content": "In opposition proceedings The proprietors of the patent generally have to indicate the basis in the original application documents or claims of the granted patent from which the amendments may be derived (Art. 100(c) and Art. 123(2)). In addition, they should file observations as regards the patentability of the subject-matter of the patent as amended (with reference to Art. 100(a) and (b)), taking into account the state of the art and objections raised in the opposition notice together, where appropriate, with the evidence presented in support. Opposition is not an opportunity to re-examine the whole patent; it is the amendments introduced into the patent which must be examined as to whether they comply with the EPC as a whole (see G 3/14, T 227/88 and T 301/87). Therefore the opposition division will check that the patent, by the amendments themselves, does not contravene the requirements of the EPC (with the exception of Art. 82, see G 1/91 and D-V, 2). With respect to Art. 84, see D-V, 5. For the form of amended documents, see H-III, 2.2 to H-III, 2.4. The formal requirements, in particular those specified by Rules 30 to 34, Rules 42, 43, 48 and 50, and the decision of the President of the EPO dated 25 November 2022, OJ EPO 2022, A113, must also be satisfied (see Rule 86)."
                },
                "5.4": {
                    "content": "In limitation proceedings Limitation is not an opportunity to re-examine the whole patent; only the amended claims are to be examined with regard to Art. 84 and Art. 123(2) and (3), i.e. what needs to be considered is whether the requested amendments introduce a deficiency within the meaning of those provisions. Claims as granted or as maintained are not examined anew.",
                    "subsections": {
                        "5.4.1": {
                            "content": "Art. 84 It is also to be verified that the amended claims are in conformity with Art. 84. For the interpretation of clarity under Art. 84 in limitation proceedings, the usual standards apply (see F-IV, 4, 5 and 6). Note in this respect that mere clarifications made to the claims, in particular to dependent claims, cannot be allowed unless they are necessitated by the limitation(s) introduced elsewhere in the claims."
                        },
                        "5.4.2": {
                            "content": "Examination of the description and/or drawings Rule 95(2) requires only the amended claims to be examined in limitation proceedings. Nonetheless, if the applicant has not filed amendments to the description, the examining division checks whether the amended claims are still supported by the description. If this is not the case, in accordance with Rule 95(2) the proprietor is requested to amend either the description or the claims, in order to comply with Art. 84. In this context it is pointed out that the examining division may not adapt the description of its own motion. If, however, for the purpose of limitation an amended description and/or drawings are presented together with the claims, these are to be checked, but only for compliance with the requirements of Art. 123(2) and (3) and Art. 84. Note that in this respect amendments made to the description solely in order to improve the patent, or cosmetic changes which are not necessitated by the limited claims, cannot be allowed."
                        },
                        "5.4.3": {
                            "content": "Points to be disregarded In limitation proceedings there is no examination as to why a request for limitation was filed or whether the goal of the limitation has been achieved, for example if the amended and limited claims are truly novel vis-à-vis a particular prior art document. In general there is no need to verify whether the limited claims contravene any of Art. 52 to  57. It may however happen that limitation results in prima facie non-compliance with the patentability criteria, e.g. Art. 53, in which case the examining division will communicate this non-compliance to the requester. Examples: A granted claim directed to a generic plant is limited to a specific plant variety. As the amended claim then relates to a plant variety per se it is excluded from patentability under Art. 53(b) (G 1/98). A claim granted to a device comprising a controlled explosion system is limited to a claim reciting an anti-personnel mine comprising the controlled explosion system, which would be contrary to Art. 53(a)."
                        }
                    }
                }
            }
        }
    },
    "Chapter V – Allowability of amendments - examples": {
        "1. ": {
            "title": "Introduction Chapter H-V provides additional guidance and examples relating to a number of typical situations where compliance with Art. 123(2) and/or Art. 123(3) is an issue. However, it must be borne in mind that the allowability of a specific amendment is ultimately to be decided on a case- by-case basis.",
            "subsections": {}
        },
        "2. ": {
            "title": "Amendments in the description",
            "subsections": {
                "2.1": {
                    "content": "Clarification of a technical effect Where a technical feature was clearly disclosed in the original application but its effect was not mentioned or not mentioned fully, yet it can be deduced without difficulty by a person skilled in the art from the application as filed, subsequent clarification of that effect in the description does not contravene Art. 123(2)."
                },
                "2.2": {
                    "content": "Introduction of further examples and new effects Amendment by the introduction of further examples always needs to be looked at very carefully in the light of the general considerations outlined in H-IV, 2. The same applies to the introduction of statements of new (i.e. previously not mentioned) effects of the invention such as new technical advantages. For example, if the invention as originally presented related to a process for cleaning woollen clothing consisting of treating the clothing with a particular fluid, the applicant is not allowed to introduce later into the description a statement that the process also has the advantage of protecting the clothing against moth damage. Under certain circumstances, however, later filed examples or new effects, even if not allowed into the application, may nevertheless be taken into account by the examining division as evidence in support of the patentability of the claimed invention. For instance, an additional example may be accepted as evidence that the invention can be readily applied, on the basis of the information given in the originally filed application, over the whole field claimed (see F-IV, 6.3). Similarly a new effect may be considered as evidence in support of inventive step, provided that this new effect is implied by or at least related to an effect disclosed in the originally filed application (see G-VII, 10)."
                },
                "2.3": {
                    "content": "Supplementary technical information Any supplementary technical information submitted after the filing date of the application will be added to the part of the file which is open to public inspection unless excluded from public inspection pursuant to Rule 144(d). From the date on which the information is added to the open part of the file, it forms part of the state of the art within the meaning of Art. 54(2). In order to notify the public of the existence of such information submitted after the application was filed and not included in the specification, an appropriate mention will be printed on the cover page of the patent specification."
                },
                "2.4": {
                    "content": "Revision of stated technical problem Care must also be taken to ensure that any amendment to, or subsequent insertion of, a statement of the technical problem solved by the invention meets Art. 123(2). For example it may happen that following restriction of the claims to meet an objection of lack of inventive step, it is desired to revise the stated problem to emphasise an effect attainable by the thus restricted invention but not by the prior art. It must be remembered that such revision is only permissible if the effect emphasised is one deducible by a person skilled in the art without difficulty from the application as filed (see H-V, 2.1 and 2.2 above). If the suggested amendment would contravene Art. 123(2), it will be necessary to amend the description in some other way, e.g. by defining the problem in more general terms or by omitting any express statement of the problem altogether."
                },
                "2.5": {
                    "content": "Reference document Features from a cross-referenced document can, under particular conditions be introduced by way of amendment into the claims of an application (see H-IV, 2.2.1)."
                },
                "2.6": {
                    "content": "Alteration, excision or addition of text in the description Alteration or excision of the text, as well as the addition of further text, may introduce fresh subject-matter. For instance, suppose an invention related to a multi-layer laminated panel, and the description included several examples of different layered arrangements, one of these having an outer layer of polyethylene; amendment of this example either to alter the outer layer to polypropylene or to omit this layer altogether would not normally be allowable. In each case, the panel disclosed by the amendment example would be quite different from that originally disclosed and, hence, the amendment would introduce fresh subject-matter and therefore be unallowable."
                },
                "2.7": {
                    "content": "Bringing the description into line with amended claims The description must be brought into line with amended claims by amending it as needed to meet the requirements set out in F-II, 4.2, F-IV, 4.3(iii) and F-IV, 4.4. If the applicant does not amend the description as required despite being asked to do so, the examining division's next action may be to issue a summons to oral proceedings; for the time limit, E-III, 6(iii) applies."
                }
            }
        },
        "3. ": {
            "title": "Amendments in claims Replacement or removal of features from a claim, as well as the addition of further features, may introduce fresh subject-matter not only in the claim itself, but also in the claims when considered as a whole. In fact, such amendments could result in a combination of features not disclosed in the application as filed when the amended claim is considered together with its dependent claims and/or the claims on which it depends.",
            "subsections": {
                "3.1": {
                    "content": "Replacement or removal of features from a claim The requirements of Art. 123(2) are only met if the replacement or removal of a feature lies within the limits of what a skilled person would derive directly and unambiguously, using common general knowledge and seen objectively and relative to the date of filing (or the date of priority according to Art. 89), from the whole of the application documents (G 3/89, G 11/91 and G 2/10). If the amendment by replacing or removing a feature from a claim fails to pass the following test by at least one criterion, it necessarily contravenes the requirements of Art. 123(2): (i) the replaced or removed feature was not explained as essential in the originally filed disclosure; (ii) the skilled person would directly and unambiguously recognise that the feature is not, as such, indispensable for the function of the invention in the light of the technical problem the invention serves to solve (in this context special care needs to be taken in cases where the technical problem is reformulated during the proceedings, see H-V, 2.4 and G-VII, 11); and (iii) the skilled person would recognise that the replacement or removal requires no modification of one or more features to compensate for the change (it does not in itself alter the invention). However, even if the above criteria are met, the division must still ensure that the amendment by replacing or removing a feature from a claim satisfies the requirements of Art. 123(2) as they also have been set out in G 3/89 and G 11/91, referred to in G 2/10 as \"the gold standard\". If several features are deleted from an independent claim, so that for example it is restricted to only part of the originally claimed subject-matter, the subject-matter of the amended claim must be directly and unambiguously derivable from the application as filed as being an invention per se, i.e. it must solve a technical problem and be able to work in the absence of any of the particular features being deleted. The removal of a limiting feature from an independent granted claim is likely to result in broadening the scope of protection afforded and could therefore contravene Art. 123(3). Likewise, if a feature in a granted claim is replaced, compliance with Art. 123(3) has to be carefully checked."
                },
                "3.2": {
                    "content": "Inclusion of additional features A claim may be limited by the inclusion of additional features, provided the resulting combination was directly and unambiguously disclosed in the application as originally filed in an explicit or implicit manner (see H-IV, 2.1) and does not relate to an invention which was not searched (see H-IV, 4 and H-II, 6.2). If the resulting combination is novel over the application as originally filed (see the test for novelty given in G-VI, 2), the amended claim does not fulfil the requirements of Art. 123(2). The fact that the resulting combination can be seen as: - \"not inconsistent\" with the description (T 495/06) or - \"reasonably plausible\" (T 824/06) or - \"obvious\" in view of the application (T 329/99) is not sufficient for an amendment to be allowable under Art. 123(2), since its direct and unambiguous disclosure is required. A claim may be limited by inclusion of additional features, for example: (a) from dependent claims, which were dependent on the claim to be limited; (b) from the description (see also H-V, 3.2.1); (c) from drawings (see H-V, 6); (d) arising from the conversion of an independent claim to a dependent claim; provided the above requirements are fulfilled.",
                    "subsections": {
                        "3.2.1": {
                            "content": "Intermediate generalisations Extracting a specific feature in isolation from an originally disclosed combination of features and using it to delimit claimed subject-matter may be allowed only if there is no structural and functional relationship between the features. When evaluating whether the limitation of a claim by a feature extracted from a combination of features fulfils the requirements of Art. 123(2), the content of the application as filed must not be considered to be a reservoir from which individual features pertaining to separate embodiments can be combined in order to artificially create a particular combination. When a feature is taken from a particular embodiment and added to the claim, it has to be established that: - the feature is not related or inextricably linked to the other features of that embodiment and - the overall disclosure justifies the generalising isolation of the feature and its introduction into the claim. These conditions are to be understood as an aid to assessing, in the particular case of an intermediate generalisation, if the amendment fulfils the requirements of Art. 123(2). In any case it has to be ensured that the skilled person is not presented with information which is not directly and unambiguously derivable from the originally filed application, even when account is taken of matter which is implicit to a person skilled in the art using the common general knowledge. Example 1 The amended claim relates to a heddle for the harness of a loom. The original claim was limited by introducing features that were disclosed only in connection with a specific embodiment in which the eyelet of the heddle had the shape of a spindle. This shape was not included in the amended claim. In the general part of the description it was also mentioned that the eyelet could also have other shapes such as an elliptic shape. Therefore the board concluded that the amendment was allowable under Art. 123(2) (T 300/06). Example 2 Claim 1 relates to a water dispersible and flushable absorbent article. Amended claim 1 specifies that each of the first and second fibrous assemblies is a wet laid tissue. The application as filed referred, in connection with the first fibrous assembly, to a wet laid tissue in combination with other features (tissue is apertured; tissue is provided with fibrils or sufficient inherent porosity). Since the first fibrous assembly is disclosed in the application as filed as being a wet laid tissue only in combination with other features which are not present in claim 1, the amendments made constitute a generalisation of the originally disclosed technical information and thereby introduce subject- matter extending beyond the content of the application as filed (T 1164/04). Example 3 Original claim 1 relates to a coating composition comprising at least one rosin compound, at least one polymer and an antifoulant. After amendment a new claim was introduced relating to a method for preparing a coating composition comprising the mixing of at least one rosin compound, at least one polymer and an antifoulant. The only basis for the method is the examples. The board observed that for some solutions the amount of added rosin was extremely low whereas for others it was extremely high. The subject-matter of the amended claim was considered to be an unallowable generalisation of the examples, since nothing in the description indicated to the person skilled in the art that the observed variations were not essential to make a coating composition (T 200/04). Example 4 Original claim 1 relates to a multi-processing system comprising a shared memory, a directory and a serialisation point. The serialisation point is defined in functional terms. Claim 1 was amended by adding features that were addressed in the description as part of the cache coherence strategy. The board held that the incorporated features, albeit disclosed as such, had been isolated in an arbitrary manner from the overall disclosure of the cache coherent memory access architecture. At least one feature had been omitted although its function was presented as being essential to achieving cache coherence. Therefore amended claim 1 was not directly and unambiguously derivable from the original application (T 166/04)."
                        }
                    }
                },
                "3.3": {
                    "content": "Deletion of part of the claimed subject-matter It is permissible to delete parts of the claimed subject-matter if the corresponding embodiments were originally described, e.g. as alternatives in the claim or as embodiments explicitly set out in the description. Example: Original application: \"A polymer blend XY ... containing, as a filler, graphite, talc, asbestos or silica\" Prior art: \"A polymer blend XY ... containing asbestos\". Limited claim: \"A polymer blend XY ... containing, as a filler, graphite, talc or silica\". The deletion of alternatives from more than one list is only allowable if this does not result in the creation of new technical information that is not directly and unambiguously derivable from the application as originally filed. In particular, limitations that do not result in the singling out of a particular combination of specific features but maintain the remaining subject-matter as a generic group which differs from the original group only by its smaller size will normally fulfil the requirements of Art. 123(2) EPC. Deletion of part of the claimed subject-matter resulting in a combination of specific features may be allowable if the application as filed provides a pointer towards that particular combination, e.g. by reference to particular embodiments. These principles also apply to the combination of features resulting from dependent claims. Example Original claim 1 \"A composition for therapeutic use comprising a therapeutic agent and a glass-forming carbohydrate.\" Original claim 22 \"A composition according to claim 1 wherein the therapeutic agent is selected from the group enzymes, biopharmaceuticals, growth hormones, growth factors, insulin, monoclonal antibodies, interferons, interleukins and cytokines.\" Original disclosure In the description, inhalation is listed as one of several ways of administration. In the description, insulin is listed as one of several therapeutic agents. Limited claim 1 \"A composition for therapeutic use suitable for administration by inhalation comprising a therapeutic agent and a glass-forming carbohydrate\". Dependent claim 10 \"A composition according to claim 1 wherein the therapeutic agent is insulin\" The limitation to inhalation in claim 1 results from a choice from one list and has a basis in the application as originally filed. The combination of the subject-matter of dependent claim 10 with the subject-matter of claim 1 results from a selection from multiple lists which is not disclosed directly and unambiguously in the application as originally filed. The number of amendments held to have been combined to arrive at the amended claimed subject-matter is not decisive in order to assess whether the claimed subject-matter extends beyond the content of the application as filed. What is required is an analysis of whether the claimed subject-matter is explicitly or implicitly, but directly and unambiguously, disclosed in the application as filed. Wherever possible, the claim should be limited by a positive indication of what subject-matter remains instead of stating what is being deleted from the subject-matter (as a disclaimer would do). Example: - \"... a polyether of molecular weight from 600 to 10 000\" restricted to \"... above 1 500 to 10 000\" (T 433/86)."
                },
                "3.4": {
                    "content": "Further cases of broadening of claims The deletion of a statement regarding use or intended purpose in an independent product claim fulfils the requirements of Art. 123(2) only if the application as filed offers a basis for the assumption that the product can also be used in some other way (and if the statement of purpose does not amount to a functional limitation). The broadening of a claim by exchanging a particular feature for a more general feature cannot be based on an indication that it would be obvious for a skilled person (see also H-V, 3.2.1). Moreover, the deletion of a particular feature or its replacement by a more general feature usually leads to a broadening of the claim. Therefore, the requirements of Art. 123(3) are not fulfilled."
                },
                "3.5": {
                    "content": "Amendments relating to ranges In the case of a disclosure of both a general and a preferred range, a combination of the preferred disclosed narrower range and one of the part- ranges lying within the disclosed overall range on either side of the narrower range can usually be derived from the original disclosure of the application."
                }
            }
        },
        "4. ": {
            "title": "Disclaimers",
            "subsections": {
                "4.1": {
                    "content": "Disclaimer disclosed in the application as originally filed In this case, the original application already indicates that specific subject- matter is not part of the invention. Negative features help to define the claimed invention in the same way as positive ones, and must be examined on the same basis. In other words, they may confer novelty and, like positive features, are assessed as to their relevance to inventive step. They must also fulfil the requirements of Art. 84 (clarity, conciseness and support), and their inclusion in the claims must not infringe Art. 123(2) (T 170/87, T 365/88). Examples: - \"... said delivery means does not comprise a capacitor element\"; - \"... with the proviso that blends having a melt index of lower than"
                },
                "0.05": {
                    "content": "are excluded\". Negative features, like positive ones, may be structural or functional, and may relate to either a physical entity or an activity."
                },
                "4.2": {
                    "content": "Disclaimers not disclosed in the application as originally filed",
                    "subsections": {
                        "4.2.1": {
                            "content": "The subject-matter to be excluded is not disclosed in the application as originally filed (so-called undisclosed disclaimers) Limiting the scope of a claim by using a \"disclaimer\" to exclude a technical feature not disclosed in the application as filed may be allowable under Art. 123(2) in the following cases (see G 1/03 and G 1/16 and F-IV, 4.20): (i) restoring novelty over a disclosure under Art. 54(3); (ii) restoring novelty over an accidental anticipation under Art. 54(2). \"An anticipation is accidental if it is so unrelated to and remote from the claimed invention that the person skilled in the art would never have taken it into consideration when making the invention\". The status of \"accidental\" is to be ascertained without looking at the available further state of the art. A related document does not become an accidental anticipation merely because there are other disclosures even more closely related. The fact that a document is not considered to be the closest prior art is insufficient for achieving the status of \"accidental\". An accidental disclosure has nothing to do with the teaching of the claimed invention, since it is not relevant for examining inventive step. For example, this is the case when the same compounds serve as starting materials in entirely different reactions yielding different end products (see T 298/01). A prior art, the teaching of which leads away from the invention, however, does not constitute an accidental anticipation; the fact that the novelty destroying disclosure is a comparative example is also insufficient for achieving the status of \"accidental\" (see T 14/01 and T 1146/01); (iii) removing subject-matter which, under Art. 52 to Art. 57, is excluded from patentability for non-technical reasons. For example, the insertion of \"non-human\" in order to satisfy the requirements of Art. 53(a) is allowable. These criteria notwithstanding the introduction of the undisclosed disclaimer may not provide a technical contribution to the subject-matter disclosed in the application as filed. The undisclosed disclaimer (which inevitably quantitatively reduces the original technical teaching) may not qualitatively change the original technical teaching in the sense that the applicant's or patent proprietor's position with regard to other requirements for patentability is improved. In particular, it may not be or become relevant for the assessment of inventive step or for the question of sufficiency of disclosure. Hence, the evaluation of inventive step has to be carried out disregarding the undisclosed disclaimer (see G 1/16). The disclaimer may not remove more than necessary either to restore novelty (cases (i) and (ii) above) or to disclaim subject-matter excluded from patentability for non-technical reasons (case (iii) above). An undisclosed disclaimer is, in particular, not allowable if: (i) it is made in order to exclude non-working embodiments or remedy insufficient disclosure; (ii) it makes a technical contribution. (iii) the limitation is relevant for assessing inventive step; (iv) the disclaimer, which would otherwise be allowable on the basis of a conflicting application alone (Art. 54(3)), renders the invention novel or inventive over a separate prior art document under Art. 54(2), which is a not accidental anticipation of the claimed invention; (v) the disclaimer based on a conflicting application also serves another purpose, e.g. it removes a deficiency under Art. 83. Art. 84 applies equally to the claim per se and to the disclaimer itself (see T 2130/11). In the interest of the patent's transparency, the excluded prior art must be indicated in the description in accordance with Rule 42(1)(b) and the relation between the prior art and the disclaimer must be shown."
                        },
                        "4.2.2": {
                            "content": "The subject-matter to be excluded is disclosed in the application as originally filed The test to be applied is whether the subject-matter remaining in the claim after the introduction of the disclaimer is, be it explicitly or implicitly, directly and unambiguously disclosed in the application as filed to the skilled person using its common general knowledge at the date of filing (or the date of priority according to Art. 89), see G 2/10, Headnote 1a. This test is the same as that applied when the allowability of a limitation of a claim by a positively defined feature is to be determined (see H-V, 3.2). When it comes to determining whether, after the introduction of the disclaimer, the claim infringes Art. 123(2) or whether it is in conformity with it, this cannot be decided solely by establishing that the disclaimed subject- matter is disclosed in the application as filed. Whether the skilled person is presented with new information depends on how he or she would understand the amended claim, i.e. the subject-matter remaining in the amended claim and on whether, using common general knowledge, he or she would regard that subject-matter as at least implicitly disclosed in the application as filed. What is required is an assessment of the overall technical circumstances of the individual case under consideration, taking into account the nature and extent of the disclosure in the application as filed, the nature and extent of the disclaimed subject-matter and its relationship with the subject-matter remaining in the claim after the amendment. In this respect it has to be established whether the disclaiming of subject- matter leads for example to the singling out of compounds or sub-classes of compounds or other so-called intermediate generalisations not specifically mentioned or implicitly disclosed in the application as filed (see G 2/10). Whether the invention works for the claimed subject-matter and what problem is credibly solved by it are questions which are not relevant for assessing whether this subject-matter extends beyond the content of the application as filed (see T 2130/11)."
                        }
                    }
                }
            }
        },
        "5. ": {
            "title": "Amendments to drawings It sometimes occurs that the drawings used for publication of the application are not those originally filed but are subsequently filed drawings, because the latter are more suitable for reproduction (for drawings filed under Rule 56, see A-II, 5 and subsections and for drawings filed under Rule 56a, see A-II, 6 and subsections). In this case, the formalities officer in the Receiving Section will check that the subsequently filed drawings are identical to the originals.",
            "subsections": {},
            "content": " However, the ultimate responsibility for ensuring that the subsequently filed drawings do not contain new technical information, which would conflict with Art. 123(2), rests with the examining division. If the examining division considers that these drawings conflict with Art. 123(2), it requires the applicant to submit other drawings which correspond exactly in substance to the drawings originally filed. It is not normally possible under Art. 123(2) to add completely new drawings to an application, since in most cases a new drawing cannot be unambiguously derivable from the mere text of the description. For the same reasons, amendments to drawings are carefully checked for compliance with Art. 123(2)."
        },
        "6. ": {
            "title": "Amendments derived from drawings Care needs to be taken when amendments are based on details which may only be derived from the schematic drawings of the original application.",
            "subsections": {},
            "content": " In particular, a figure which serves only to give a schematic explanation of the principle of the subject-matter of the invention and not to represent it in every detail does not allow the conclusion that the disclosed teaching purposively excluded a feature not represented. The manner in which a particular feature is depicted in the drawings may be accidental. The skilled person must be able to clearly and unmistakably recognise from the drawings, in the context of the whole description, that the added feature is the deliberate result of the technical considerations directed to the solution of the technical problem involved. For example, in an application relating to a vehicle where neither the claims nor the description contains any information about the location of the engine, the drawings may depict a vehicle in which approximately two thirds of the height of the engine is located below a plane tangent to the top of the wheels. An amendment which uses the generalised terms \"the major portion of the height of the engine\" to define that said major portion is located below the given level would infringe Art. 123(2) unless the skilled person would be able to recognise from the drawings, in the context of the whole description, that such a spatial arrangement of the engine with respect to the wheels is in fact a deliberate measure directed to the solution of the technical problem."
        },
        "7. ": {
            "title": "Changes in claim category in opposition An amendment can be in the form of a change in the category of a claim, possibly combined with a change in the technical features of the invention.",
            "subsections": {
                "7.1": {
                    "content": "Product claim to use claim If a patent is so amended that a claim to a product (a physical entity) is replaced by a claim to the use of this product, the degree of protection is not extended, provided that the use claim in reality defines the use of a particular physical entity to achieve an effect and does not define such a use to produce a product (see G 2/88)."
                },
                "7.2": {
                    "content": "Product claim to method claim If a patent is so amended that a claim to a product is replaced by a claim to a method for producing the product, this change of category is allowable, provided that the method now claimed only results in the product previously claimed. As it is a fundamental principle of European patent law that the protection conferred by a product claim covers all methods for production of the product, the limitation to one of these methods cannot extend the protection conferred originally (see T 5/90 and T 54/90)."
                },
                "7.3": {
                    "content": "Method claim to product claim In general, a change in claim category from a method in which an apparatus is used to the apparatus itself is not allowable (see T 86/90). However, it may exceptionally be allowable to replace a claim directed to a method of operating a device by a claim directed to the device itself if the original claim contains the claimed features of the device exhaustively, whether in structural or functional terms (see T 378/86 and T 426/89). This exception, however, does not apply if the device as now claimed is for its features no longer dependent on the circumstances of its operation whereas it depended on them under the terms of the prior method claim (see T 82/93). Moreover, changing the category from a purpose-limited process claim in the format of a Swiss-type claim in accordance with G 5/83 to a purpose- limited product claim in accordance with Art. 54(5) contravenes Art. 123(3), because a purpose-limited process claim confers less protection than a purpose-limited product claim (T 1673/11)."
                },
                "7.4": {
                    "content": "Method claim to use claim The change from a process for the preparation of a product to the use of the product for a purpose other than previously claimed is not allowable (see T 98/85 and T 194/85). On the other hand, the change in a claim from a method in which a certain product is used to a claim to the use of that product in performing that same method is allowable (see T 332/94)."
                }
            },
            "content": " Firstly it must be clear that this amendment is necessitated by grounds for opposition (see H-II, 3.1). If that is not the case, a change of category is refused. Even if this condition is fulfilled, the opposition division exercises great caution in allowing a change of claim category, since the protection as conferred by the claims may thus be extended (Art. 123(3)). Examples are given in the following sections. Note that these examples could also give rise to issues under Art. 123(2)."
        },
        "8. ": {
            "title": "Changes in the title The sole purpose of the title is to inform the public about the technical information disclosed in the application. The title has no bearing on the content of the application as filed or on the protection conferred by the patent, once granted. Furthermore, the title is not part of the documents to be approved by an applicant before a patent can be granted.",
            "subsections": {},
            "content": " Thus the ultimate responsibility for the title rests with the division, and it is within the division's discretion to accept or not any request from the applicant for a change in the title (see also A-III, 7)."
        }
    },
    "Chapter VI – Correction of errors": {
        "1. ": {
            "title": "Introduction Documents filed with the EPO may contain errors, e.g. in the bibliographic data, the description, the claims or the drawings (see H-VI, 2). Errors may also occur in the decision to grant or other decisions of the EPO",
            "subsections": {},
            "content": " (see H-VI, 3), in formatting/editing (see H-VI, 4), as well as in printing the specification (see H-VI, 6). These errors can be corrected as set out below."
        },
        "2. ": {
            "title": "Corrections of errors in documents filed with the EPO Corrections under Rule 139 concern linguistic errors, errors of transcription and other mistakes in documents filed with the EPO, especially in application documents (see H-VI, 2.2.1).",
            "subsections": {
                "2.1": {
                    "content": "Admissibility The correction of linguistic errors, errors of transcription and other mistakes in any document filed with the EPO may in principle be requested as long as proceedings are pending before the EPO (J 42/92). However, during examination proceedings, such requests for correction can be considered only if the decision-making process has not yet been concluded, in other words at the latest on the day before the date on which the decision to grant is handed over to the EPO's internal postal service for transmittal to the applicant (see G 12/91; date \"to EPO postal service\" printed at the bottom of Form 2006A). See also H-II, 2.6, last paragraph. Moreover, other time limitations apply to requests under Rule 139: (i) In the case of correction of bibliographic data (e.g. priority, designation) or of procedural declarations (e.g. withdrawal), time limitations may derive from the protection of the interests of the public. For instance, in the absence of any special circumstances, a request for correction of a priority claim by the addition of a first priority needs to be made sufficiently early for a warning to be included in the publication of the application (J 6/91). Otherwise, correction is possible only where it is apparent on the face of the published application that a mistake has been made (see also A-V, 3). An erroneous withdrawal of an application may only be corrected if, at the time when the request for correction is made, the public has not yet been officially notified of the withdrawal (J 25/03). (ii) Limitations on requesting the correction of an error in a document filed with the EPO also exist where a decision has already been taken or a procedural phase terminated on the basis of the document containing the error. A request under Rule 139 cannot reinstate an applicant into an earlier procedural phase or reverse the effects of a decision already taken (J 3/01, see also H-VI, 3.1). Such a request is therefore inadmissible in these cases.",
                    "subsections": {
                        "2.1.1": {
                            "content": "Admissibility in opposition and limitation proceedings Errors in documents filed during opposition and limitation proceedings may be corrected under Rule 139 (G 1/12) as long as the corresponding proceedings are pending before the EPO. In opposition and limitation, requests to correct an error under Rule 139 may not, however, be used to correct the content of the decision to grant, thereby circumventing the restrictions under Rule 140. 2.1.1.1 Errors in the description, claims and drawings The submission by the proprietor of an amended specification containing the correction of an obvious error will be admitted: - in opposition proceedings if the correction is part of an amendment going beyond the mere removal of an error, namely an amendment occasioned by a ground for opposition (see H-II, 3); Therefore, if the proprietor files an amended specification fulfilling the requirements of Rule 80, they can additionally request the correction of an obvious error under Rule 139 (see T 657/11). This request for correction will be dealt with by the opposition division (see H-VI, 2), as described in H-VI, 2.2 to H-VI, 2.2.1. - in limitation proceedings if the correction is part of an amendment going beyond the mere removal of an error, namely an amendment constituting a limitation vis-à-vis the claims as granted or amended, and complies with Art. 84 and Art. 123 (see D-X, 4.3). In other words, if an amended set of claims fulfilling the requirements of Rule 95(2) is filed in limitation proceedings, obvious errors can be corrected under Rule 139."
                        }
                    }
                },
                "2.2": {
                    "content": "Allowability Corrections of clerical or grammatical errors are usually allowed, in so far as it is evident that an error has occurred and what the correction should be. The request for correction has to be made without undue delay after the error has been discovered (G 1/12, J 16/08). However, correction of errors in the description, claims and drawings is a special form of amendment and is bound by Art. 123(2) (G 2/95; see also H-VI, 2.2.1). These errors can be corrected as set out below.",
                    "subsections": {
                        "2.2.1": {
                            "content": "Correction of description, claims and drawings Where the mistake is in the description, claims or drawings, both the error and the correction must be such that it is immediately evident: (i) that an error has occurred; and (ii) what the correction should be. Regarding (i), the incorrect information must be objectively recognisable for a skilled person, using common general knowledge, from the originally-filed application documents (description, claims and drawings) taken by themselves. Regarding (ii), the correction needs to be within the limits of what a skilled person would derive directly and unambiguously, using common general knowledge, and seen objectively and relative to the date of filing, from the originally-filed application documents. In other words, the requirements of Art. 123(2) apply mutatis mutandis. Evidence of what was common general knowledge on the date of filing may be furnished in any suitable form. The priority documents cannot be used for the purposes mentioned under (i) and (ii) above (see G 3/89 and G 11/91). Correction under Rule 139, second sentence, is of a strictly declaratory nature and establishes what a skilled person, using common general knowledge, would derive on the date of filing from the parts of a European patent application, seen as a whole, relating to the disclosure (see G 3/89 and G 11/91 mentioned above). Therefore, the complete replacement of the application documents (i.e. description, claims and drawings) by other documents is not possible (see G 2/95). Some examples of allowable corrections: (I) The replacement of \"respectfully\" by \"respectively\" in a claim (T 34/03). (II) The addition of the plural \"s\" to the word \"particle\" as the corresponding verb \"have\" was in the plural form, and the application as originally filed described a particle size distribution. Since particle size distributions can be defined only for a plurality of particles, the correction was held allowable (T 108/04). On the other hand, the applicant/proprietor cannot rely on: (a) A mere count of the number of instances of the relevant words in the application as originally filed for obtaining the replacement of one word by another word, for instance the substitution of \"included\" for \"excluded\", if it is not clear that an error has occurred and not possible to ascertain that nothing other than \"included\" was intended by the drafter (T 337/88). (b) Usual practice or industry standards for measuring concentrations of compounds in the relevant technical field, if the application as originally filed merely refers to \"%\", without clarification as to whether by weight or volume, and the description contains no clear guidance as to whether \"%\" refers to concentration by % by weight or % by volume or something different (T 48/02). (c) Common general knowledge in the absence of further evidence, such as an encyclopaedia or basic textbook, to argue for instance that the skilled person would have immediately recognised that an ASTM standard with a six-digit number did not exist before the priority date of a patent (T 881/02)."
                        },
                        "2.2.2": {
                            "content": "Missing parts of description, missing drawings or correction of erroneously filed application documents filed as corrections under Rule 139 The applicant may also request that missing parts of the description and/or missing drawings be included in the application documents by way of a correction according to Rule 139. In virtually all cases this will not be possible (see J 1/82). Similarly, it is not generally possible to completely replace erroneously filed application documents (description, claims or drawings) or parts by way of a correction under Rule 139 because that would require making it evident that nothing else was intended than what is offered as the corrected application documents. In extremely rare cases the other application documents might allow the skilled person to reconstruct the missing parts of the description and/or missing drawings such that they may be filed by way of a correction according to Rule 139. In contrast to missing parts of the description and/or missing drawings filed under Rule 56(3) and correct application documents subsequently filed under Rule 56a(4), corrections under Rule 139 can never be substantiated by merely referring to the priority document (see H-VI, 2.2.1)."
                        }
                    }
                }
            },
            "content": " However, see also A-VII, 7 for the correction of errors in a translation of a patent application, A-III, 5.5 for the correction of the designation of inventor and A-III, 6.5.2 for the correction/addition of a priority claim. Requests for correction under Rule 139 are dealt with by the department responsible for the proceedings: (i) In examination and opposition proceedings, the correction of errors under Rule 139 is the responsibility of the formalities officer, with the exception of errors in the description, claims and drawings (see the decision of the President of the EPO dated 12 December 2013, OJ EPO 2014, A6, Art. 1, point 22, and Art. 2, point 21). (ii) Where the Receiving Section is responsible (Rule 10(1)), it decides on requests for correction unless the request requires technical examination. In the latter case, the examining division will decide on the request once it has assumed responsibility (see J 4/85)."
        },
        "3. ": {
            "title": "Correction of errors in decisions Correction of errors in decisions under Rule 140 must be clearly distinguished from correction of errors in documents filed by the applicant",
            "subsections": {
                "3.1": {
                    "content": "Admissibility Rule 140 is not available to correct errors in documents filed by a patent applicant or proprietor (G 1/10). The correction of such documents is admissible only under Rule 139 and only as long as proceedings are pending (see H-VI, 2.1). Once the decision to grant is handed over to the EPO's internal postal service (G 12/91), only errors in bibliographic data, printing errors in the publication of the patent specification and formatting/editing errors may be corrected (see H-VI, 3.2 and H-VI, 3.3). Since the final responsibility for the text of the patent lies with applicants or patentees, it is their duty to properly check all the documents making up the communication under Rule 71(3) (i.e. Form 2004 and the Druckexemplar). The same applies to documents as proposed for maintenance in amended form (see Rules 71(5), 82(1) and 95(2), Art. 113(2) and G 1/10). However, requests for correction under Rule 139 of documents on which the patent is granted may under certain conditions be submitted in opposition and limitation proceedings (see H-VI, 2.1.1). Corrections of decisions are to be made at the reasoned request of one of the parties or by the EPO of its own motion. If the request for correction is refused, this decision must be reasoned (see T 850/95). These reasons must previously have been communicated to the requester (Art. 113(1))."
                },
                "3.2": {
                    "content": "Allowability of the correction of bibliographic data The sole reason for allowing the correction of linguistic errors, errors of transcription and obvious mistakes is to ensure that the decision says what the division actually intended at the time of issue. If the bibliographic data referred to in the examining division's decision to grant or limit a patent or in the opposition division's communication under Rule 82(2) that a decision to maintain a patent in amended form has become final is not and obviously cannot be the bibliographic data corresponding to the real intention of the division, the bibliographic data erroneously indicated can be corrected under Rule 140. In this respect, it is irrelevant whether the error was originally introduced by the applicants in their submissions or by the division itself. In particular, misspellings or similar errors in the name of the patent proprietor may be corrected under Rule 140 wherever it does not result in the designation of a person different than the one originally named on filing (or their successor in title) and to whom the examining division intended to grant the patent. In accordance with the decision of the President of the EPO dated 23 November 2015 (OJ EPO 2015, A104), requests for the correction of errors in bibliographic data are dealt with by formalities officers."
                },
                "3.3": {
                    "content": "Correction of the decision to grant while opposition proceedings are pending – procedural aspects Even during opposition proceedings, the examining division is competent to correct errors in its decision to grant, in particular errors in the decision's reasoning and bibliographic data, or formatting/editing errors in the text of the B1 publication (see H-VI, 3.2 and H-VI, 4). Thus the opposition division refers to the examining division any request under Rule 140 to correct such errors filed by the patent proprietor while opposition proceedings are pending. However, if the request for correction under Rule 140 is clearly inadmissible, i.e. the requested correction does not concern errors in bibliographic data contained in the decision to grant or formatting/editing errors in the text of the B1 publication, the opposition division continues the proceedings until the decision under Art. 101 is taken without waiting for closure of the proceedings before the examining division concerning the correction (in line with the reasoning of G 1/10). The procedural decision to continue the proceedings is appealable together with the opposition decision. If the request for correction is admissible, the examining division processes it without delay in order to minimise or avoid delays to the opposition proceedings. The opposition division may wait for closure of the proceedings before the examining division."
                }
            },
            "content": " (or patentee) pursuant to Rule 139. For the latter, see A-V, 3 and H-VI, 2 and subsections. Correction of errors made by the applicant (or patentee) in application (or patent) documents cannot be arrived at in a roundabout manner through correction of the decision to grant (or to maintain in amended form). Correction of a decision is allowable only if the text of the decision is manifestly other than intended by the department concerned. An error in the text of the patent that forms the basis for the decision cannot be imputed to the division by suggesting that the division did not intend to make a decision that in fact included the very text approved by the applicant (or patent proprietor) himself as a means of bringing the error within the ambit of Rule 140. Thus only linguistic errors, errors of transcription and obvious mistakes in decisions can be corrected. The correction of an error in a decision under Rule 140 has a retrospective effect (see T 212/88). Therefore, when the decision to be corrected is the refusal of the application or the revocation of the patent, the time limit for filing a notice of opposition or an appeal is not changed by the publication or the notification of the corrected decision. The competence to correct errors under Rule 140 lies with the body which took the decision (see e.g. G 8/95, J 12/85, J 16/99). Hence, even during opposition (or appeal) proceedings, the examining division is competent to correct errors in bibliographic data contained in the decision to grant (see H-VI, 3.3). Examining or opposition divisions are competent to correct errors in the text of the patent that was the subject of their respective decisions, including editing/formatting errors (see H-VI, 4)."
        },
        "4. ": {
            "title": "Correction of formatting/editing errors Formatting/editing errors which were already contained in the text approved by the applicant may be corrected by the EPO of its own motion or at the request of the patent proprietor. Formatting/editing errors are alterations in the patent documents which occur during the preparation of the Druckexemplar and which are indicated neither by standard marks nor in Form 2004.",
            "subsections": {},
            "content": " Example 1 In the Druckexemplar, page 10 contains two changes: − the first change is indicated with standard marks; − the second change is in a different paragraph on page 10 to the first change, and consists in the absence of the two top lines, but the deletion is not indicated by any standard mark (i.e. the two lines have just disappeared). After publication of the grant, the applicant spots the errors and requests: (a) the correction of a spelling error in the first change introduced by the examining division; (b) the re-insertion of the top two lines that have disappeared. Request (a) cannot be accepted, as the error is in the marked change. However, request (b) regarding the second change is a formatting/editing error. Thus, the request to reinstate the two top lines can be granted. Example 2 EPO Form 2004 indicates inter alia page 10 as amended by the examining division; other pages of the description have been amended. In the Druckexemplar, page 10 as originally filed is present; no amendments are present. In this case, the amendment is indicated in EPO Form 2004 so that the error does not qualify as a formatting/editing error. Thus, no correction can be made after issuance of the decision to grant. If any correction in the text of the specification as published is allowed, a corrected version of it will be published. However, such a correction has no influence on the start of the opposition period. In the case of a discrepancy between the Druckexemplar and Form 2004, the patent proprietor can seek remedy by filing an appeal against the decision to grant. This would apply to example 2 above. The situation is different to that of errors already present in the application documents or in any of the amended application documents submitted by the applicant. An error introduced by the applicant does not qualify as a formatting/editing error. A request for correction will not be accepted and the situation cannot be remedied by an appeal."
        },
        "5. ": {
            "title": "Correction of the translations of the claims According to Art. 70(1), the text of a patent in the language of the proceedings is the authentic text. It therefore follows that the translations of the claims of the patent specification required by Art. 14(6) are for information only. Hence no examination of the translations takes place",
            "subsections": {},
            "content": " (C-V, 1.3); in particular, the translations do not form part of the decision to grant the patent. Therefore they cannot be corrected under Rule 140, either. However, if when a corrected version of a translation of the claims is received, the stage of preparations for the B publication still allows the exchange of documents, the EPO will publish the corrected version instead of the original version of the translation. Where corrected translations of claims are not submitted to the EPO in time to be taken into account for the B publication, the only possibilities for the patent proprietor to amend them are when the patent is maintained in amended form (Rule 82(2)) or, as indicated in Art. 70(4), before a national authority."
        },
        "6. ": {
            "title": "Errors in publication Errors in publication occur where the content of the printed specification differs from the documents (Druckexemplar) transmitted to the applicant with the communication under Rule 71(3) (Form 2004), if these documents form the basis of the decision to grant.",
            "subsections": {},
            "content": " Errors in publication have to be distinguished from changes introduced in the text to be granted after the applicant's approval but before the decision to grant (G 1/10). In such cases, the patent proprietor has to file an appeal to seek remedy. The above errors in publication can be corrected at any time (see also C-V, 10). The same applies mutatis mutandis to errors in the process for publication of the application and of the amended patent specification following a decision to maintain the patent as amended. The competence to correct errors in publication lies with the body before which proceedings are or were last pending. Therefore a request for correction of errors in the publication of the B1 specifications filed during opposition proceedings is dealt with by the opposition division. Formalities officers are responsible for the correction of publication errors (see the decision of the President of the EPO dated 23 November 2015, OJ EPO 2015, A104)."
        }
    }
}