{
    "Chapter II – The opposition division": {
        "1. ": {
            "title": "Administrative structure Each opposition division is assigned to an EPO directorate dedicated to conducting opposition proceedings.",
            "subsections": {}
        },
        "2. ": {
            "title": "Composition",
            "subsections": {
                "2.1": {
                    "content": "Technically qualified members An opposition division consists of three technically qualified members, at least two of whom must not have taken part in the proceedings for grant of the patent to which the opposition relates. Participation in the proceedings for grant of the patent to which the opposition relates includes, in particular, performing a procedural act such as issuing a communication or signing a summons to oral proceedings. However, participation in the proceedings of a patent family member, e.g. a parent or priority application of the opposed patent, is not considered as participation in the proceedings for grant of the patent to which the opposition relates for the purposes of Art. 19(2)."
                },
                "2.2": {
                    "content": "Legally qualified members If the opposition division considers that the nature of the decision so requires, it is enlarged by the addition of a legally qualified member who has not taken part in the proceedings for grant. The principles established for inclusion of a legally qualified member and for consultation of the Directorate Patent Law, the department responsible for providing legally qualified members for examining and opposition divisions, by the examining division apply mutatis mutandis to the opposition division (see C-VIII, 7). Difficult legal questions may also arise during the examination as to whether an opposition is to be rejected as inadmissible. In addition, consultation of a legally qualified member is to be envisaged in cases where it is questionable whether or not a disclosure by means other than a document was made available to the public."
                },
                "2.3": {
                    "content": "Chair The chair must be a technically qualified member who has not taken part in the grant proceedings (see D-II, 2.1)."
                }
            }
        },
        "3. ": {
            "title": "Allocation of duties and appointment of members of the opposition division C-II, 2 applies mutatis mutandis.",
            "subsections": {}
        },
        "4. ": {
            "title": "Tasks of the opposition divisions",
            "subsections": {
                "4.1": {
                    "content": "Examination of oppositions The opposition divisions are responsible for the examination of oppositions against European patents. The examination of newly submitted documents for compliance with physical requirements will essentially be the task of the competent formalities officers (see D-II, 7, A-I, 2, A-III, 3.2 and C-VIII, 1)."
                },
                "4.2": {
                    "content": "Decision concerning the awarding of costs by the opposition division The opposition division will decide on requests to have the costs fixed by the formalities officer reviewed (see D-II, 7 and D-IX, 2.1)."
                },
                "4.3": {
                    "content": "Ancillary proceedings It will be incumbent upon the opposition division to conduct ancillary proceedings arising in the course of opposition proceedings. Such ancillary proceedings may for example concern a request for re-establishment of rights in respect of a time limit which was not observed vis-à-vis the EPO during the opposition proceedings, a request for a decision concerning a finding arrived at by the formalities officer that a right has been lost or a request for exclusion from file inspection. Additional tasks may be entrusted to the opposition divisions by the President of the EPO in accordance with Rule 11(2). As regards exclusion from file inspection pursuant to Rule 144 in conjunction with the decision of the President of the EPO dated 12 July 2007, Special edition No. 3, OJ EPO 2007, J.3, reference is made to A-XI, 2.1. Documents having a substantive and/or procedural bearing on opposition proceedings can only exceptionally be excluded from file inspection (T 1691/15). Communications dealing with a request for exclusion from file inspection are excluded from file inspection and are issued separately from communications dealing with other issues. Depending on its content, a document (provisionally) excluded from file inspection and any communication concerning a request for its exclusion from file inspection may be forwarded to the other party or parties (Rule 81(2)). As the public must be informed of the grounds prejudicing or supporting the maintenance of an opposed patent, only documents, or parts thereof, not (provisionally) excluded from file inspection can be used as evidence to prove or to refute a ground for opposition. If a party requests that the EPO excludes an otherwise public nonpatent literature document from file inspection for reasons of copyright, the opposition division will interpret this as a request not to make the document available to third parties in the public part of the file. This request, in the above interpretation, is normally granted if the copyright of the document in question is not owned by a party to the proceedings and the document in question is relatively easily retrievable including against payment. For example, a scientific article is usually easily retrievable, and its copyright is assigned to the editor. In contrast, a third-party company brochure is not easily retrievable. If the copyright of such company brochure is owned by a party to the proceedings, the request is refused by the opposition division and the document is made available via file inspection. Where the request not to make a document available via file inspection for reasons of copyright is acceded to by the opposition division, the page(s) carrying the bibliographic details of the non-patent literature document (normally the cover page) will nonetheless be made available via file inspection in order to ensure that members of the public are in a position to retrieve the entire document. The nonpatent literature document is not considered as being excluded from file inspection within the meaning of Rule 144 and can be used as evidence in the opposition proceedings."
                }
            }
        },
        "5. ": {
            "title": "Allocation of tasks to members An opposition division will normally entrust one of its members with the examination of the opposition, but not with the conduct of oral proceedings, up to the time of the final decision on the opposition (see also D-IV, 2). If need be, the same member may also be entrusted with the examination of the evidence adduced (see E-IV, 1.3). This member will be referred to as the first member.",
            "subsections": {}
        },
        "6. ": {
            "title": "Duties and powers of members The first member will conduct the examination of the opposition. If oral proceedings have been requested, they are normally arranged as first action, possibly in conjunction with the taking of evidence (see E-III, 1",
            "subsections": {},
            "content": " to E-III, 4 and E-IV, 1.6.1). The first member will prepare the communication accompanying the summons to oral proceedings and submit it to the other members. If the first member considers that communications to the parties preceding the summons for oral proceedings are necessary, these communications will be submitted to the opposition division before despatch. If there are differences of opinion within the opposition division, the first member will confer with the other members to discuss the points at issue. The chair will preside at the meeting and, following a discussion, will take a vote on the decision or the further course of the procedure. Voting will be on the basis of a simple majority. In the event of parity of votes, the vote of the chair of the division is decisive. Any further measures necessary will as a rule be entrusted to the first member. If no further measures are necessary, the first member will draft a decision on the opposition and will distribute the draft to the other members of the opposition division for examination and signature. If any changes are proposed by a member and there are differences of opinion on such changes, the chair must arrange a meeting. Where reference is made hereinafter to the opposition division, this is to be taken to mean the first member where such a member has been appointed and in so far as the EPC entitles an opposition division member to act alone."
        },
        "7. ": {
            "title": "Allocation of individual duties The President of the EPO may entrust to employees who are not technically or legally qualified the execution of individual duties falling to the examining divisions or to the opposition divisions and involving no technical or legal difficulties. In so far as such duties affect the public, their allocation will be notified in the Official Journal of the EPO (see decisions of the President of the EPO dated 12 December 2013, OJ EPO 2014, A6, and",
            "subsections": {},
            "content": " 23 November 2015, OJ EPO 2015, A104). The formalities officers entrusted with these duties are also in charge of fixing the amount of the costs (see D-IX, 2.1)."
        }
    },
    "Chapter III – Opposition": {
        "1. ": {
            "title": "Time allowed for filing notice of opposition Within nine months from the publication of the mention of the grant of the European patent, notice of opposition has to be given to the EPO in Munich, The Hague or Berlin.",
            "subsections": {},
            "content": " For expiry of the time limit see E-VIII, 1.4. Re-establishment of rights in respect of unobserved time limits for opposition is not possible in the case of an opponent (see, however, E-VIII, 3.1.2)."
        },
        "2. ": {
            "title": "Opposition fee The amount of the opposition fee specified in the Rules relating to Fees under the EPC must be paid before expiry of the time limit for opposition.",
            "subsections": {},
            "content": " An opposition filed in common by two or more persons, which otherwise meets the requirements of Art. 99 and Rules 3 and 76, is admissible on payment of only one opposition fee (see G 3/99). As regards the legal consequences and the procedure where the fee is not paid in good time, see D-IV, 1.2.1(i) and 1.4.1."
        },
        "3. ": {
            "title": "Submission in writing",
            "subsections": {
                "3.1": {
                    "content": "Form of the opposition The notice of opposition must be filed in writing and must be typewritten or printed, with a margin of about 2.5 cm on the left-hand side of each page. It would be appropriate if the notice of opposition also satisfied the requirements laid down in Rule 49(2) in conjunction with the decision of the President of the EPO dated 25 November 2022 (OJ EPO 2022, A113)."
                },
                "3.2": {
                    "content": "Notices of opposition filed electronically Notice of opposition may, without prejudice to other means of filing, be filed in electronic form using EPO Online Filing (OLF) or Online Filing 2.0 . However, it may not be filed using the EPO webform filing service (OJ EPO 2021, A42)."
                },
                "3.3": {
                    "content": "Notices of opposition filed by fax Notice of opposition may also be filed by fax (see the decision of the President of the EPO dated 20 February 2019, OJ EPO 2019, A18). At the invitation of the EPO, written confirmation reproducing the contents of the fax and complying with the requirements of the Implementing Regulations - in particular properly signed – must be supplied. If the opponent fails to comply with this invitation in due time, the fax is deemed not to have been received (see A-VIII, 2.5). The opposition fee must in any case be paid within the opposition period."
                },
                "3.4": {
                    "content": "Signature of the notice of opposition The notice of opposition must be signed by the person responsible, i.e. by the opponent or, where appropriate, by the representative (see also D-IV, 1.2.1(ii), and A-VIII, 1). Initials or other abbreviated forms will not be accepted as a signature. Where the notice of opposition is filed in electronic form, the signature may take the form of a facsimile signature or a text string signature (i.e. a type- written signature that is preceded and followed by a forward slash (/)). Where EPO Online Filing is used, the signature may also take the form of an enhanced electronic signature (see OJ EPO 2023, A48). Where the notice of opposition is filed by fax, the reproduction on the facsimile of the signature of the person filing the notice of opposition will be considered sufficient. If the signature is omitted, the formalities officer must request the party, or where appropriate the representative, to affix their signature within a time limit to be laid down by the formalities officer. If signed in due time, the document retains its original date of receipt; otherwise, it is deemed not to have been received (see D-IV, 1.2.1(ii) and 1.4.1)."
                }
            }
        },
        "4. ": {
            "title": "Derogations from language requirements Derogations from language requirements for written opposition proceedings are dealt with in A-VII, 3 (for documents filed as evidence, see A-VII, 3.4)",
            "subsections": {},
            "content": " and for oral opposition proceedings in E-V."
        },
        "5. ": {
            "title": "Grounds for opposition A written reasoned statement of the grounds for opposition must be filed within the opposition period.",
            "subsections": {},
            "content": " Opposition may only be filed on the grounds that: (i) the subject-matter of the European patent is not patentable under Art. 52 to 57, because it - is not new (Art. 52(1), 54, 55), - does not involve an inventive step (Art. 52(1), 56), - is not susceptible of industrial application (Art. 52(1), 57), - is not regarded as an invention under Art. 52(1) to (3), or - is not patentable under Art. 53; (ii) the European patent does not disclose the invention in a manner sufficiently clear and complete for it to be carried out by a person skilled in the art (see Art. 83); (iii) the subject-matter of the European patent extends beyond the content of the application as filed (see Art. 123(2)) or, if the patent was granted on a divisional application or on a new application filed under Art. 61 (new application in respect of the invention by the person adjudged in a final decision to be entitled to the grant of a European patent), beyond the content of the earlier application as filed (see Art. 76(1)). (See also D-V, 3, D-V, 4 and D-V, 6). Note that each single condition mentioned above forms an individual legal basis for objection to the maintenance of the patent. Consequently, each such condition is to be regarded as a separate ground for opposition (see G 1/95 and G 7/95). The following allegations, for example, do not constitute grounds for opposition: that national rights of earlier date exist which put the patentability of the invention in question (see, however, H-III, 4.4), that the patent proprietor is not entitled to the European patent, that the subject-matter of the patent lacks unity, that the claims are not supported by the description (unless it is also argued that the claims are so broadly worded that the description in the specification does not sufficiently disclose the subject-matter within the meaning of Art. 100(b)), that the form and content of the description or drawings of the patent do not comply with the provisions as to formal requirements as set forth in Rules 42 and 49(2) in conjunction with the decision of the President of the EPO dated 25 November 2022 (OJ EPO 2022, A113), or that the designation of the inventor is incorrect. Nor does the simple allegation that priority has been wrongly claimed constitute a ground for opposition. However, the matter of priority must be subjected to a substantial examination in the course of opposition proceedings if prior art is invoked in connection with a ground for opposition under Art. 100(a) in relation to which the priority date is of decisive importance (see G-IV, 3 and F-VI, 2)."
        },
        "6. ": {
            "title": "Content of the notice of opposition The notice of opposition, filed in a written reasoned statement, must contain:",
            "subsections": {},
            "content": " (i) the name, address and nationality of the opponent and the state in which the opponent's residence or principal place of business is located. Names of natural persons must be indicated by the person's family name and given name(s), the family name being indicated before the given name(s). Names of legal entities, as well as companies considered to be legal entities by reason of the legislation to which they are subject, must be indicated by their official designations. Addresses must be indicated in such a way as to satisfy the customary requirements for prompt postal delivery at the indicated address. They must comprise all the relevant administrative units, including the house number, if any. Opponents (whether natural or legal persons) whose residence or principal place of business is in an EPC contracting state and who act without a professional representative can use an address for correspondence other than their residence. The address for correspondence must be the opponent's own address. Post cannot be sent to a different (natural or legal) person, since that requires a valid form of representation under Art. 133 and Art. 134. It is recommended that the telephone number be indicated (see D-IV, 1.2.2.2(i) and D-IV, 1.4.2); (ii) the number of the European patent against which opposition is filed, the name of the patent proprietor and the title of the invention (see D-IV, 1.2.2.2(ii) and 1.4.2); (iii) a statement of the extent to which the European patent is opposed and of the grounds on which the opposition is based as well as an indication of the facts and evidence presented in support of these grounds (see D-IV, 1.2.2.1(iii) to 1.2.2.1(v) and 1.4.2). The requirement under Rule 76(1) that notice of opposition must be filed in a written reasoned statement also implies presenting arguments. However, in order to streamline opposition procedure, it is recommended that a single copy of any written evidence be submitted as soon as possible and ideally with the notice of opposition (see D-IV, 1.2.2.1(v), last two paragraphs); (iv) if the opponent has appointed a representative, the representative's name and address of place of business in accordance with the provisions of subparagraph (i) as set out above (see D-IV, 1.2.2.2(iii) and 1.4.2). D-IV, 1 sets out further details and explains how to deal with the opposition if one of these requirements is not fulfilled."
        }
    },
    "Chapter IV – Procedure up to substantive examination": {
        "1. ": {
            "title": "Examination for deficiencies in the notice of opposition and communications from the formalities officer arising from this examination",
            "subsections": {
                "1.1": {
                    "content": "Forwarding of the notice of opposition to the formalities officer The notice of opposition must be forwarded directly to the formalities officer, who then places it in the electronic file of the European patent concerned in accordance with the relevant administrative instructions and communicates it without delay to the patent proprietor for information. If a notice of opposition is received prior to the publication of the mention of the grant of the European patent, the formalities officer informs the senders that their document cannot be treated as an opposition. This document becomes part of the file and, as such, is also available for inspection under Art. 128(4), and is brought to the attention of the applicant or the patent proprietor as an observation by a third party in accordance with Art. 115 (for details, see E-VI, 3). If an opposition fee has been paid, it will in this case be refunded. Examinations, observations, communications and, where appropriate, invitations to the parties will be the responsibility of the formalities officer who has been entrusted with this task of the opposition division (see D-II, 7)."
                },
                "1.2": {
                    "content": "Examination for deficiencies in the notice of opposition After notice of opposition has been given, the formalities officer examines whether any deficiencies exist.",
                    "subsections": {
                        "1.2.1": {
                            "content": "Deficiencies which, if not remedied, lead to the opposition being deemed not to have been filed The following deficiencies fall into this category: (i) the opposition fee or a sufficient amount of the fee has not been paid within the opposition period (Art. 99(1); see also G 1/18). However, if the opposition fee, apart from a small amount (e.g. deducted as bank charges), has been paid within the opposition period, the formalities officer examines whether the amount lacking can be overlooked where this is justified. If the formalities officer concludes that the amount lacking can be overlooked, the opposition fee is deemed to have been paid and there is no deficiency in the present sense; (ii) the document giving notice of opposition is not signed and this is not rectified within the period set by the formalities officer, which is fixed at two months as a rule (see E-VIII, 1.2) (Rule 50(3)). It is noted that for cases covered by Art. 133(2) (see also D-IV, 1.2.2.2(iv)) a professional representative first has to be appointed within the prescribed time limit. The above applies if the appointed representative then fails to remedy such deficiency either by signing the notice or by approving it in writing; (iii) where a notice of opposition is filed by fax and written confirmation reproducing the contents of the fax, if requested by the formalities officer, is not supplied in due time (Rule 2(1) and decision of the President of the EPO dated 20 February 2019, OJ EPO 2019, A18); (iv) where a notice of opposition is filed by the representative or employee of an opponent, and the authorisation, if any is required (see A-VIII, 1.5 and the decision of the President of the EPO dated 12 July 2007, Special edition No. 3, OJ EPO 2007, L.1), is not supplied in due time (Rule 152(1) to (3) and (6)); and (v) the opposition is submitted within the opposition period but not in an official language of the EPO, as specified in Rule 3(1), or if Art. 14(4) applies to the opponent, the translation of the elements referred to in Rule 76(2)(c) is not submitted within the opposition period (see also A-VII, 2, G 6/91 and T 193/87). This period is extended where the one-month period as required under Rule 6(2) expires later. This deficiency is present if the opposition is not filed in English, French or German or if, for example, an opponent from Belgium files an opposition in time in Dutch but fails to file the translation of the essential elements into English, French or German within the abovementioned time limits. For oppositions which, upon submission, are deemed not to have been filed because of deficiencies as described above, see the further procedure as described in D-IV, 1.3.1, 1.3.3 and 1.4.1."
                        },
                        "1.2.2": {
                            "content": "Deficiencies which, if not remedied, lead to the opposition being rejected as inadmissible Only such oppositions as are deemed to have been filed will be examined for deficiencies under Rule 77(1) and (2). If the formalities officers are not sure whether the opposition in question contains a deficiency under Rule 76(2)(c), they will submit the file to the opposition division for checking. They will do this in particular if the opposition alleges non-patentability under Art. 52, 54 or 56 and the relevant prior art has been made available to the public by means other than by written description, or if taking of evidence has been requested in accordance with Rule 117. In this connection the opposition division will also examine the extent to which it is necessary for the formalities officer to request the opponent to submit evidence (see D-IV, 1.2.2.1(v)). 1.2.2.1 Deficiencies under Rule 77(1) The following deficiencies fall into this category: (i) the notice of opposition is not filed in writing with the EPO in Munich or its branch at The Hague or its suboffice in Berlin within the nine- month opposition period, calculated from the date of publication of the mention of the grant of the European patent in the European Patent Bulletin (Art. 99(1)); Accordingly, the opposition is deficient if, for example, notice of opposition is submitted to the EPO belatedly, i.e. after expiry of the nine-month period, or where the opposition is notified within the opposition period but only verbally in a telephone call officially noted in the files. This category of deficiency also includes oppositions which, notwithstanding Art. 99(1), are filed with the central industrial property office of a contracting state or an authority thereunder and not forwarded by these offices either at all or in time for them to be received by the EPO before the expiry of the opposition period. There is no legal obligation upon these offices or authorities to forward oppositions to the EPO. (ii) the notice of opposition does not provide sufficient identification of the European patent against which opposition is filed; Such a deficiency exists if the EPO is unable to identify the relevant patent on the basis of the particulars in the notice of opposition; for example, if only the proprietor of the contested patent and perhaps the title of the invention for which the patent was granted are mentioned in the notice of opposition. Such particulars alone are not an adequate description of the contested European patent, unless the patent proprietor who alone is named possesses only one patent or possesses several patents, the subject-matter of only one of which fits the title of the invention given in the notice of opposition, being clearly distinct from the subject-matter of the other patents which this proprietor holds. A mere indication of the number of the contested European patent in the notice of opposition constitutes sufficient identification of the patent concerned, provided that no conflicting information is given, e.g. an inconsistent name for the patent proprietor, and the conflict cannot be resolved from the information given. (iii) the notice of opposition contains no statement of the extent to which the European patent is opposed; Such a deficiency is present if it is not clear from the requisite statement whether the opposition is directed against the entire subject-matter of the patent or only a part of it, i.e. whether it is directed against all the claims or only against one or a part of one claim, such as an alternative or embodiment; (iv) the notice of opposition contains no statement of the grounds on which the opposition is based; A notice of opposition contains such a deficiency if it does not mention at least one of the grounds for opposition referred to in Art. 100 (see D-III, 5). If non-patentability is given as a ground for opposition, the statement of grounds must at least implicitly indicate which conditions for patentability (Art. 52 to 57) are considered not to have been fulfilled. (v) the notice of opposition is not adequately substantiated; According to Rule 76(2)(c), a notice of opposition has to contain a statement of the extent to which the European patent is opposed, the grounds on which the opposition is based, as well as an indication of the facts and evidence presented in support of these grounds for opposition. The wording of Rule 76(2)(c) clearly indicates that there is a difference between the grounds for opposition, i.e. the legal basis for revocation of the patent (e.g. Art. 100(a)), and the facts and evidence presented in support of these grounds. Where the facts and evidence are entirely absent or so vague as not to allow a proper understanding of the case, the opposition is considered to contain only a mere allegation, which is not sufficient to render the opposition admissible. Therefore, the opponent has to substantiate the grounds for opposition by adducing facts, evidence and arguments for at least one of those grounds. The opponent has to establish the legal and factual framework on which the opposition rests to pave the way for a substantive assessment. As a consequence, the division and the patent proprietor need to be able to understand, without further investigation of their own, the issues that need to be decided. It is not necessary for the admissibility of the opposition that a final decision can be taken without further investigation. In other words, it is not a question of admissibility but of substantive examination whether the facts on which the opponent relies in comprehensibly explaining a ground for opposition are or can be proven. Where the grounds comprise an allegation of a prior use or an oral disclosure prior to the date of filing or the priority date, the opposition division must be supplied with an indication of the facts, evidence and arguments necessary to determine (a) the date on which the alleged use occurred (\"when\"), (b) what was used (\"what\"), (c) and the circumstances relating to the use (\"where, how, by whom\") (G-IV, 7.2 and 7.3). Where there are multiple grounds for opposition, if the facts, evidence and arguments for one ground are sufficiently indicated, the opposition is admissible even if the facts, evidence and arguments in support of the other grounds are submitted belatedly. Such belated facts, evidence and arguments are in that event dealt with in accordance with E-VI, 2. Owing to the length of the opposition period (nine months), however, in order to expedite the opposition proceedings, it is recommended that a single copy of any written evidence indicated in the notice of opposition be submitted as soon as possible and ideally with the notice of opposition. Otherwise, if the opposition is admissible, the opponent will be invited to supply such evidence as soon as possible and as a rule within two months. If the documents thus requested are neither enclosed nor filed within the time limit set, the opposition division may decide not to take into account any arguments based on them. (As regards facts or evidence not submitted in due time and arguments presented at a late stage see E-VI, 2). As far as the admissibility of an opposition is concerned, it is immaterial whether and to what extent the facts, evidence and arguments submitted in due time actually warrant revocation of the contested European patent or its maintenance in amended form. On the one hand, an unconvincing ground for opposition may have been substantiated (making the opposition admissible), whereas on the other hand a deficient submission may have been rejected as inadmissible even though, if properly drafted, it could have succeeded (see also T 222/85). The substantiation of the grounds for opposition thus has to be clearly distinguished from the actual assessment of the evidence, which is part of the process of ascertaining whether the opposition is well-founded in substance, i.e. proven. Subject to the admissibility of the opposition, this has to be established by the opposition division in the light of the applicable standard of proof (G-IV, 7.5.2). (vi) the opposition does not indicate beyond any doubt the identity of the person filing the opposition (Art. 99(1) and Rule 76(2)(a)). 1.2.2.2 Deficiencies under Rule 77(2) The following deficiencies fall within this category: (i) the notice of opposition does not specify the name, address and nationality of the opponent and the state in which the opponent's residence or principal place of business is located in the prescribed manner (see D-III, 6(i)); (ii) the number of the European patent against which the opposition is filed or the name of the patent proprietor or the title of the invention is not indicated; Each of the particulars listed in (ii) above must be supplied within the time limit set by the formalities officer (see D-IV, 1.3.2), even if the contested European patent may be identified by means of one of these or other particulars within the opposition period (see D-IV, 1.2.2.1(ii)). If the name of the patent proprietor as indicated by the opponent is not the same as that recorded in the Register, the formalities officer will inform the opponent of the patent proprietor's correct name. (iii) where the opponent has appointed a representative, the name or the address of the place of business of such representative is not indicated in the notice of opposition in the prescribed manner (see D-III, 6(iv)); (iv) the opponent has neither residence nor principal place of business in one of the contracting states (Art. 133(2)) and has not communicated the appointment of a professional representative (Art. 134). In the communication requesting remedy of such deficiency the opponent must also be asked to arrange for the signature or approval of the notice of opposition by the representative to be appointed; and (v) the notice of opposition fails to satisfy further formal requirements other than those mentioned in Rule 77(1). For instance, it may fail to comply with the provisions of Rule 50(2) without due justification."
                        }
                    }
                },
                "1.3": {
                    "content": "Issue of communications by the formalities officer as a result of examination for deficiencies If, in the course of the examination as described in D-IV, 1.2, formalities officers note deficiencies which may still be remedied, and if there are no deficiencies which may no longer be remedied (in the case of deficiencies which may no longer be remedied see D-IV, 1.4), they will issue the communications described in D-IV, 1.3.1 and/or 1.3.2 to the opponent, if possible in a single communication.",
                    "subsections": {
                        "1.3.1": {
                            "content": "Communication in the event of deficiencies as described in D-IV, 1.2.1 which, if not remedied, will lead to the opposition being deemed not to have been filed The communication will indicate the deficiencies noted in accordance with D-IV, 1.2.1 and will state that the opposition will be deemed not to have been filed unless the deficiency or deficiencies are remedied within the time limits indicated in D-IV, 1.2.1."
                        },
                        "1.3.2": {
                            "content": "Communication in the event of deficiencies as described in D-IV, 1.2.2 which, if not remedied, will lead to rejection of the opposition as inadmissible The communication will indicate the deficiencies noted in accordance with D-IV, 1.2.2.1 or 1.2.2.2 and will state that the opposition will be rejected as inadmissible unless the deficiencies as described in D-IV, 1.2.2.1 are remedied within the opposition period and unless the deficiencies as described in D-IV, 1.2.2.2 are remedied within the period stipulated by the formalities officer."
                        },
                        "1.3.3": {
                            "content": "Extent of the formalities officer's obligation to issue the above communications Although formalities officers are not obliged to do so, they may notify the opponent of deficiencies as described in D-IV, 1.2.1(i) and D-IV, 1.2.2.1 in good time before the expiry of the time limits within which it is still possible to remedy the deficiencies. However, the opponent can seek no legal remedy against failure to issue these communications, which is to be regarded merely as a service afforded the opponent by the EPO so as largely to obviate any adverse legal consequences. Deficiencies as described in D-IV, 1.2.1(ii) and 1.2.2.2 must in any event be officially notified to the opponent, since this is a statutory requirement. Should this communication inadvertently be omitted notwithstanding deficiencies of this type in the notice of opposition, opponents may submit the missing particulars on their own initiative at any time, even after the expiry of the opposition period without suffering adverse legal consequences."
                        }
                    }
                },
                "1.4": {
                    "content": "Subsequent procedure in the event of deficiencies which may no longer be remedied",
                    "subsections": {
                        "1.4.1": {
                            "content": "Deficiencies which may no longer be remedied, as a result of which the opposition is deemed not to have been filed If formalities officers establish that the deficiencies referred to in D-IV, 1.2.1 have not been remedied within the time limits laid down in the EPC or by the EPO, they will inform the opponent in accordance with Art. 119 that the notice of opposition is deemed not to have been filed and that a decision may be applied for under Rule 112(2) (see E-VIII, 1.9.3). If no such application is made within the prescribed period of two months after notification of this communication, and if there is no other valid opposition pending, the proceedings are closed and the parties informed accordingly. Any opposition fees which have been paid are refunded. Documents submitted with a notice of opposition which is deemed not to have been filed will form part of the file and will thus be available for inspection in accordance with Art. 128(4). They will be regarded as observations by third parties under Art. 115 (see in this connection D-V, 2.2 and E-VI, 3). If a further admissible opposition is pending, the proceedings are continued in respect of it."
                        },
                        "1.4.2": {
                            "content": "Deficiencies which may no longer be remedied in accordance with Rule 77(1) and (2), resulting in the opposition being rejected as inadmissible If there are no deficiencies of the type referred to in D-IV, 1.4.1 but a notice of opposition which is deemed to have been filed reveals deficiencies under Rule 77(1) (see D-IV, 1.2.2.1) which may no longer be remedied and which have not been communicated to the opponent(s) in accordance with D-IV, 1.3.2 (because the opposition period has already expired), the formalities officer must, by virtue of Art. 113(1), notify the opponent(s) of these deficiencies, allowing them time in which to submit comments (normally two months), and point out to them that the notice of opposition is likely to be rejected as inadmissible. If the opponent - does not successfully refute the opinion expressed by the formalities officer on the existence of deficiencies under Rule 77(1) that may no longer be corrected or - has failed to remedy in good time deficiencies that may be corrected (Rule 77(2)) and that were communicated to them pursuant to D-IV, 1.3.2, the formalities officer will reject the notice of opposition as inadmissible, except in the case mentioned in D-IV, 1.2.2.1(v) (for which the opposition division is competent to decide, see the decisions of the President of the EPO dated 12 December 2013 and 23 November 2015 concerning the entrustment to non-examining staff of certain duties incumbent on the examining or opposition divisions, OJ EPO 2014, A6, and OJ EPO 2015, A104). As regards the form of the decision, see E-X, 2.3 and E-X, 2.6. However, if the opponent has requested oral proceedings or a further admissible opposition is pending, the formalities officer will submit the opposition documents to the directorate responsible for the European patent in suit (for designation of an opposition division, see D-IV, 2). The decision declaring the opposition inadmissible under Rule 77(1) or (2) can be taken without the participation of the patent proprietor in accordance with Rule 77(3). However, for reasons of procedural economy, the substantive examination is in fact initiated if at least one further admissible opposition is pending. The patent proprietor may also comment on the admissibility of the former opposition in the course of that examination. When the decision declaring the opposition inadmissible has become final the opponent concerned is no longer a party to the proceedings."
                        }
                    }
                },
                "1.5": {
                    "content": "Notifications to and observations by the patent proprietor Communications and decisions in the course of the examination as to whether the opposition is deemed to have been filed and is admissible are also notified to the patent proprietors for information. They may file observations on their own initiative concerning such a communication."
                },
                "1.6": {
                    "content": "Subsequent procedure For the subsequent procedure in the event of one or more oppositions with no deficiencies see D-IV, 5.2."
                }
            }
        },
        "2. ": {
            "title": "Activity of the opposition division Formalities officers submit the file to the opposition division in question on despatch of the invitation to the proprietor to submit comments in the cases referred to in D-IV, 5.2; in all other cases (see D-IV, 1.4.2) they submit it immediately.",
            "subsections": {},
            "content": " The director responsible will then designate the three technical members of the competent opposition division. The opposition division will decide whether one of its members – and if so, which – is to be entrusted with the examination of the opposition up to the taking of a decision (see D-II, 5). The technical members of the division will not be designated if the opposition is rejected as inadmissible by the formalities officer and no further admissible opposition has been filed (see D-IV, 1.4.2)."
        },
        "3. ": {
            "title": "Rejection of the opposition as inadmissible by the opposition division, the patent proprietor not being a party",
            "subsections": {},
            "content": " (For rejection of the opposition as inadmissible at a later stage, the patent proprietor being a party, see D-IV, 5.1 and 5.5). In cases of insufficient substantiation, where the formalities officer is not competent to decide on the inadmissibility (see D-IV, 1.2.2.1(v)), the opposition division will either: (i) issue the decision rejecting the opposition as inadmissible (when the formalities officer has already informed the opponent of this deficiency pursuant to D-IV, 1.3.2); or (ii) consider the opposition admissible and continue with examination of the opposition (see D-V); or (iii) communicate its findings to the opponent(s) in question and at the same time request them to submit observations. If the opponent does not successfully refute the opinion expressed by the opposition division on the existence of these deficiencies which may no longer be corrected, the opposition division will reject the notice of opposition as inadmissible, possibly after having held oral proceedings. As regards the form of the decision, see E-X, 2.3 and E-X, 2.6. The decision will be communicated to the other parties. An inadmissible opposition or documents produced in support of an inadmissible opposition will be placed in the file and will therefore be available for inspection in accordance with Art. 128(4). As regards the possibility of taking them into consideration as observations by third parties, see D-V, 2.2 and E-VI, 3. If there are further admissible oppositions, for reasons of procedural economy this decision to reject the opposition as inadmissible will normally be taken at the end of the procedure together with the decision on the admissible oppositions. For the possibility of appeal by the opponent and other possible means of redress, see E-XII, 1 and E-XII, 7."
        },
        "4. ": {
            "title": "Termination of opposition proceedings in the event of inadmissible opposition Under Art. 101(1) and Rule 79(1), the examination as to whether the European patent can be maintained can only be performed if at least one admissible opposition has been filed. This means that the opposition division has to refrain from commenting on the substantive merits of the opposition when expressing an opinion on its inadmissibility if there is no further admissible opposition (see T 925/91). Opposition proceedings are terminated if all notices of opposition filed against a European patent have been rejected as inadmissible and the last decision in this respect has become final. This will be communicated to the parties.",
            "subsections": {}
        },
        "5. ": {
            "title": "Preparation of substantive examination",
            "subsections": {
                "5.1": {
                    "content": "Inadmissibility at a later stage The admissibility of the opposition must be examined ex officio in every phase of the proceedings. In particular, the opposition division examines whether the notice of opposition is adequately substantiated (see D-IV, 1.2.2.1(v)). Since the admissibility of an opposition is always open to question by the patent proprietor, no separate communication that the opposition is admissible will be sent to the opponent or the patent proprietor. Where deficiencies on the basis of which the notice of opposition is likely to be regarded as inadmissible, but of which the opponent has not been informed by the formalities officer, come to the attention of the opposition division in the opposition documents submitted to it or because the patent proprietor has raised the issue during the proceedings, it will inform the parties about its reservations in a communication and at the same time request the opponent in question to submit observations. If deficiencies within the meaning of Rule 77(2) are involved, it is sufficient to specify a period for the opponent to remedy such deficiencies. If the opponent does not successfully refute the opinion expressed by the opposition division on the existence of these deficiencies which may no longer be corrected or fails to remedy in good time deficiencies which may be corrected, the opposition division will reject the notice of opposition as inadmissible, possibly after having held oral proceedings. As regards the form of the decision, see E-X, 2.3 and E-X, 2.6. For subsequent procedure, see the last two paragraphs of D-IV, 3."
                },
                "5.2": {
                    "content": "Invitation to the patent proprietor to submit comments and communication of opposition to the other parties concerned by the formalities officer If formalities officers consider that no further ex-officio objection to the admissibility of each or the only opposition remains, they will invite the patent proprietor, immediately after expiry of the opposition period or the period laid down by the formalities officer for the remedying of the deficiencies in accordance with Rule 77(2) (see D-IV, 1.2.2.2), or for the presentation of evidence (see D-IV, 1.2.2.1(v)), to file observations concerning the oppositions communicated earlier and to file amendments, where appropriate, to the description, claims and drawings within a four- month period. Extension of the time limit will only be granted in exceptional cases on the basis of a duly substantiated request (see E-VIII, 1.6, and the notice from the EPO dated 31 May 2016, OJ EPO 2016, A42). The above procedure also applies to oppositions where a decision to the effect that they are deemed not to have been filed or are inadmissible has not yet been taken or has not yet become final. If several notices of opposition have been filed, the formalities officer will communicate them to the other opponent(s) at the same time as the communication provided for in the previous paragraph. This will not be combined with an invitation to file observations or the setting of a time limit. However, copies of documents supporting the parties' submissions which are available for inspection via the Register will no longer be transmitted (see A-XI, 2 and the notice from the EPO dated 28 August 2020, OJ EPO 2020, A106)."
                },
                "5.3": {
                    "content": "Filing of amended documents in reply to the notice of opposition Amended documents must, provided that it is not irrelevant at the stage reached in the procedure, be as complete as possible and drawn up in such a way as to allow the European patent, where appropriate, to be maintained without further delay in the amended version. These considerations apply also to auxiliary requests in which the patent proprietor proposes amendments for consideration by the opposition division only if the division is unable to grant the main request, for example that the opposition is to be rejected. In both cases, however, it will be more convenient in certain circumstances to determine first the form of the claims, leaving purely consequential amendments in the description to be dealt with later (see D-V, 5). Care must be taken to ensure that any amendments do not offend against Art. 123(2) and (3) (see D-V, 6, H-IV, 5.3 and H-V, 2 and 3). It must also be checked that the patent, by the amendments themselves, does not contravene the requirements of the EPC (with the exception of Art. 82, see D-V, 2.2). Amendments of the description in opposition should be carried out by submitting amended paragraphs replacing specific numbered paragraphs of the B publication of the patent. This allows the opposition division and the opponents to verify the amendments efficiently. For reasons of procedural economy, the filing of a completely retyped description should be avoided (see H-III, 2.3). See also H-III, 2.2 to 2.4 for the form of amended documents. Proprietors' observations, and any amendments they make, are communicated to the opponent(s) by the formalities officer without delay for information. No time limit for reply is set."
                },
                "5.4": {
                    "content": "Communication of observations from one of the parties to the other parties The formalities officer will, at any stage in the procedure, immediately communicate the observations of any of the parties to the other parties for information. However, copies of documents supporting the parties' submissions, which are available for inspection via the Register, will no longer be transmitted (see also D-IV, 5.2, A-XI, 2 and the notice from the EPO dated 28 August 2020, OJ EPO 2020, A106). If the opposition division considers that observations are called for in the course of the further procedure, a separate invitation is issued and a period is fixed (normally four months), with or without a communication stating the grounds."
                },
                "5.5": {
                    "content": "Decision concerning the admissibility of an opposition, the patent proprietor being a party If the patent proprietor, when replying to the notice of opposition, contends that the opposition is inadmissible pursuant to Rule 77(1) and (2) because of deficiencies specified by the patent proprietor himself, the opponent concerned must be given the opportunity to submit comments within a period fixed by the formalities officer (normally two months). If the opposition division concludes that the opposition is inadmissible, it must as a rule first take a reasoned decision, possibly after having held oral proceedings. This decision is appealable. If, on the other hand, on the basis of another – admissible – opposition against the same patent, a final decision with regard to all substantive issues can be taken, the decision on admissibility is to be taken together with this final decision. If, despite the observations of the patent proprietor, the opposition division concludes that the opposition is admissible, the decision on admissibility is normally to be taken together with the final decision, especially where at least one other admissible opposition exists (see D-I, 6). If the opposition division is of the opinion that all oppositions are inadmissible, a reasoned decision is to be taken, which is appealable. An opponent whose opposition has been finally rejected as inadmissible is no longer a party to the subsequent proceedings once this decision becomes final."
                },
                "5.6": {
                    "content": "Examination of the admissibility of an intervention and preparations in the event of an intervention When examining whether an intervention is admissible, the formalities officer and the opposition division will proceed as for the examination as to admissibility of an opposition (see D-IV, 1, 3 and 5.5) but on the basis of the requirements for intervention under Art. 105 and Rule 89. Paragraphs D-IV, 5.2 and 5.4, may, however, be disregarded in the case of an intervention in opposition proceedings. Accordingly, particularly in the case of proceedings which are at an advanced stage, the formalities officer will inform third parties who have intervened of the progress of the proceedings and request them to indicate within one month whether they will also require the documents received from the parties in accordance with Rule 79(1) to (3), together with the communications from the opposition division and the observations of the parties under Rule 81(2), for the preceding period. If this is the case, the formalities officer will send them with the relevant communications from the opposition division or the formalities officer to the intervening third party."
                }
            }
        }
    },
    "Chapter V – Substantive examination of opposition": {
        "1. ": {
            "title": "Beginning of the examination of the opposition Once the preparations for the examination of the opposition have been completed pursuant to Rule 79, the opposition division examines whether the grounds for opposition (see D-III, 5) laid down in Art. 100 prejudice the maintenance of the European patent. The examination may also begin if a single admissible opposition has been withdrawn in the interim",
            "subsections": {},
            "content": " (see D-VII, 5.3). If the opponent has died or is legally incapacitated, the examination may begin even without the participation of the heirs or legal representatives (see D-VII, 5.2)."
        },
        "2. ": {
            "title": "Extent of the examination",
            "subsections": {
                "2.1": {
                    "content": "Extent to which the patent is opposed In the unusual case where an opposition is limited to only a certain part of the patent, the opposition division has to limit its examination to the part opposed. In particular, the opposition division cannot decide on the revocation of the patent beyond the extent to which it was opposed in the notice of opposition. However, if the opposition is directed only to an independent claim, the dependent claims are considered to be implicitly covered by the extent of the opposition and may be examined by the opposition division, provided their validity is prima facie in doubt on the basis of the information already available (see G 9/91). Similarly, if only a process claim is opposed, a product-by-process claim making reference to the same process is considered to be implicitly covered by the extent of opposition and may be examined under the same conditions as above (see T 525/96)."
                },
                "2.2": {
                    "content": "Examination of the grounds for opposition Opposition proceedings are not a continuation of examination proceedings. Hence as a general rule the opposition division will confine its examination to those grounds for opposition brought forward by the opponent. If, for example, the opposition is filed only on the grounds that the subject-matter of the European patent is not sufficiently disclosed or that it extends beyond the content of the patent application as filed, the opposition division will examine the patentability of the subject-matter of the European patent pursuant to Art. 52 to 57 only if facts have come to its notice which, prima facie, wholly or partially prejudice the maintenance of the patent (see G 10/91). A document indicated in the patent specification as the closest or important prior art for the purposes of elucidating the technical problem set out in the description forms part of the opposition proceedings even if not expressly cited within the opposition period. The same applies to any relevant documents cited in the patent specification which do not constitute the closest prior art but whose contents are nevertheless important for understanding the problem underlying the invention within the meaning of Rule 42(1)(c) EPC (T 536/88, in particular point 2.1). Once proceedings for examining the opposition(s) have been initiated because an admissible opposition has been filed (although it may have been withdrawn in the interim), there may be reason to believe that other grounds exist which, prima facie, in whole or in part prejudice the maintenance of the European patent. If that is the case, these grounds will generally be examined by the opposition division of its own motion pursuant to Rule 81(1). Such other grounds may result from facts emerging from the search report or the examination procedure, the personal knowledge of the division's members or observations presented by third parties pursuant to Art. 115 (see also E-VI, 3). Such grounds may also have been put forward in another opposition which has been rejected as inadmissible, or in another opposition deemed not to have been filed. They may also be any grounds submitted belatedly (see E-VI, 1.1 and E-VI, 2). Under Art. 114(1), such prejudicial grounds put forward in an opposition which has been withdrawn will also generally be examined by the opposition division of its own motion. In carrying out such examination the opposition division will, however, take the interests of procedural expediency into account (see E-VI, 1.2). If the decision is to be based on grounds to be taken into account pursuant to Art. 114(1) or Rule 81(1), the parties must be given the opportunity to comment (see E-X, 1). If during examination of the opposition an allegation about a relevant fact seems plausible, it may be taken into account without further evidence if it is not challenged by the other party. If a fact is contested or not plausible, the party making the allegation must prove it. If the parties to opposition proceedings make contrary assertions which they cannot substantiate and the opposition division is unable to establish the facts of its own motion, the patent proprietor is given the benefit of the doubt (see T 219/83, Headnote I). For example, if the opponent raises an objection under Art. 100(b) and provides experimental evidence that e.g. the claimed process cannot be realised, and the patent proprietor replies that the process can be carried out without undue burden by the skilled person taking common general knowledge also into consideration (T 281/86, OJ EPO 1989, 202; reasons 6), the patent proprietor has to provide proof of what was common general knowledge at the filing date (or the date of the earliest priority if priority has been claimed). Pursuant to Art. 100, the absence of unity of invention is not a ground for opposition (see D-III, 5). Since unity of invention under Art. 82 is only required for the European patent application, the unity of the subject-matter of the European patent may not be examined by the opposition division, even of its own motion. In particular, where the facts, evidence and arguments which come to light in the opposition proceedings lead to the maintenance of the European patent in amended form, there will be no further examination as to whether the remaining subject-matter of the patent contains a single invention or more than one. Any lack of unity must be accepted (see G 1/91). Similarly, where amendments occasioned by a ground for opposition (see H-II, 3.1) contain multiple independent claims in the same category and are still covered by the independent claim as granted, compliance with Rule 43(2) will not be examined further. The grounds for opposition laid down in Art. 100 are examined in greater detail below."
                }
            }
        },
        "3. ": {
            "title": "Non-patentability pursuant to Art. 52 to 57",
            "subsections": {},
            "content": " The same substantive requirements apply in the opposition procedure regarding patentability pursuant to Art. 52 to 57 as in the examination procedure. G-I to VII will therefore also be applied in opposition proceedings. However, it will be more common in opposition proceedings than in examination procedure for the examination as to patentability to be based on the state of the art as made available to the public not by written description but \"by means of an oral description, by use, or in any other way\" (see Art. 54(2) and G-IV, 7)."
        },
        "4. ": {
            "title": "Insufficient disclosure of the invention Determination of whether the disclosure of an invention in a European patent application is sufficient is dealt with in F-III, 1 to 3.",
            "subsections": {},
            "content": " The principles set out there will also apply mutatis mutandis to the opposition procedure. The overriding consideration in this context is the disclosed content of the European patent specification, that is to say what a person skilled in the art is able to derive directly and unambiguously from the explicit and implicit disclosure in the patent claims, description and drawings, if any, without using inventiveness. Pursuant to Art. 100(b), the patent has to disclose the invention in a manner sufficiently clear and complete for it to be carried out by persons skilled in the art. If the patent specification does not disclose the invention sufficiently clearly to enable it to be carried out over the full scope of the claim in accordance with Art. 100(b), this may be remedied, provided the original documents contained a sufficient disclosure, but subject to the condition that, as required under Art. 123(2), the subject-matter of the European patent does not extend beyond the content of the application as filed and, as required under Art. 123(3), the protection conferred is not extended. The skilled person wishing to implement the claimed invention reads the claims in a technically sensible manner. An objection of insufficient disclosure of the invention is therefore not to be based on embodiments that are meaningless and not consistent with the teaching of the application as a whole (see T 521/12). There is normally no deficiency under Art. 100(b) if a feature which is essential for performance of the invention is missing from the claim but is disclosed in the description and/or drawings. However, unduly broad claims may be objected to under Art. 56 (see T 939/92)."
        },
        "5. ": {
            "title": "Clarity of claims and support by the description Clarity is not a ground for opposition. Opposition proceedings are not designed as a procedure for generally amending (or revoking) patents that contain any kind of defect, and therefore opposition proceedings are not to be regarded as a continuation of examination proceedings. As a general rule this means that a granted claim has to be lived with even if new facts",
            "subsections": {},
            "content": " (e.g. new prior art) demonstrate that the claim is unclear (G 3/14). In considering whether, for the purpose of Art. 101(3), a patent as amended meets the requirements of the EPC, the claims of the patent may be examined for compliance with the requirements of Art. 84 only when, and then only to the extent that, an amendment introduces non-compliance with Art. 84 (G 3/14, confirming the jurisprudence as exemplified by T 301/87). A lack of compliance with Art. 84 cannot be seen as having been introduced by an amendment if a clarity problem already present in the claims as granted is only brought into notice, highlighted or made visible by the amendment. According to G 3/14, the amendment of one claim or part of a patent cannot lead to a re-examination of other parts of the patent which have not been amended. Thus, the deletion of an independent claim with its dependent claims or the deletion of a dependent claim leaving the independent claims and other dependent claims intact does not permit examination of the remaining claims for compliance with Art. 84. A claim amended during opposition proceedings is not subject to examination for compliance with Art. 84 if it results from (i) inserting a complete dependent claim as granted into an independent claim; (ii) combining one of several alternative embodiments of the dependent claim as granted with the independent claim as granted; (iii) deleting wording from a granted claim (whether independent or dependent), whereby its scope is narrowed but a pre-existing lack of compliance with Art. 84 is left intact (as exemplified by T 301/87); or (iv) deleting optional features from a granted claim (whether independent or dependent). However, an amended claim is to be examined for compliance with Art. 84: (v) if features are taken from the description and inserted into a granted claim by way of amendment; or (vi) if a feature from a dependent claim as granted is introduced into an independent claim as granted and this feature was previously connected with other features of that dependent claim and an alleged lack of compliance with Art. 84 is introduced by the amendment. Correspondingly, the description of the patent may be examined for compliance with the requirements of Art. 84 only when, and then only to the extent that, an amendment of the patent introduces non-compliance with Art. 84. In particular, inconsistencies between the description and the claims resulting from amendments during opposition proceedings and casting doubt on the subject-matter for which protection is sought must be avoided (see F-IV, 4.3 for examination of inconsistencies between the description and the claims in general). Other amendments of the description not resulting from amendments of the claims during opposition proceedings may be allowed under the conditions laid down in H-II, 3.2."
        },
        "6. ": {
            "title": "Subject-matter of the European patent extending beyond the original disclosure",
            "subsections": {
                "6.1": {
                    "content": "Basis of this ground for opposition This ground for opposition under Art. 100(c) refers back to Art. 123(2) and stipulates that the subject-matter of a European patent may not extend beyond the content of the application as filed. In the case of a patent granted on the basis of a European divisional application (Art. 76(1)), two criteria apply: the subject-matter must not extend beyond the content of the earlier application as filed (Art. 76(1)), and it must not extend beyond the content of the divisional application as filed (Art. 123(2)) (see T 873/94). Similar considerations apply to applications filed under Art. 61. In the case of a patent granted on an application filed in a language other than an official language of the EPO either in accordance with Art. 14(2) or in accordance with Rule 40 (see Rule 40(3)), the original text will, as provided for in Art. 70(2), constitute the basis for determining whether the subject-matter of the European patent extends beyond the content of the application as filed. However, unless, for example, the opponent adduces proof to the contrary the opposition division may, under Rule 7, assume that the translation referred to in Art. 14(2) or Rule 40(3) is in conformity with the original text of the application."
                },
                "6.2": {
                    "content": "Distinction between allowable and unallowable amendments The distinction between allowable amendments to the content of a European patent application and amendments which are at variance with Art. 123(2) or Art. 76(1) is set forth in H-IV, 2, and C-IX, 1.4. These guidelines will be applied mutatis mutandis in the course of opposition proceedings to determine whether the subject-matter of the European patent as granted or as amended during the opposition proceedings extends beyond the content of the application as filed."
                }
            }
        }
    },
    "Chapter VI – Procedure for the examination of the opposition": {
        "1. ": {
            "title": "General remarks The opposition division will first of all endeavour to reach a decision in written proceedings. Taking account of the investigations usually conducted beforehand by the first member (see D-II, 5 and 6), the opposition division will base its decision on the written submissions of the parties and, where appropriate, on other written evidence obtained, in particular, through the production of documents, requests for information and sworn statements in writing.",
            "subsections": {
                "1.1": {
                    "content": "Basic principle Examination of the admissibility of the opposition and preparation of the examination of the opposition will be commenced immediately after the notice of opposition has been received by the formalities officer or the opposition division (see D-IV, 1 and 3 and D-V, 1 and 2). If during the rest of the proceedings the opposition division, on account of the amount of work in hand, is unable to process immediately all the oppositions submitted, the reference date for the sequence of tasks will, in principle, be the date on which the last observations in respect of which a time limit had been laid down were submitted by any of the parties, but may not be later than the date on which the time limit expired. Documents received unsolicited or not subject to a previously stipulated official time limit, in connection with official communications setting a time limit, will not affect the sequence of tasks unless they require a further early notification setting a time limit."
                },
                "1.2": {
                    "content": "Exceptions Notwithstanding D-VII, 1.1 above, oppositions are to be given priority: (i) if the earlier examination proceedings were of considerably longer duration than usual; (ii) if the opposition proceedings have already extended over a considerably longer period than usual; (iii) if a party to the proceedings has submitted a reasoned request for accelerated processing in a case where an infringement action in respect of the European patent is pending before the Unified Patent Court or a national court of a contracting state, or if the EPO is informed by the Unified Patent Court, a national court or competent authority of a contracting state that infringement actions are pending (see the notice from the EPO dated 24 April 2023, Supplementary publication 3, OJ EPO 2023, 9; see E-VIII, 5); (iv) if other matters to be dealt with, e.g. divisional applications, hinge upon the final decision concerning the opposition; or (v) if the next procedural step can be dealt with relatively quickly."
                }
            },
            "content": " The parties in inter partes cases are subject to a particular duty to facilitate due and swift conduct of the proceedings, in particular by submitting all relevant facts, evidence, arguments and requests as early and completely as possible (see D-IV, 1.2.2.1 and E-IV, 1.2). Furthermore, any ground, fact and evidence filed by the opponent(s) after the expiry of the opposition period are considered as late-filed unless they are due to a change in the subject of the proceedings; see E-VI, 2 and subsections for more details. Admissibility of amendments by the proprietor is treated in detail in H-II, 3 to H-II, 3.5, E-VI, 2.2.2 and E-VI, 2.2.3. If the opposition division considers it expedient, or if any party requests oral proceedings, oral proceedings in accordance with Art. 116(1) will be held before the opposition division after suitable preparation (see D-VI, 3.2). In the oral proceedings, the parties may state their cases and make submissions in order to clarify outstanding questions. Members of the opposition division may put questions to the parties. In special, less common cases it will occasionally prove necessary in opposition proceedings for oral evidence to be taken by the opposition division as part of oral proceedings or for the conservation of evidence, or by the first member outside the oral proceedings. The opposition division is not obliged to take oral evidence if it does not consider it necessary, even if a party has so requested. Oral evidence may be taken, where appropriate under oath, before the competent court in the country of residence of the person to be heard. A member of the opposition division may, at the request of the opposition division, attend such court hearings (see E-IV, 1.3). The principal means of taking oral evidence will be the hearing of witnesses and parties (see E-IV, 1.6). Only in exceptional cases will evidence be obtained at the initiative of the opposition division by means of oral and/or written reports by experts (see E-IV, 1.8.1) or by carrying out an inspection (see E-IV, 1.2, last paragraph). In view of the specialised knowledge of the members of the opposition division – and of the costs involved – such means will be used only as a last resort."
        },
        "2. ": {
            "title": "Adherence to the text of the European patent submitted or approved by the patent proprietor",
            "subsections": {
                "2.1": {
                    "content": "Basis for the examination If the patent proprietors submit amendments to the description, claims or drawings after the notice of opposition has been communicated to them (see H-II, 3), the opposition division must take as a basis for its examination the text of the European patent submitted by the patent proprietors. This principle, that the opposition division must concern itself solely with the text most recently \"submitted or agreed by the patent proprietor\", also applies to the rest of the opposition procedure. (As regards the possibility of amending texts, see H-IV, 3.1, second paragraph)."
                },
                "2.2": {
                    "content": "Revocation of the patent Where it is stated that the patent proprietor no longer approves the text in which the patent was granted and no amended text is submitted, the patent must be revoked. This also applies when the patent proprietor requests that the patent be revoked."
                }
            },
            "content": " In implementing this provision, the desired aim of speeding up the procedure will be borne in mind as much as the common interest in taking obviously relevant submissions into account. If during the opposition proceedings it becomes apparent that the previous application from which the opposed patent claims priority is not in an official language of the European Patent Office and the validity of the priority claim is relevant to the determination of the patentability of the subject-matter of the patent concerned, the opposition division will invite the patent proprietor to file a translation of that application into one of the official languages within a period to be specified. Alternatively, a declaration may be submitted that the European patent application on the basis of which the opposed patent was granted is a complete translation of the previous application. For the procedure for inviting the patent proprietor to file such a translation or declaration see A-III, 6.8, and F-VI, 3.4. Such an invitation is not to be issued if the translation of the previous application or the declaration was available to the European Patent Office and is to be included in the file of the European patent application under Rule 53(2). Failure by the patent proprietor to supply a required translation or declaration in due time will lead to the priority right being lost. This will have the effect that the intermediate document(s) will become prior art under Art. 54(2) or Art. 54(3), as applicable, and therefore relevant for the assessment of patentability (see A-III, 6.8.3). The patent proprietor will be notified of this loss of rights (see A-III, 6.11). As a means of redress, the patent proprietor may request either re-establishment of rights under Art. 122 and Rule 136 (see E-VIII, 3) or a decision under Rule 112(2) (see E-VIII, 1.9.3)."
        },
        "3. ": {
            "title": "Invitation to file observations",
            "subsections": {
                "3.1": {
                    "content": "Opposition division's communications In examining the opposition, the opposition division will invite the parties, as often as is necessary, to clarify the substance of the case, to file observations on communications from another party or issued by itself (see E-II, 1) and, where appropriate, to adduce evidence in respect of matters under dispute. Rule 81(2) does not require the opposition division to set a period for replying to this invitation. Such a period will, however, be set whenever the opposition division considers this expedient. As regards the length of the period see E-VIII, 1.2, as regards the extension of a period see E-VIII, 1.6, and as regards late submission of observations see E-VIII, 1.7 and E-VIII, 1.8, as well as Art. 114(2). Communications from the opposition division and all replies thereto must be communicated to all parties. In particular, the text of the European patent will be uniform for all designated contracting states unless otherwise provided for in the EPC (see D-VII, 3.2 and H-III, 4)."
                },
                "3.2": {
                    "content": "Summons to oral proceedings If oral proceedings have to be arranged, the parties must be summoned to them as quickly as possible at reasonable notice (see E-III, 6). If the first action of the opposition division is to summon the parties, the first substantive communication of the opposition division under Art. 101(1) is annexed to the summons to oral proceedings. For the form of oral proceedings, see E-III, 5, E-III, 1.2 and E-III, 1.3. Together with the summons, the opposition division will draw attention to and in the annexed communication explain the points which in its opinion need to be discussed for the purposes of the decision to be taken; where this has already been done sufficiently in a prior communication, it is appropriate to refer to that communication. Normally, the annexed communication will also contain the provisional and nonbinding opinion of the opposition division on the positions adopted by the parties and in particular on amendments filed by the patent proprietor. At the same time, a date will be fixed up to which written submissions may be made or amendments may be filed. Normally this date will be two months before the date of the oral proceedings. As this date is not a time limit, Rule 132 does not apply and the parties cannot request to postpone it. The summons to oral proceedings and the annexed communication do not constitute decisions within the meaning of Art. 106(1) and can thus only be appealed together with the final decision (see T 1954/14) unless either of them allows a separate appeal to be filed (see E-X, 3)."
                }
            }
        },
        "4. ": {
            "title": "Communications from the opposition division to the patent proprietor",
            "subsections": {
                "4.1": {
                    "content": "Communications from the opposition division; reasoned statement Where necessary, any communication to the patent proprietor must contain a reasoned statement. This also applies to any communication to other parties which is communicated to the proprietor of the patent for information only. A reasoned statement will usually not be required if the communication concerns only matters relating to form or if it contains no more than self-explanatory proposals. Where appropriate, all the grounds against the maintenance of the European patent are to be given in the communication. EPC unless the third parties consent to their continuation. Such consent must be communicated in writing to the EPO and is irrevocable. However, the proceedings will be stayed only if the opposition division has deemed the opposition admissible. If proceedings within the meaning of Art. 61(1) are instituted during the opposition period, a stay of proceedings will be possible only if a notice of opposition has been filed. Accordingly, the third party might have to file an opposition itself in order to benefit from a stay of proceedings under Rule 78. The dates of stay and resumption of proceedings will be entered in the European Patent Register. The parties to the opposition proceedings are to be informed of the order staying the proceedings.",
                    "subsections": {
                        "4.1.1": {
                            "content": "Date of the stay of proceedings The proceedings are stayed on the date on which the EPO receives evidence that proceedings against the patent proprietor have been instituted. The requirements for valid institution of relevant proceedings are determined by national law (J 7/00)."
                        },
                        "4.1.2": {
                            "content": "Legal character and effect of the stay of proceedings Stay of proceedings is a preliminary procedural measure sui generis which takes immediate effect as a preventive measure to preserve the third party's possible rights (J 28/94; J 15/06). The patent proprietor will not be heard but may file a request for an appealable decision on the stay of proceedings. Stay of proceedings means that the legal status quo existing at the time of ordering is maintained, i.e. neither the EPO nor the parties may validly perform any legal acts (J 38/92). An automatic debit order ceases to be effective on the day on which a stay of the proceedings takes effect (see Point 11.1(c) AAD, Annex A.1 to the ADA, Supplementary publication 3, OJ EPO 2022, page 35). If the automatic debiting procedure is to be used again after resumption of the proceedings, a new automatic debit order is to be filed."
                        }
                    }
                },
                "4.2": {
                    "content": "Invitation to file amended documents If the opposition division considers that the European patent cannot be maintained in an unamended form, it must inform the patent proprietors accordingly, stating the grounds, and give them the opportunity to amend, in appropriate cases, the description, claims and drawings. As regards the time limit here, see E-VIII, 1.2. Where necessary, the description adjusted in line with the new claims (see D-IV, 5.3 and D-V, 5) will also deal with the state of the art as set out in the opposition proceedings, the technical purpose and the advantages of the invention as it will then stand. However, if the patent proprietor has neither requested oral proceedings nor filed amendments (including any auxiliary requests), the patent can be revoked directly on the basis of the grounds, evidence and arguments on file (see also E-X, 1.1). Proposals for amendment filed at a late stage in the proceedings may be disregarded (see T 406/86). For amended documents, see H-III, 2.",
                    "subsections": {
                        "4.2.1": {
                            "content": "Continuation after a final decision Proceedings are resumed when evidence is provided that a final decision within the meaning of Art. 61(1) has been taken. If the decision is in favour of the third party, the proceedings may not be resumed earlier than three months after the decision has become final, unless the third-party requests resumption."
                        },
                        "4.2.2": {
                            "content": "Continuation regardless of the stage reached in national proceedings When giving a decision on the stay of proceedings or thereafter, the Legal Division may set a date on which it intends to continue the proceedings, regardless of the stage reached in the national proceedings. Unlike the decision on staying the proceedings, it is at the discretion of the Legal Division to decide whether proceedings are to be resumed. In exercising this discretion, the Legal Division has to take into account the impact of a further suspension or the continuation of the proceedings on each of the parties (J 33/03). Some aspects to be taken into account when exercising this discretion are the duration of the stay and the outcome of first instance proceedings before national courts. Likewise, it will be considered whether delaying tactics are being employed by the third party."
                        }
                    }
                },
                "4.3": {
                    "content": "Interruption of time limits The time limits in force at the date of stay are interrupted by the stay of proceedings. The time which has not yet elapsed begins to run as from the date on which proceedings are resumed; however, the time still to run after the resumption of the proceedings must not be less than two months. Example: A communication under Rule 82(2) maintaining the patent in amended form is despatched by the EPO on 7 November 2023. Under Rule 126(2) and Rule 131(2), this communication is deemed delivered on the date it bears, i.e. on 7 November 2023 (OJ EPO 2023, A29). The three-month period to pay the publication fee and file the translation of any amended claim starts on the day following delivery of the communication, i.e. on 8 November 2023, and it ends on 7 February 2024. If proceedings are stayed under Rule 78(1) by the Legal Division on 30 November 2023, the three-month period has elapsed from 8 November 2023 to 29 November 2023 before the event of the staying of the proceedings, i.e. 22 days have already passed and the period remaining is eight days and two months. Since the remaining period is longer than two months, under Rule 78(1) and Rule 14(4) it will run after the resumption of the proceedings. Hence, if the proceedings are resumed by the Legal Division on 23 February 2024, the period for paying the publication fee and filing the translation of the claims runs until 2 May 2024 for the following reasons: (i) the day of resumption of the proceedings by the Legal Division (23 February 2024) is the first day on which the remaining period starts running again (Rule 131(2) does not apply). (ii) The remaining days are added first and then the remaining months: in the example, eight days from and including 23 February 2024 results in 1 March 2024, and the addition of another two months results in the remaining period expiring on 1 May 2024. (iii) Since Rule 134(1) applies also to the remaining period and since the 1 May 2024 no mail is delivered in Munich and Berlin (public holiday), the time limit is extended until 2 May 2024."
                },
                "4.4": {
                    "content": "Department responsible The Legal Division is responsible for the procedure where the patent proprietor is not entitled (see the decision of the President of the EPO dated 21 November 2013, OJ EPO 2013, 600)."
                }
            }
        },
        "5. ": {
            "title": "Additional search In exceptional cases, the opposition division, like the examining division, may on its own initiative cite new material relating to the state of the art and take it into account in its subsequent decision (see C-IV, 7.4). In the normal course of events, however, since the grant of the patent will have been preceded by a search into the subject-matter of the application by the search division, by the examining division and generally by the opponent(s), no additional search will be made. Only in exceptional cases will an additional search by the opposition division be set in train. Such a case might arise, for example, if in the opposition the main subject covered by the patent shifts to elements of a dependent claim which were originally of subsidiary importance, to elements which were previously not set out in the claims, but only in the description, to individual features of a combination, or to sub-combinations, and there are grounds for believing that the original search did not extend to such elements or features and if no relevant document can be found quickly in the circumstances set out in C-IV, 7.4.",
            "subsections": {
                "5.1": {
                    "content": "Continuation in the case of surrender or lapse of the patent If the European patent has been surrendered or has lapsed for all the designated states, the opposition proceedings must be continued at the request of the opponent filed within two months after the date on which the opposition division informed the opponent of the surrender or lapse. Evidence of the lapse must generally be provided by submitting extracts from the Patent Registers of the designated contracting states. Surrender or lapse has immediate nonretroactive effect (i.e. patent protection ceases on the date of surrender or lapse), whereas a revoked patent is deemed to have had no effect from the outset (Art. 68). So the opponent may still have an interest in the revocation of a lapsed or surrendered patent. If, in the case of a request for continuation of the proceedings, the patent proprietor has renounced before the competent authorities in the designated states all rights conferred by the patent with ab initio and universal effect, or if no request for continuation has been received within the time limit, the opposition proceedings will be closed. The decision to close the proceedings will be communicated to the parties. A statement by the patent proprietors making it unambiguously clear that they no longer wish their patent to be maintained is considered to be a request for its revocation, irrespective of the wording used (T 237/86). For details of the procedure to be followed, see D-VIII, 1.2.5."
                },
                "5.2": {
                    "content": "Continuation on the death or legal incapacity of the opponent In the event of the death or legal incapacity of an opponent, the opposition proceedings may be continued by the opposition division of its own motion, even without the participation of the heirs or legal representatives, for example if the legal proceedings in connection with the will or the appointment of a new legal representative would inordinately prolong the opposition proceedings. This provision will apply not only where only one opposition has been filed: it will also apply in cases where not all those who have filed opposition are deceased or legally incapacitated. The opposition division will continue the proceedings if, for instance, the patent proprietor has submitted amendments to the patent in response to the notice of opposition (see T 560/90). The opposition division will also continue the proceedings if it considers that the stage reached in the opposition proceedings is such that they are likely to result in a limitation or revocation of the European patent without further assistance from the opponent(s) concerned and without the opposition division itself having to undertake extensive investigations (see T 197/88). The patent proprietor and any other parties are to be informed that the proceedings will be continued. Otherwise the proceedings are closed and the decision to close the proceedings is communicated to the parties."
                },
                "5.3": {
                    "content": "Continuation after the opposition has been withdrawn The opposition proceedings can be continued even if every opposition has been withdrawn. The principles set forth in D-VII, 5.2 apply mutatis mutandis in deciding whether the proceedings are to be continued or closed."
                }
            }
        },
        "6. ": {
            "title": "Examination of the opposition during oral proceedings For details regarding the examination shortly before and during oral proceedings and the conduct thereof, see E-III, 8.",
            "subsections": {},
            "content": " It is not deemed to have been filed until the opposition fee has been paid in the amount prescribed in the Rules relating to Fees under the EPC. Intervention is permissible as long as opposition or appeal proceedings are pending. A third party can become a party to the proceedings during the period for filing an appeal only if a party to the proceedings in which the decision was given files an appeal pursuant to Art. 107; otherwise the decision of the opposition division will become final on expiry of the appeal period (see G 4/91 and G 1/94). A properly filed and admissible intervention is treated as an opposition, which may be based on any ground for opposition under Art. 100 (see G 1/94). This means that, when intervening at any stage of first-instance proceedings, the intervener enjoys essentially the same rights as any other party to the proceedings. If the intervener introduces new facts and evidence which appear to be crucial, the proceedings may need to be prolonged to enable them to be adequately considered. In all other cases the opposition division must ensure that the intervention does not delay the proceedings. If the notice of intervention is filed at a late stage of the proceedings, for example when oral proceedings have already been scheduled, the opposition division may dispense with issuing communications under Rule 79(1) to Rule 79(3). The introduction of a new ground for opposition at such a late stage may lead to a postponement of the date set for oral proceedings. For accelerated processing of oppositions and accelerated processing before the boards of appeal on request, see E-VIII, 5 and E-VIII, 6. The notice of intervention, filed in a written reasoned statement, must contain: (i) a statement of the grounds for intervention and corresponding evidence. The proceedings providing the grounds for intervention must be directed towards establishing an infringement (or its absence) as a final legal result. Proceedings directed at the preservation of evidence to enable a party to initiate separate infringement proceedings are not sufficient in this regard (see T 439/17). (ii) the name, address and nationality of the assumed infringer and the state in which the assumed infringer's residence or principal place of business is located. Names of natural persons must be indicated by the person's family name and given name(s), the family name being indicated before the given name(s). Names of legal entities, as well as companies considered to be legal entities by reason of the legislation to which they are subject, must be indicated by their official designations. Addresses must be indicated in such a way as to satisfy the customary requirements for prompt postal delivery at the indicated address. They must comprise all the relevant administrative units, including the house number, if any. Assumed infringers (whether natural or legal persons) whose residence or principal place of business is in an EPC contracting state and who act without a professional representative can use an address for correspondence other than their residence. The address for correspondence must be the assumed infringer's own address. Post cannot be sent to a different (natural or legal) person, since that requires a valid form of representation under Art. 133 and 134. It is recommended that the telephone number be indicated (see D-IV, 1.2.2.2(i) and 1.4.2); (iii) the number of the European patent at issue in the opposition proceedings in which intervention is made, the name of the patent proprietor and the title of the invention (see D-IV, 1.2.2.2(ii) and 1.4.2); (iv) a statement of the extent to which the European patent at issue is opposed by way of intervention and of the grounds on which the opposition by way of intervention is based, as well as an indication of the facts and evidence presented in support of these grounds, together with a statement of reasons, i.e. arguments (see D-IV, 1.2.2.1(iii) to 1.2.2.1(v) and 1.4.2); (v) if the assumed infringer has appointed a representative, the representative's name and address of place of business in accordance with subparagraph (ii) as set out above (see D-IV, 1.2.2.2(iii) and 1.4.2). D-IV, 1 sets out further details and explains how to deal with the intervention if one of these requirements is not fulfilled."
        },
        "7. ": {
            "title": "Preparation of the decision",
            "subsections": {
                "7.1": {
                    "content": "General remarks If the opposition division does not consider it expedient to arrange for oral proceedings of its own motion (see E-III, 4 and below) or for the taking of evidence even where the latter is requested (see E-IV), and if no admissible request for oral proceedings has been received from a party (see E-III, 2), the decision must be reached on the basis of written proceedings. In this case there is no obligation to arrange for oral proceedings before a decision is reached. If the case is decided on the basis of written proceedings, submissions filed after the decision has been handed over to the EPO internal postal service for remittal to the parties can no longer be considered, as from that moment the division cannot amend the decision (see G 12/91), except to the limited extent provided for in Rule 140 (see H-VI, 3.1). The decision, whether or not preceded by oral proceedings or the taking of evidence, may be to revoke the patent (see D-VIII, 1.2), to reject the opposition (see D-VIII, 1.3) or to maintain the patent as amended (see D-VIII, 1.4)."
                },
                "7.2": {
                    "content": "Preparation of a decision to maintain a European patent in amended form",
                    "subsections": {
                        "7.2.1": {
                            "content": "Procedural requirements A decision to maintain the patent in amended form may be delivered only when the patent proprietor has approved the new text on the basis of which the opposition division intends to maintain the patent and the opponent has had sufficient opportunity to comment on the proposed new text. Both prerequisites can be fulfilled during oral proceedings at which the opposition division establishes the text including the amended description and, if necessary, the amended figures. In written proceedings, the necessary opportunity to comment on the new text on the basis of which the opposition division intends to maintain the patent is given to the opponent when a communication is issued to the parties. Once these requirements have been met, a separate communication under Rule 82(1) is neither necessary nor appropriate (see G 1/88). If the patent can be maintained in the amended form, the opposition division tries to obtain the patent proprietor's approval of the text in which the patent can be maintained and gives the opponent an opportunity to comment on it. An interlocutory decision can then be delivered. If these requirements have still not been met and no oral proceedings are being held, a communication under Art. 101(1) must be issued. This also applies when it has been established in principle that the patent can be maintained in a particular form but a complete text expressly approved by the patent proprietor is not yet available. The patent proprietor's approval of an amended version of the patent need not be given in a separate, express declaration; it may also be apparent from the circumstances, in particular from the fact that an amended version was filed or requested. This applies equally to versions which have been filed as an auxiliary request. (For the wording of documents in oral proceedings, see E-III, 8.11 and E-III, 8.11.1). The patent proprietor's approval can also be obtained through a communication under Rule 82(1) in which the opposition division informs the parties that it \"intends to maintain the patent as amended\" and invites them to \"state their observations within a period of two months if they disapprove of the text in which it is intended to maintain the patent\". If no objections are filed to the text thus notified, the patent proprietor is considered to approve of it. A communication under Rule 82(1) can also be sent if the opposition division considers that the complete document expressly approved by the patent proprietor, on which the opponent has been able to comment, still requires amendments. However, these must not go beyond such editorial changes to the wording as appear absolutely necessary by comparison with the text most recently submitted or approved by the patent proprietor. The opposition division will draw attention to such amendments and state why they are required if they are not self-explanatory. If within the period specified in the communication, or in a communication under Rule 82(1), the patent proprietor objects to the text in which the patent is to be maintained, the proceedings are continued. The European patent can be revoked in the subsequent proceedings if the patent proprietor objects to the text and fails to submit new, properly amended documents despite having been requested to do so. If any opponent objects to the text communicated to them in which it is intended to maintain the patent, the opposition division will continue examining the opposition if it considers that the EPC prejudices the maintenance of the patent in the text initially envisaged."
                        },
                        "7.2.2": {
                            "content": "Decision on the documents on the basis of which the patent is to be maintained If the opposition division considers that the patent can be maintained on the basis of the text submitted or approved by the patent proprietor, and the opponent has had sufficient opportunity to comment on this text – either in writing or during oral proceedings – as well as on the reasons decisive to the patent's maintenance, the opposition division will issue an interlocutory decision to the effect that the patent and the invention to which it relates meet the requirements of the EPC following the amendments made by the patent proprietor during the opposition proceedings. If the patent can only be maintained on the basis of an auxiliary request, the decision has to contain a reasoned statement why the version of the main request (and any higher-ranking auxiliary request) does not meet the requirements of the EPC (see E-X, 2.9, H-III, 3.4.1 and H-III, 3.4.2). A separate appeal under Art. 106(2) is allowed against this decision, which must be reasoned having regard to the grounds for opposition maintained by the opponent or taken up by the opposition division. The decision is delivered in all cases where a European patent is maintained in amended form, even if the opponent has approved of the text communicated by the opposition division or has not commented on it. In the former case, the decision is fairly brief, merely noting that in the light of the amended text the opponent no longer maintains the original grounds for opposition. If this decision is not contested, the ruling enshrined in it becomes final and as a result the documents can no longer be amended. This interlocutory decision is intended to save the patent proprietor unnecessary translation costs arising from an amendment to the text in appeal proceedings. It nevertheless qualifies as a grant decision in the sense of G 1/10 and corrections can only be requested in the narrow ambit provided for in Rule 140 (see H-VI, 3.1)."
                        },
                        "7.2.3": {
                            "content": "Request for publishing fee, translations and a formally compliant version of amended text passages Once the interlocutory decision becomes final or the amended text in which the patent is to be maintained has been drawn up in opposition appeal proceedings, the formalities officer requests the patent proprietor - to pay, within three months, the fee for publishing a new specification of the European patent; - to file translations of any amended claims in the two official languages of the EPO other than the language of the proceedings; and - to file a formally compliant verbatim version of amended text passages if in oral opposition proceedings the interlocutory decision of the opposition division under Art. 101(3)(a) and 106(2) or the board of appeal decision under Art. 111(2) has been based on documents not complying with Rule 50(1) (see E-III, 8.7). If the European patent in the amended form contains different claims for different contracting states, a translation of all sets of claims – in the text communicated to the patent proprietor – into all official languages other than the language of the proceedings must be filed. If the request under the first paragraph above is not complied with \"in due time\", the acts may still be validly performed within two months of notification of a communication pointing out the failure to observe the time limit, provided that within this two-month period the prescribed surcharge is paid. If any of the acts is not performed within the period of grace, the formalities officer will issue a decision for revocation of the patent in accordance with Rule 82(3)."
                        }
                    }
                }
            },
            "content": " Rule 74 applies mutatis mutandis to the new specification of the European patent."
        },
        "8. ": {
            "title": "Request to stay opposition proceedings If a party requests a stay of opposition proceedings for the sole reason of pending appeal or opposition proceedings of a patent family member (e.g.",
            "subsections": {},
            "content": " a parent application), the request will not be granted. The party will receive a communication from the opposition division indicating the reasons for its intention not to grant the request. This communication does not constitute an appealable decision under Art. 106(1) or Art. 106(2). If oral proceedings take place and the request is maintained, the opposition division will address it at oral proceedings, giving the parties an opportunity to comment. After the oral discussion on the stay, the opposition division will take a decision on the request. Reasons for a stay or interruption of proceedings are set out in E-VII, 1 to Art. 54(4) EPC 1973 and Rule 23a EPC 1973 continue to apply to patents granted in respect of patent applications filed before 13 December 2007. Consequently, in such cases, the designated countries need to be taken into consideration when assessing the novelty of documents according to Art. 54(3) (see H-III, 4.2). Art. 54(5) applies only to patents for which the date of the decision to grant the patent under consideration was taken on or after 13 December 2007 (Special edition No. 1, OJ EPO 2007, 197). If the decision to grant was taken before that date (the date of entry into force of EPC 2000), only \"Swiss type\" claims are allowed for any second or further medical use (provided these claims meet with all the other requirements of the Convention). Where the subject-matter of a claim is rendered novel only by a new therapeutic use of a medicament, that claim may no longer take the form of Swiss-type claim for European or international patent applications having a filing date or earliest priority date of 29 January 2011 or later (see G 2/08, OJ EPO 2010, 514 and G-VI, 6.1). Examples: Date of entry into force of EPC 2000: 13.12.2007. The decision to grant for patent EP1 mentions the date of 13.12.2007 in the top box and the date of 07.12.2007 in the bottom line. EP1 has three claims. Claim 1: Product X. Claim 2: Product X for use in medicine. Claim 3: Product X for use in the treatment of asthma. Notice of opposition is duly filed in 2008 citing prior-art document D1 under Art. 54(2) EPC which reveals product X and its therapeutic use in the treatment of pain and more specifically headache. The situation is as follows: According to G 12/91 and J 7/96, published in OJ EPO 1999, 443, the date when the decision to grant the patent was taken is the date the decision to grant was handed over to the EPO postal service, that is 07.12.2007. This means that, as regards medical use-related claims, EP1 is treated under the system applicable before EPC 2000's entry into force on 13.12.2007. Thus, Art. 54(5) EPC does not apply to EP1. Therefore, in the opposition proceedings for EP1, claims 1-3 are no longer acceptable. Claims 1 and 2 are not novel and claim 3 is not in the required \"Swiss-type\" format for a second medical use (G 5/83). The proprietor of patent EP1 would then need to abandon claims 1 and 2 and reformulate claim 3 as: \"Use of product X for the manufacture of a medicament for the treatment of asthma\". It is to be noted that if the date of handing the decision to grant over to the EPO postal service had been 13.12.2007 or later, then Art. 54(5) EPC would have been applicable and in the current example claim 3 of EP1 could have been maintained as granted. Example of conflicting prior art: The mention of grant for a patent EP1 filed on 10.12.2007, designating FR, DE, GB, IT and ES and claiming no priority, is published in the Bulletin in May 2012 and nine months later notice of opposition is filed. One of the novelty objections is raised under Art. 54(3) EPC with regard to a European patent application EP2 published on 18.12.2007, having a valid priority date of 16.06.2006 and validly designating FR, DE and GB. Oral proceedings in this case are held during 2013. The situation is as follows: EP1 was granted in respect of a patent application filed before the date of EPC 2000's entry into force (i.e. 10.12.2007). Consequently, as regards Art. 54(3) EPC, the provisions in force before that date apply. So in this case, Art. 54(4) and Rule 23a EPC 1973 still apply (in 2013). Therefore, EP2 is relevant for novelty only for the designations FR, DE and GB but not for the designations IT and ES. Note that if EP1 had in this case been filed on 13.12.2007, Art. 54(4) and Rule 23a EPC 1973 would no longer be applicable when assessing novelty under Art. 54(3) EPC. Consequently, EP2 would be prior art against the novelty of EP1 as a whole, regardless of any common designations."
        }
    },
    "Chapter VIII – Decisions of the opposition division General remarks on decisions appear in E-X.": {
        "1. ": {
            "title": "Final decisions on an admissible opposition",
            "subsections": {
                "1.1": {
                    "content": "General remarks The opposition division has to take a final decision on the opposition, by revoking the European patent or rejecting the opposition or ruling that the European patent is to be maintained as amended. If the only admissible opposition or all the admissible oppositions are withdrawn and the opposition division takes the view that as the case stands there is no reason for the Office to continue the proceedings of its own motion, the proceedings are closed by means of a formal decision (Rule 84(2), second sentence)."
                },
                "1.2": {
                    "content": "Revocation of the European patent",
                    "subsections": {
                        "1.2.1": {
                            "content": "Revocation on substantive grounds If the opposition division is of the opinion that at least one ground for opposition as set out in Art. 100 prejudices the maintenance of the European patent, it will revoke the patent under Art. 101(2), first sentence. Analogously, if the opposition division is of the opinion that the patent as amended during the course of the opposition proceedings does not meet the requirements of the Convention, it will revoke the patent under Art. 101(3)(b). For revocation because the patent proprietor has not agreed to the text, see D-VI, 2.2 and D-VIII, 1.2.5."
                        },
                        "1.2.2": {
                            "content": "Revocation for failure to pay the prescribed fee for publishing, to file a translation or to file a formally compliant version of amended text passages Under Rule 82(2) in conjunction with (3), if the patent proprietor fails in due time to: (i) pay the prescribed fee for the printing of a new specification of the European patent, (ii) file a translation of the amended claims in the two official languages of the EPO other than the language of the proceedings (see D-VI, 7.2.3), or (iii) file a formally compliant verbatim version of the amended text passages (see E-III, 8.7.3), the European patent will be revoked."
                        },
                        "1.2.3": {
                            "content": "Revocation for failure to notify the appointment of a new representative If opposition proceedings are interrupted according to Rule 142(1)(c) and the patent proprietor, who is not resident in one of the contracting states, does not forward a notification of the appointment of a new representative within the two-month period laid down in Rule 142(3)(a) (see E-VII, 1.4(i)), the European patent will be revoked."
                        },
                        "1.2.4": {
                            "content": "Revocation in the event of requirements not being met until after expiry of time limits In the cases referred to in D-VIII, 1.2.2 and 1.2.3, the European patent will be revoked even if the omitted acts have been completed during the period between expiry of the time limit and the taking of a final decision, unless a request for re-establishment of rights has been filed, in which case a decision must first be given on the request."
                        },
                        "1.2.5": {
                            "content": "Revocation of the patent in the event that the patent proprietor no longer wishes the patent to be maintained as granted If patent proprietors state that they no longer approve the text in which the patent was granted and do not submit an amended text, the patent must be revoked pursuant to Art. 101 (see T 203/14 and T 2405/12). This also applies when the patent proprietor requests the patent to be revoked. If patent proprietors unambiguously declare to the EPO the surrender (or abandonment or renunciation) of the patent, this is interpreted as equivalent to a request that the patent be revoked (see T 237/86). If the request of the patent proprietors is not unambiguous, they are given the opportunity to request that the patent be revoked or to declare that they no longer approve of the patent being maintained as granted. This results in the patent being revoked."
                        }
                    }
                },
                "1.3": {
                    "content": "Rejection of the opposition If the opposition division is of the opinion that the grounds for opposition mentioned in Art. 100 do not prejudice the maintenance of the European patent unamended, it will reject the opposition."
                },
                "1.4": {
                    "content": "Maintenance of the European patent as amended",
                    "subsections": {
                        "1.4.1": {
                            "content": "Taking of a final decision If the opposition division is of the opinion that, taking into consideration the amendments made by the patent proprietor during the opposition proceedings, the patent and the invention to which it relates meet the requirements of the EPC, it will issue an interlocutory decision to maintain the European patent as amended. The procedure specified in D-VI, 7.2.1 to 7.2.3 will precede the final decision."
                        },
                        "1.4.2": {
                            "content": "Statement in the decision of the amended form of the European patent The decision must state which text of the European patent forms the basis for maintaining it."
                        }
                    }
                }
            }
        },
        "2. ": {
            "title": "Other decisions",
            "subsections": {
                "2.1": {
                    "content": "Decision on the inadmissibility of an opposition or intervention See D-IV, 3 and 5.5 with reference to the notice of opposition and D-IV, 5.6 and D-VII, 6 for the intervention of an assumed infringer."
                },
                "2.2": {
                    "content": "Decisions which do not terminate proceedings Such decisions are dealt with in E-X, 3. See D-VI, 7.2.2 with reference to the maintenance of a patent with amended documents."
                },
                "2.3": {
                    "content": "Decision on a notified loss of rights at the request of the person concerned This decision is dealt with in E-VIII, 1.9.3."
                },
                "2.4": {
                    "content": "Decision on re-establishment of rights This decision is dealt with in E-VIII, 3.3."
                },
                "2.5": {
                    "content": "Decision on closure of the opposition proceedings This decision is dealt with in D-VII, 5 and D-VIII, 1.1."
                }
            }
        }
    },
    "Chapter IX – Costs": {
        "1. ": {
            "title": "Charging of costs",
            "subsections": {
                "1.1": {
                    "content": "General principle Each party to the proceedings must bear the costs it has incurred. However, an opposition division may, for reasons of equity, order a different apportionment of such costs, which may have been incurred during the taking of evidence, in oral proceedings or under other circumstances. The phrase \"taking of evidence\" refers generally to the receiving of evidence by an opposition division, whatever the form of such evidence. It includes among other things the production of documents and sworn statements in writing as well as hearing witnesses (see T 117/86)."
                },
                "1.2": {
                    "content": "Decisions on the apportionment of costs Apportionment of costs must be dealt with in the decision on the opposition. This apportionment will form part of the main decision and will be incorporated in the operative part of the decision. The decision will deal only with the obligation on the party or parties concerned to bear costs. The actual amounts to be paid by one party to another must be dealt with in the decision on the fixing of costs (see D-IX, 2). A statement that the parties will bear their own costs may be incorporated in the grounds for the decision on the opposition and must be included in cases where one of the parties to the proceedings has submitted a request for a decision on the apportionment of costs which the opposition division does not consider justified. A decision to apportion costs may be made by the opposition division of its own motion, even if no application for the apportionment of costs has been made. In the absence of an express decision on the apportionment of costs, each of the parties concerned must bear its own costs."
                },
                "1.3": {
                    "content": "Costs to be taken into consideration Apportionment of costs may relate only to those expenses necessary to assure proper protection of the rights involved. Examples of such expenses are: (i) expenditure incurred in respect of witnesses and experts, together with other costs arising in connection with the taking of evidence; (ii) remuneration of the representatives of the parties in respect of oral proceedings or the taking of evidence; (iii) remuneration of the representatives of the parties in respect of undue delaying of the procedure by one of the parties or in respect of the late filing of documents; and (iv) expenditure incurred directly by the parties, i.e. their travel expenses in coming to oral proceedings or the taking of evidence. Costs incurred in respect of superfluous or irrelevant evidence, etc., cannot be apportioned. In the order of apportionment as part of its decision, the opposition division will state the kind of costs to be differently apportioned and reimbursed to the receiving party as clearly and precisely as possible."
                },
                "1.4": {
                    "content": "Principle of equity Reasons of equity will require an opposition division to decide on issuing an order to apportion costs when the costs arise in whole or in part as a result of conduct of one party which is not in keeping with the care required to assure proper protection of the rights involved, in other words when the costs are culpably incurred as a result of irresponsible or even malicious actions. Parties may of course defend their rights or interests (e.g. the proprietors defend their patent) by any legally admissible means within the framework of the opposition proceedings; they may, for example, request oral proceedings or the taking of evidence. Accordingly, costs incurred as a result of default or of inappropriate legal means used by either party may be charged to the party responsible, even if that party has been successful in the opposition proceedings. Situations resulting from \"force majeure\" (such as absence at oral proceedings due to a sudden serious illness) do in general not lead to the apportionment of costs. The following are examples where the principle of equity may be applied: The costs incurred by the opponent in preparing oral proceedings which have been appointed may be charged to patent proprietors if the latter surrender the patent just before the date appointed for the oral proceedings, although it was clear when the proceedings were being arranged, from a document put forward by the opponent, that the patent proprietors had no case and that they alone were therefore liable for their irresponsible conduct. If an aspect of the state of the art is adduced as an argument at a late stage and it can be shown, or it is evident, that the party concerned knew of it earlier, e.g. in that the party in question had made prior use of it, the additional costs of further oral proceedings unnecessarily incurred by the other parties may be charged to the party which caused them by submitting this argument at such a late stage. If relevant facts or evidence are submitted by a party only at a late stage of the proceedings without any good reason and if, as a consequence, unnecessary costs are incurred by another party, the opposition division may decide on the apportionment of costs."
                }
            }
        },
        "2. ": {
            "title": "Procedure for the fixing of costs",
            "subsections": {
                "2.1": {
                    "content": "Fixing of costs by the opposition division The formalities officer is entrusted with fixing the amount of the costs to be paid to the beneficiary at the request of at least one party. The request from a party to the proceedings to fix the costs is admissible only if the decision in which the apportionment of costs was ordered has become final. A list of costs, with supporting evidence in respect of each amount involved, must be attached to the request. Costs may be fixed once their credibility is established. The parties will be notified of the costs as fixed by the formalities officer acting for the opposition division. For an explanation of the duties entrusted to the formalities officers, see D-II, 7."
                },
                "2.2": {
                    "content": "Appeal against the fixing of costs by the opposition division The communication in which the formalities officer has fixed the costs may be reviewed if requested by one of the parties to the proceedings. The opposition division will then issue an appealable decision. The request for such a decision, stating the reasons on which it is based, must be filed with the EPO in writing within one month after the date of notification of the communication in which the costs have been fixed. This request is not deemed to be filed until the fee for the request of a decision to be issued by the opposition division on the costs as fixed has been paid at the rate prescribed in the Rules relating to Fees under the EPC. The opposition division will take a decision on the request without oral proceedings. This final decision by the opposition division can be appealed by each party adversely affected. The appeal will only be admissible if the amount fixed exceeds the appeal fee."
                }
            }
        },
        "3. ": {
            "title": "Enforcement of the fixing of costs Any final decision of the EPO fixing the amount of costs must be dealt with, for the purpose of enforcement in the contracting states, in the same way as a final decision given by a civil court of the state in the territory of which enforcement is to be carried out. Verification of any such decision must be limited to its authenticity.",
            "subsections": {},
            "content": " \"Decision\" as referred to above also covers the final fixing of costs by the opposition division."
        }
    },
    "Chapter X – Limitation and revocation procedure": {
        "1. ": {
            "title": "Introduction The limitation and revocation procedures are centralised ex parte procedures at the level of the EPO which allow the patent proprietor either to have the claims of the granted patent limited or to have the whole patent revoked for all the designated states. More particularly, the limitation procedure offers an opportunity to obtain a limitation of a European patent in a short and straightforward procedure.",
            "subsections": {},
            "content": " Unlike in the opposition procedure, there is no restriction on the period between the grant of the patent and the filing of the request. Accordingly, the request can be filed at any time after grant, after opposition proceedings, or even after expiry of the patent. The examining division is competent to decide on requests for limitation and revocation. However, certain aspects of this procedure are entrusted to formalities officers (see decisions of the President of the EPO dated 12 December 2013, OJ EPO 2014, A6, and 23 November 2015, OJ EPO 2015, A104)."
        },
        "2. ": {
            "title": "Examination for deficiencies in the request",
            "subsections": {
                "2.1": {
                    "content": "Deficiencies which lead to the request being deemed not to have been filed On receipt of a request for revocation or limitation of a patent, the formalities officer will examine whether: (i) the request is filed with the EPO (Art. 105a(1)) (ii) opposition proceedings in respect of the patent are not pending at the time of filing the request (Art. 105a(2) and Rule 93(1)) (iii) the relevant fee is paid (Art. 105a(1) and Art. 2(1), item 10a, RFees) (iv) where the request is filed in a language according to Art. 14(4), the translation has been filed in due time (Rule 6(2)) (v) where the requester is required by Art. 133(2) to appoint a representative, this was done in due time (Rule 152 (3) and (6)). If any of these requirements are not met, the request is deemed not to have been filed. This finding is notified to the requester (Art. 119), and the fee is refunded. Otherwise, the request is considered to have been filed, and the limitation/revocation procedure commences."
                },
                "2.2": {
                    "content": "Deficiencies which, if not remedied, lead to the request being rejected as inadmissible The formalities officer will furthermore examine whether: (i) the request is filed in writing (Rule 92(1)) (ii) the request includes the particulars of the requester required by Rule 92(2)(a), referring to Rule 41(2)(c) (iii) the request indicates in which contracting states the requester is the patent proprietor (Rule 92(2)(a)) (iv) the request indicates the number of the patent to be limited or revoked (Rule 92(2)(b)) (v) the request indicates in which contracting states the patent has taken effect, even if in the meantime it has lapsed in one or more of those contracting states (Rule 92(2)(b)) (vi) in cases (iii) and (v), and if the requester is not the patent proprietor for all these contracting states, the requester provides the names and addresses of the other patent proprietors, and evidence of entitlement to act on their behalf (Rule 92(2)(c)); due to the retroactive effect of a limitation/revocation (Art. 68), such evidence is required also in the case where the patent has lapsed in one or more of the contracting states referred to under (v) in the meantime. Note that in the case of joint patent proprietors, whether for the same or different contracting states, the requirements of Rule 151 for appointment of a common representative also apply in the limitation or revocation procedure (see A-VIII, 1.3) (vii) where limitation is sought, the request includes the complete version of the amended claims (and of the description and drawings where applicable) (Rule 92(2)(d)) (viii) if the requester has appointed a representative, the particulars according to Rule 41(2)(d) (Rule 92(2)(e)) have been filed. If any of the above requirements are not met, the requester is invited to correct the deficiencies within a period to be specified. If the deficiencies are not corrected within this period, the request is to be rejected as inadmissible. This decision is notified to the requester (Art. 119). Re-establishment of rights under Art. 122 is, however, available. The decision rejecting the request is open to appeal (Art. 106(1)). Otherwise, the request is deemed admissible."
                }
            }
        },
        "3. ": {
            "title": "Decision on request for revocation If the request is for revocation, and is admissible, the examining division will revoke the patent and communicate this to the requester (Art. 105b(2) and Rule 95(1)). The decision takes effect on the date on which it is published in the Bulletin (Art. 105b(3)). In accordance with Art. 68, the effect of the decision is that the patent is revoked ab initio, conferring no rights under Art. 64 or 67. As stated in Art. 105b(3), the decision applies to all contracting states in respect of which the patent was granted. It is not possible for the patent to be revoked only for some contracting states, and not for others.",
            "subsections": {}
        },
        "4. ": {
            "title": "Substantive examination (limitation)",
            "subsections": {
                "4.1": {
                    "content": "Department responsible If a request for limitation is deemed to be admissible, then the file will be forwarded to the examining division, as the department responsible for the examination of the request."
                },
                "4.2": {
                    "content": "Basis for the examination The basis for the examination is the patent as granted or amended in opposition or limitation proceedings (Rule 90). In cases in which there have already been both opposition and limitation procedures, or more than one limitation procedure, the basis for the examination is the patent as amended in the most recent of those procedures. The requester has the option of providing information (with the request, or later in the procedure) as to why the request is allowable, and/or as to the purpose behind the request, but there is no obligation to do so. The purpose underlying the request is, however, of no relevance to the question whether it is allowable."
                },
                "4.3": {
                    "content": "Scope of the examination The scope of the examination is limited by Rule 95(2). The examining division is required to decide only whether the amended claims of the request constitute a limitation with respect to the claims as granted or amended (i.e. those referred to in D-X, 4.2), and whether the amended claims comply with the requirements of Art. 84 and Art. 123(2) and (3). The term \"limitation\" is to be interpreted as meaning a reduction in the extent of protection conferred by the claims. Mere clarifications or changes made to protect a different subject (\"aliud\") are not to be considered as limitations. More particularly, the limitation of a dependent claim only, without any independent claim being limited, is acceptable. However, it is not permissible to introduce non-limiting amendments in the description or in the claims that are not a consequence of the limitation of the claims (for example tidying up unclear claims, making amendments to improve the patent or cosmetic changes). Likewise, adding dependent claims in limitation is not permissible if not directly caused by the limitation introduced in the claims. Amendments in a claim leading to a scope of protection which is smaller but falls partly outside the extent of protection conferred by the claim previously on file must be dealt with cautiously. Even if the amendment constitutes a limitation, such a claim would generally contravene Art. 123(3) (see also H-V, 7, for Art. 123(3) in the case of a change of category of a claim). For interpretation of Art. 84 and Art. 123(2), see F-IV, 4 and H-IV, 5.4. The description and drawings are used to interpret the claims in accordance with Art. 69(1) and its Protocol on Interpretation. Amendments made to these parts might therefore introduce matter contrary to Art. 123(3) (see H-IV, 3.1 and 3.3). For the admissibility of a request for correction under Rule 139 of the documents making up the patent, see H-VI, 2.1.1. The filing of auxiliary requests together with a main request is possible (see H-III, 3)."
                },
                "4.4": {
                    "content": "Further stages of the examination If the examination under D-X, 4.3 above leads to the conclusion that the request is allowable, then the next stage of the procedure – the establishment of the formal requirements for limitation as described under D-X, 5 can begin. Otherwise, in accordance with Rule 95(2), a communication must be sent to the requester identifying the deficiencies and giving the opportunity to correct them within a period to be specified. The normal period is two months (Rule 132(2)). It is, in principle, extendable, but only under exceptional circumstances. The division may not adapt the description of its own motion (see D-X, 5). In the case of discrepancy between the claims and the description, an objection will always be raised. If the requester responds in due time in a manner such that no objections remain, then the procedure continues as in D-X, 5. Rule 95(2) provides for only one opportunity to make amendments during limitation. However, if the response to the communication under Rule 95(2) overcomes the objections raised in that communication, but gives rise to new objections, the fundamental principle of the right to be heard under Art. 113(1) will normally make a further communication necessary in order to communicate the new objections to the requester before the decision to reject the request for limitation is issued (see D-X, 6). Normally, no further amendments may be made in reply to that communication. Rule 95(2) specifies that the examining division must give the requester one opportunity to correct the deficiencies. However, any request for oral proceedings according to Art. 116 will be granted if the division does not consider the request for limitation to be allowable. No further amendments may be submitted during oral proceedings if the opportunity to make amendments has already been taken."
                },
                "4.5": {
                    "content": "Third-party observations during the examination Art. 115 explicitly covers all proceedings before the EPO, not just pre-grant proceedings. Accordingly, its provisions also apply in principle to revocation and limitation proceedings. Patentability under Art. 115 is to be interpreted in a broader sense, so that issues relating to Art. 84 and Art. 123(2) may also be taken into consideration. Requesters could, when responding to an invitation under Rule 95(2), introduce further restrictions intended to address such observations. If they wish to do this, and no invitation under Rule 95(2) is issued, their only option is to file a further request for limitation."
                }
            }
        },
        "5. ": {
            "title": "Formal procedure for limitation when the request is allowable If the request for limitation is allowable, then according to Rule 95(3) the examining division must communicate this to the requesters and invite them to pay the prescribed fee and file translations of the amended claims into the other two official languages within a period of three months.",
            "subsections": {},
            "content": " The nature of the communication under Rule 95(3) inviting the requester to pay the prescribed fee and file translations of the claims is different from the communication of the intention to grant during examination proceedings under Rule 71(3). During limitation, the text filed by the requester is deemed to be approved, whereas at this stage in examination the text is a version proposed to the applicants and subject to their approval. Once the communication under Rule 95(3) is received, the requester can only pay the fee and file the translations or have the request rejected for failure to do so. Therefore, the examining division may not, with the communication under Rule 95(3), make amendments of its own motion to the claims of a request for limitation in order to render them allowable or adapt the description of its own motion to the limited claim(s). The provisions of Art. 113 would not be met, since the requester does not have an opportunity to contest or comment on the amendments made. As in opposition proceedings, the requester benefits from a two-month period of grace for reply with payment of a surcharge (Art. 2(1), item 9, RFees). Reestablishment of rights is available. If the requester pays the fee and files the required translations in due time, the examining division will decide to limit the patent (Art. 105b(2) and Rule 95(3), last sentence). This takes effect on the date on which the mention of the decision is published in the Bulletin. As soon as possible after this, the amended specification will be published by the EPO. The form of publication of the amended patent specification is defined in Rule 96, Rule 73(2) and (3) and Rule 74. The procedure for this is the same as in opposition proceedings. As for revocation (see D-X, 3), the effect of the decision to limit the patent is that the patent is limited ab initio."
        },
        "6. ": {
            "title": "Rejection of the request If:",
            "subsections": {},
            "content": " (i) the requester does not respond in due time to the invitation under Rule 95(2) (see D-X, 4.4 above); or (ii) the requester responds in due time, but the request is still not allowable; or (iii) the requester fails to pay the fee(s) and file the translation according to Rule 95(3) (see D-X, 5 above), then the examining division will reject the request (Art. 105b(2), last sentence and Rule 95(4)), provided the requirements of Art. 113(1) are met (see D-X, 4.4). The decision to reject the request will be notified in accordance with Art. 119 to the requester. In case (ii), the decision is a reasoned decision taken by the examining division and is subject to appeal."
        },
        "7. ": {
            "title": "Relation to opposition proceedings",
            "subsections": {
                "7.1": {
                    "content": "Precedence of opposition proceedings The case in which opposition proceedings are already pending when the request for revocation or limitation is filed has been mentioned in D-X, 2.1. In the opposite case, i.e. where an opposition is filed while revocation or limitation proceedings are pending, the procedure depends on whether the pending proceedings relate to a request for revocation or for limitation. According to Rule 93(2), if the pending proceedings relate to a request for limitation, the examining division will terminate those proceedings and order the reimbursement of the limitation fee. The limitation procedure is terminated on the day the decision on the limitation procedure is handed over to the internal EPO postal service. If the requester has already paid the fee referred to in Rule 95(3) (see D-X, 5), this fee will also be refunded. The opposition procedure will then continue in the normal manner. The decision to terminate the limitation proceedings is notified to the requester (Art. 119). Rule 93(2) is restricted to limitation proceedings. Therefore, in the case of revocation proceedings, there is no precedence of opposition. Revocation proceedings continue after an opposition is filed, and the case proceeds to opposition only if the request for revocation is deemed not to have been filed, is rejected as inadmissible or is withdrawn. Otherwise, if the patent is revoked, the opponent(s) will be informed of this situation and the opposition proceedings will be terminated."
                },
                "7.2": {
                    "content": "Filing of opposition after decision on limitation On rare occasions it may happen that the limitation procedure is finished before an opposition is filed within the nine-month period and the decision to limit has already been published in the European Patent Bulletin. In such cases the opponent does not benefit from a new nine-month period, since the opposition period runs only once from publication of the mention of the grant of the patent. Accordingly, the opponent will not have a full nine- month period to formulate the opposition for the patent as limited."
                }
            }
        },
        "8. ": {
            "title": "Legal status of decisions The decisions rejecting the request for limitation or revocation as either inadmissible or not allowable (see D-X, 2 and 6) are open to appeal, as they are decisions of the examining division terminating a procedure.",
            "subsections": {},
            "content": " Accordingly, they are decisions listed as such in Art. 21(3)(a)."
        },
        "9. ": {
            "title": "Withdrawal of the request In the absence of any provision to the contrary and in accordance with normal legal principles, the requester may withdraw the request for limitation or revocation at any time, provided that the request is still pending. In this case, however, the limitation or revocation fee will not be refunded.",
            "subsections": {}
        },
        "10. ": {
            "title": "Different sets of claims Art. 105b(3) specifies that the decision to limit or revoke will apply to the patent in all contracting states for which it has been granted. There is thus a single decision, covering all contracting states, but this decision may include different sets of claims for different contracting states, or determine that the limitation is in other ways different for different contracting states.",
            "subsections": {
                "10.1": {
                    "content": "Limitation results in the claims becoming different in different contracting states The limitation could result in the claims becoming different in different contracting states if the requester wishes to restrict the claims with respect to one or more, but not all, contracting states in order to avoid conflict with national prior rights. Such different sets of claims can be allowed, provided that the substantive requirements are met for all sets for which the requester is seeking an amendment. It follows from Rule 138 that a prerequisite for the introduction of different claims for different contracting states during the limitation procedure is that requesters inform the EPO of the existence of the national prior rights when filing the different sets of claims. If they file different sets of claims without informing the EPO of the national prior rights, then the request is to be refused under Art. 105b(3) and Rule 138. For applications filed on or after 13.12.2007, different sets of claims can no longer be justified on the basis of prior art under Art. 54(3) (for transitional provisions, however, see D-VII, 8)."
                },
                "10.2": {
                    "content": "Limitation is different for different contracting states because the claims as granted were different for different contracting states The limitation is different in different contracting states because the claims forming the basis of the limitation procedure were different in different contracting states. This situation would occur where the patent has different claims for different contracting states, e.g. because of national prior rights or prior art under Art. 54(3) (for patents granted before 13.12.2007 or for patents granted in respect of European patent applications pending at that time), or where under Art. 61 a partial transfer of rights has taken place (Rule 18(2)). The requester might wish to apply a limitation already introduced for one or more contracting states to the other contracting states, or to bring the claims into line with each other for a different reason. If this results in a single set of claims for all contracting states, and the substantive requirements are met separately for each different set of original claims, then the request would be allowable. Note that it would also be possible that the circumstances of this paragraph and paragraph D-X, 10.1 coexist in a single request."
                }
            },
            "content": " Such situations could arise in two different sets of circumstances."
        },
        "11. ": {
            "title": "Multiple requests Rule 90 defines that the basis for the request can be the claims as amended in limitation proceedings, thus providing for multiple subsequent requests, i.e. a request for limitation or revocation following one or more earlier requests for limitation.",
            "subsections": {}
        }
    }
}