{
    "Chapter II – Formal requirements to be met before the division starts substantive examination": {
        "1. ": {
            "title": "Request for examination For examination of a European patent application to begin, the applicant must file a request for examination and pay the examination fee. The request for examination, which is not deemed filed until after the examination fee's payment, may be filed in the period between the application's filing date and the last day of the six months after the date on which the European Patent Bulletin mentions the European search report's publication (see A-VI, 2.1). If the request for examination is not filed within this period, the application is deemed withdrawn. However, in such a case, the applicant can file a request for further processing pursuant to Art. 121.",
            "subsections": {
                "1.1": {
                    "content": "Confirmation of the intention to proceed further with the application If the applicant files a request for examination before the search report is sent to them, the EPO will invite them to confirm, within a six-month period, that they wish to proceed with their application. This six-month period is calculated from the mention of the European search report's publication in the European Patent Bulletin. Where the applicant also has to respond to the search opinion, their response is required within this same period (see B-XI, 8 and C-II, 3.1). In such a case, the applicant's response to the search opinion is interpreted as the confirmation required by Rule 70(2), even where not explicitly expressed as such. If they fail to confirm their wish to proceed with the application in due time in reply to this invitation, the application will be deemed withdrawn. In this case, however, the means of redress provided for in Art. 121 (further processing of the application) will apply (see A-VI, 2.3 and E-VIII, 2). For the conditions applicable to a refund of the examination fee if the application is withdrawn, refused or deemed withdrawn, see A-VI, 2.5."
                },
                "1.2": {
                    "content": "Euro-PCT applications For applications filed via the PCT route (Euro-PCT application), the six-month period under Rule 70(1) begins with the publication of the PCT search report or the declaration under Art. 17(2)(a) PCT. However, as is laid down in Art. 150(2), the time limit for requesting examination of a Euro-PCT application does not expire before the time prescribed in Art. 22 PCT and Art. 39 PCT (i.e. not before the time limit of Rule 159(1)(f)). The time limit will not be affected by whether a supplementary European search pursuant to Art. 153(7) needs to be made or whether the international application is again published by the EPO pursuant to Art. 153(4). If the request for examination of a Euro-PCT application has not been filed within the time limit, the application is deemed withdrawn under Rule 160(1). In such a case, however, the applicant can file a request for further processing pursuant to Art. 121 (see E-VIII, 2). Where the Euro-PCT application is subject to the preparation of a supplementary European search report (see B-II, 4.3), once this report has been dispatched, a communication under Rule 70(2) is sent to the applicant inviting them to confirm the request for examination within six months of that communication's notification (see E-IX, 2.5.3)."
                },
                "1.3": {
                    "content": "Invention to be examined Where the search report and the search opinion have been drawn up to cover several inventions lacking unity, the applicant is free to select the invention to be examined in the application under consideration (see also C-III, 3.2). The others will be subject to objections of lack of unity and may be divided out according to Rule 36 (see C-III, 3.3 and C-IX, 1.3)."
                }
            },
            "content": " The amount of the further processing fee to be paid depends on how many and which of the actions required for a valid request for examination have been omitted (see E-VIII, 2). According to Rule 70(1), the request for examination may not be withdrawn. Subject to certain exceptions, the applicant must also respond to the search opinion within the above period for filing the request for examination (see B-XI, 9 and C-II, 3.1) unless the EPO invites them to confirm an early request for examination according to Rule 70(2), in which case they must respond to the search opinion within the period provided for under Rule 70(2) (see C-II, 1.1). Responsibility for examining the application passes from the Receiving Section to the examining division when a request for examination is filed. This is subject to two exceptions: (i) if the applicant files a request for examination before the European search report is sent to them, then the examining division is responsible only from the time when the EPO receives the applicant's response to the invitation to confirm under Rule 70(2) (ii) if the applicant, having waived the right to receive an invitation to confirm under Rule 70(2) (see C-VI, 3), files a request for examination before the European search report is sent to them, then the examining division is responsible only from the time when the search report is sent to the applicant."
        },
        "2. ": {
            "title": "Allocation of the application Dossiers are normally allocated to an examining division that is responsible for examining applications in the technical field in which the particular application was classified by the search division or ISA that carried out the search. It is usual for the first member entrusted with the examination of the application in accordance with Art. 18(2) to be the same person who prepared the (supplementary) European search report and search opinion or, where the EPO was the ISA or the authority specified for the supplementary international search, the international search report and WO-ISA or the supplementary international search report.",
            "subsections": {},
            "content": " There may, however, be instances where it is appropriate to allocate the application to an examining division comprising examiners who are not normally responsible for the indicated part of the International Patent Classification (IPC) and who might not have been involved at the search stage. There are a number of possible reasons for this: e.g. to make it possible, where appropriate, that a parent and a divisional application are dealt with by the same examining division (this could sometimes be more efficient, even when the two applications are classified in different technical fields); or if the classification of the published application does not correspond to the subject-matter of the application in the form in which it reaches the substantive examiner (e.g. because the application has been amended after receipt of the search report and search opinion)."
        },
        "3. ": {
            "title": "Response filed before first communication in examination",
            "subsections": {
                "3.1": {
                    "content": "Response to the search opinion Following receipt of the search report and search opinion, and prior to the first communication from the examining division, the applicant must (subject to certain exceptions) respond to the search opinion by filing amendments to the description, claims or drawings and/or filing observations on the objections raised in the search opinion (see B-XI, 8 for details, in particular as to the exceptions where no reply is required). To avoid delays, care should be taken to comply with the requirements of Rule 137(4) when filing such amendments (see OJ EPO 2009, 533, point 7). Any amendments filed at this stage are made voluntarily by the applicant in accordance with Rule 137(2) (for more details, see C-III, 2.1). The applicant's response to the search opinion required by Rule 70a (or filed voluntarily in response to search opinions not requiring a response) will be taken into account by the examining division when drafting the first communication. Failure to respond to this communication in due time will result in the application being deemed withdrawn according to Art. 94(4), although this loss of rights is subject to further processing (see E-VIII, 2). With regard to what constitutes a valid response, see B-XI, 8. If the applicant accepts a search division's suggestion regarding an acceptable form of amendment of the claims to overcome the objections raised (see B-XI, 3.8), they are requested to adapt the description to the claims on file and delete or amend any statements or expressions throwing doubt on the scope of protection (see F-IV, 4.3). In exceptional cases, the examining division may decide to issue a summons to oral proceedings as the first action in examination proceedings (see C-III, 5). In such a case, the applicant's response to the search opinion will be taken into account when drafting the annex to the summons. If the European search report or supplementary European search report was accompanied by a search opinion but was drawn up before 1 April 2010 (such that a reply to the search opinion was not mandatory, see B-XI, 8) and the applicant did not reply to it, a communication referring to the search opinion and setting a time limit for reply is issued as the first communication under Art. 94(3). Failure to respond to this communication in due time results in the application being deemed withdrawn according to Art. 94(4). The procedure explained in the above paragraphs also applies to Euro-PCT applications for which the EPO prepares a supplementary European search report and a search opinion (see B-II, 4.3 and B-XI, 1.1)."
                },
                "3.2": {
                    "content": "Response to PCT actions prepared by the EPO For Euro-PCT applications where the EPO acted as the International Searching Authority (ISA) and, where a demand under Art. 31 PCT was filed, also as the International Preliminary Examining Authority (IPEA) or the Supplementary International Searching Authority (SISA), the applicant will already have responded to a negative WO-ISA, IPER or supplementary international search report prepared by the EPO (unless the communication under Rule 161 was issued before 1 April 2010 – see E-IX, 3.3.3). This response may comprise amendments and/or observations filed in response to the communication under Rule 161(1) (or possibly filed earlier – see E-IX, 3.3.1). If the applicant accepts the search division's suggestion regarding an acceptable form of amendment of the claims to overcome the objections raised (see PCT-EPO Guidelines, B-XI, 3.3), they are requested to adapt the description to the claims on file and delete or amend any statements or expressions throwing doubt on the scope of protection (see F-IV, 4.3). Any amendments filed at this stage are made voluntarily by the applicant in accordance with Rule 137(2) (for more details see C-III, 2.2). This response will be taken into account by the examining division when drafting the first communication under Art. 94(3) or, in exceptional cases, the annex to the summons to oral proceedings (C-III, 5). For more details, see E-IX, 4.1, E-IX, 4.2 and E-IX, 4.3."
                },
                "3.3": {
                    "content": "The invitation under Rule 70a(1) Under Rule 70a(1), the applicant is invited to respond to the European search opinion (ESOP) within the period referred to in Rule 70(1) or, where applicable, the period referred to in Rule 70(2) (see B-XI, 8) unless they have waived their right to receive the communication under Rule 70(2) (see C-VI, 3). Where the request for examination (including payment of the examination fee) is filed after the search report has been transmitted to the applicant, the applicant must respond to the ESOP within the period referred to in Rule 70(1). In such cases, the invitation under Rule 70a(1) is sent in a combined communication with the communication under Rule 69(1) (see A-VI, 2.1). This communication under Rule 70a(1) and Rule 69(1) is issued shortly after the mention of the European search report's publication in the European Patent Bulletin (in general, this is approximately one week later). Where the request for examination (including payment of the examination fee) is filed before the search report has been transmitted to the applicant, the applicant must respond to the ESOP within the period referred to in Rule 70(2). In such cases, the invitation under Rule 70a(1) is sent in a combined communication with the communication under Rule 70(2). With regard to how the period referred to in Rule 70(2) is calculated for these cases, see C-II, 1.1 for Euro-direct applications and C-II, 1.2 for Euro-PCT applications for which a supplementary European search report is prepared."
                }
            }
        },
        "4. ": {
            "title": "Designation fees, extension and validation fees Under Rule 39(1), the designation fees can be validly paid up to the same time limit as the examination fee and therefore will be generally paid at the same time as the examination fee. The examination of whether and to what extent a designation fee has been validly paid has been entrusted to the formalities officer under Rule 11(3); see the decision of the President of the EPO dated 12 December 2013, OJ EPO 2014, A6; OJ EPO 2015, A104.",
            "subsections": {},
            "content": " The same applies to the examination of whether extension or validation fees have been paid; see A-III, 12.2."
        },
        "5. ": {
            "title": "Copy of the search results on the priority or priorities If, when the examining division assumes responsibility, the EPO notes that a copy of the results of a search on the claimed priority or priorities as referred to in Rule 141(1) has not been filed by the applicant and is not deemed duly filed under Rule 141(2) (see A-III, 6.12), it invites the applicant to file, within a period of two months, the copy or a statement that the results of the search referred to in Rule 141(1) are not available to them.",
            "subsections": {},
            "content": " This requirement applies to European or Euro-PCT applications filed on or after 1 January 2011 (see OJ EPO 2009, 585). This communication is also sent in cases where the priority in question has since been withdrawn or has lapsed. Failure to reply to this invitation in due time results in the application being deemed withdrawn. Further processing is available for this loss of rights (see E-VIII, 2). The search results provided by the applicant will be included in the file and will be open to file inspection (see A-XI)."
        }
    },
    "Chapter III – The first stage of examination": {
        "1. ": {
            "title": "Missing parts or elements",
            "subsections": {
                "1.1": {
                    "content": "European patent applications",
                    "subsections": {
                        "1.1.1": {
                            "content": "Application documents filed under Rule 56 or Rule 56a Where the applicant has supplied missing drawings or parts of the description after the accordance of a filing date (see A-II, 5) under Rule 56 and the Receiving Section has determined that the missing drawings or parts of the description are \"completely contained\" in the claimed priority application, the application is not redated to the date on which the missing drawings or parts of the description were supplied. The same applies to correct application documents or parts filed after the accordance of a filing date (see A-II, 6) under Rule 56a. The examining division may review the findings of the Receiving Section on the applicability of Rule 56(3) and Rule 56a unless there has been a decision of a board of appeal. Normally this review will have been initiated at the search stage (see B-III, 3.3.1 and B-XI, 2.1). However, it can still be started during substantive examination. For the criteria for determining whether the \"completely contained\" requirement of Rule 56(3) and Rule 56a is satisfied, see A-II, 5.4.2 and A-II, 6.4.1 respectively. Should the examining division conclude, contrary to the original finding of the Receiving Section, that the missing elements are not \"completely contained\" in the priority document, it will raise an objection under Rule 56 or Rule 56a in the first communication under Art. 94(3), presenting detailed arguments as to why the \"completely contained\" requirement is not satisfied. In addition, it will warn that non-compliance with the requirements of Rule 56(3) or Rule 56a(4) as applicable can result in redating, which in turn can lead to loss of a priority right if the redating causes the filing date to be more than 12 months after the claimed priority date. Note that if the review was initiated at the search stage and an objection under Rule 56 or Rule 56a was raised in the extended European search report (EESR), the applicant may already have submitted a response to the search opinion (required by Rule 70a or filed voluntarily in response to a search opinion not requiring a response). The examining division will treat this response in the same manner as the reply to the first communication. If the applicant replies by withdrawing the missing parts or the subsequently filed correct application documents or parts, the examination will continue as normal with the original filing date, but without the missing parts or the correct application documents or parts (see also A-II, 5.5 and F-III, 10). If the applicant succeeds in arguing in their reply that the \"completely contained\" requirement is satisfied, the examination will continue as normal with the missing parts or the subsequently filed correct application documents or parts, as the case may be, and with the original filing date. If the applicant maintains the missing parts or the subsequently filed correct application documents or parts and their arguments do not succeed, the examining division will issue a further communication under Art. 94(3) informing them of the application's impending redating to the date on which the EPO received the missing parts or the correct application documents or parts. This communication gives the applicant a further opportunity to withdraw the subsequently filed missing parts or the correct application documents or parts within a time limit of two months (Rule 132(2)) so as to restore the original filing date or to request an appealable decision on the redating. It indicates the reasons why the \"completely contained\" requirement is not met and also deals with any counter-arguments presented by the applicant. If the applicant does not reply to the above communication in due time, the application is deemed withdrawn (Art. 94(4)). If the applicant opts to withdraw the subsequently filed missing parts or the correct application documents or parts, the redating of the application will be deemed not made (see also B-XI, 2.1). The examiner will continue the examination procedure as normal with the original filing date but without missing parts and/or the correct application documents or parts (see also F-III, 10). If the applicant does not agree with the finding, they may (within two months (Rule 132(2)) request an appealable decision on the matter. In this case, the examining division will issue a reasoned decision informing them of the new filing date, the reasons for the redating and (where appropriate) the detrimental effect of the redating on the claimed priority right. This decision will allow a separate appeal according to Art. 106(2). Once the period for filing an appeal has expired without an appeal being filed, the examiner will resume examination on the basis of the new filing date. Note that the EESR may contain documents that could become relevant as a result of the redating. If the applicant files an appeal in due time, the file passes to a board of appeal to review the decision on the filing date's accordance. The examining division will not continue substantive examination while the case is pending before the board. Once the board has issued a decision, the file will be returned to the examining division, which will be bound on this point by the board's decision (Art. 111(2)). It will then resume examination on the basis of the filing date fixed by the board."
                        },
                        "1.1.2": {
                            "content": "Claims filed after accordance of a date of filing If the claims were not present at the application's filing date, the examining division must check whether the subsequently filed claims satisfy the requirements of Art. 123(2). If the basis for these subsequently filed claims in the application as filed has not been indicated by the applicant (see H-III, 2.1) and the application is one of those mentioned in H-III, 2.1.4, the examining division may send the applicant a communication under Rule 137(4) requesting this information (see H-III, 2.1.1)."
                        }
                    }
                },
                "1.2": {
                    "content": "Euro-PCT applications – missing elements and parts filed under Rule 20.5 and 20.6 PCT In the case of PCT applications, missing drawings and parts of the description, but also missing claims, may have been filed at the receiving Office for international applications under Rules 20.5 and 20.6 PCT, and its finding can be reviewed in accordance with Rule 82ter.1 PCT. The examining division will review this finding in all cases in which the filing date was retained on the basis of the \"completely contained\" requirement using the same criteria as applied when assessing compliance with Rule 56(3) (see A-II, 5.4.2). If either the EPO acted as the ISA or a supplementary EESR has been issued, this review will normally have been initiated at the search stage (see B-III, 3.3.1 and B-XI, 2.1). However, it can still be started during substantive examination. The procedure is the same as for European patent applications (see C-III, 1.1.1)."
                },
                "1.3": {
                    "content": "Euro-PCT applications – erroneous elements filed under Rule 20.5bis PCT Rule 20.5bis PCT allows applicants to correct an erroneously filed element (description or claims) or part of the description, claims or drawings (including all drawings) contained in an international application. Incorporations by reference by the receiving Office under Rule 20.5bis(d) PCT, i.e. without changing the filing date, are effective before the EPO as designated or elected Office for international applications filed on or after 1 November 2022. For details, see the notice from the EPO dated 23 June 2022, OJ EPO 2022, A71. On entry into the European phase, the normal procedures apply on the basis that the correct and erroneously filed parts are thus part of the application as filed (see E-IX, 2). For international applications filed between 1 July 2020 and 31 October 2022, the provisions under Rule 20.5bis(d) PCT remain not fully applicable (see the notice from the EPO dated 14 June 2020, OJ EPO 2020, A81). The EPO adopts the following practice in respect of those applications: corrections accepted by the receiving Office during the international phase under either Rule 20.5bis(b) PCT or Rule 20.5bis(c) PCT – i.e. where it accorded the date of receipt of the correct application documents or a later date as the filing date of the application or shifted the initial filing date of the application to the date of receipt of the correct application documents – will be effective in proceedings before the EPO as designated/elected Office (see OJ EPO 2020, A81). However, if the receiving Office considered the correct application documents to be incorporated by reference under Rule 20.5bis(d) PCT, i.e. without changing the filing date, this incorporation will not be effective in proceedings before the EPO as designated/elected Office. In such cases, the EPO will, on entry into the European phase, consider the filing date of the application to be the date on which the correct application documents were received (Rule 20.8(c) PCT and Rule 20.5bis(b) or (c) PCT). Furthermore, it will consider the application as filed to include the correct application documents but not the erroneously filed ones. The EPO will inform the applicant about this in a communication under Rules 20.8(c) PCT and 82ter.1(c) and (d) PCT, setting a time limit of two months for reply. (i) If, within the time limit, the applicant requests that the correct application documents be disregarded under Rule 82ter.1(d) PCT, the EPO will issue an interlocutory decision changing the filing date to the date initially accorded by the receiving Office and confirming that the procedure before the EPO as designated/elected Office will be based on the application documents as filed on that date. (ii) If the applicant files observations with regard to the communication under Rule 20.8(c) PCT and Rule 82ter.1(c) and (d) PCT within the time limit set, the EPO will also issue an interlocutory decision taking into account the observations made. (iii) If the applicant does not file observations and does not request that the correct application documents be disregarded, an interlocutory decision will not be issued. In this case, the EPO will stick to its findings. Applicants interested in avoiding this procedure, namely the issuing of the communication under Rules 20.8(c) PCT and 82ter.1(c) and (d) PCT and the setting of a time limit of two months for reply, may make use of the abridged procedure. According to it, they may, within the 31-month time limit under Rule 159(1), at the time of validly requesting early processing or, at the latest, before the communication under Rules 20.8(c) and 82ter.1(c) and (d) PCT is issued: (a) request that the EPO disregard the correct application documents. In that case, no such communication but an interlocutory decision will be issued. This decision will confirm that the application maintains the initial filing date and that the correct application documents will be disregarded in the procedure before the EPO as designated/elected Office. (b) confirm that they wish to pursue the application with the filing date corresponding to the date of receipt of the correct application documents and with those correct application documents. In that case, no invitation and no interlocutory decision will be issued. The EPO will correct the filing date and consider the erroneously filed application documents not to have been filed. The applicant will be informed accordingly. Once the procedure described above has been finalised, a communication under Rules 161 and 162 will be issued and the applicant may amend the application within the scope of the disclosure on the filing date as determined in this procedure. As a consequence of the procedure described above, it may happen that the application documents as originally filed differ from those forming the basis for the search in the international phase. If the EPO acted as ISA, the examiner has to check carefully whether the invention forming the basis for the European phase was covered by a search in the international phase. If this is not the case, an invitation under Rule 164(2) will be issued (see C-III, 3.1). If the subject-matter forming the basis for European phase processing is covered by the international search report, then examination continues as usual but taking into account that the potential change of the filing date might have an impact on intermediary documents cited in the international search report and that the priority might not be valid anymore. For more details and examples, see OJ EPO 2020, A81."
                }
            }
        },
        "2. ": {
            "title": "Amendments made by applicants of their own volition Any amendment, including any made by the applicant of their own volition, must satisfy the following conditions:",
            "subsections": {
                "2.1": {
                    "content": "Amendments made in response to the search opinion The amendments referred to in C-II, 3.1 are made by the applicant of their own volition (the applicant is required to respond to the search opinion in the EESR but does not necessarily have to respond by filing amendments; they can also respond by filing observations on the search opinion - see B-XI, 8). This means that the applicant is not restricted to amendments necessary to remedy a defect in the application. Further amendments may be made only with the consent of the examining division (see H-II, 2.3)."
                },
                "2.2": {
                    "content": "Amendments made in response to the WO-ISA, IPER or supplementary international search report For Euro-PCT applications where the EPO acted as ISA or SISA, any amendments filed in response to the communication under Rule 161(1) (see E-IX, 3.3.4) are made by the applicant of their own volition. This means they may be submitted to overcome objections raised in the WO-ISA, IPER or supplementary international search report or they may be suggested for some other reason, e.g. to remedy some lack of clarity that the applicant has noted in the original documents. In order to avoid delays, care should be taken to comply with the requirements of Rule 137(4) when filing such amendments. Furthermore, the applicant may also file observations in place of or in addition to amendments."
                }
            },
            "content": " (i) it must not add subject-matter to the content of the application as filed (see H-IV, 2.3 and H-V, 1 to H-V, 7); (ii) it must not itself cause the application as amended to be objectionable under the EPC, e.g. the amendment must not introduce a lack of clarity into the claims (Art. 84); and (iii) it must comply with Rule 137(5) (see H-IV, 4.1). If the amendments do not meet these conditions, the applicant should be told that the amended application cannot be allowed. Apart from the amendments referred to in C-III, 2.1 and 2.2, which are admissible under Rule 137(2), the applicant may correct obvious errors at any time (see H-VI, 2.2.1). If the applicant makes amendments but does not identify them and/or indicate their basis in the application as filed (see H-III, 2.1) and the application is one of those mentioned in H-III, 2.1.4, the examining division may send the applicant a communication under Rule 137(4) requesting this information (see H-III, 2.1.1). If the applicant accepts a search division's suggestion regarding an acceptable form of amendment of the claims to overcome the objections raised (see B-XI, 3.8), they are requested to adapt the description to the claims on file and delete or amend any statements or expressions throwing doubt on the scope of protection (see F-IV, 4.3)."
        },
        "3. ": {
            "title": "Unity of invention",
            "subsections": {
                "3.1": {
                    "content": "Searches under Rule 164(2) For Euro-PCT applications where the EPO acted as ISA or as SISA, the examining division under Rule 164(2) assesses the application documents upon expiry of the six-month time limit set in the communication under Rule 161 and Rule 162. For any claimed invention or group of inventions within the meaning of Art. 82 not searched by the EPO in its capacity as ISA or SISA, the examining division issues an invitation to pay search fees. The application documents as amended may contain claims directed to a non-searched invention in situations other than where the application documents that are to serve as the basis for examination do not meet the requirement of unity of invention. For instance, the amended application may contain just one invention, but it may be an invention that was claimed but not searched by the EPO as (S)ISA in the international phase. In this case, there is no non-unity objection for this set of claims and the reasoning in the invitation needs only to refer to the non-unity objection in the WO-ISA and to the fact that no additional fee was paid for this invention during the international phase. It may well be that an invention in the application documents was not even claimed in the application documents that served as the basis for the procedure in the international phase and has been imported from the description (see F-V, 7.1(iv)). In such a case, an invitation to pay search fees under Rule 164(2) for any non-searched invention is to be issued by the examining division, irrespective of whether lack of unity persists in the claims. The invitation under Rule 164(2) must state that – and why – this is a new invention not searched in the international phase. If there are other inventions present in the claims that were also not searched (but were claimed in the PCT phase), the applicant must also be invited by way of the same invitation to pay further search fees in respect of those inventions. In assessing whether or not subject-matter present in amended claims constitutes a previously unclaimed invention imported from the description (for which an invitation under Rule 164(2) is to be sent), the principles laid down for assessing compliance with Rule 137(5) (see in H-IV, 4.1.2) are to be taken into account. The application documents forming the basis for the European phase may also cover inventions or groups of inventions not searched in the (supplementary) international search report as a result of the procedure for erroneously filed elements under Rule 20.5bis PCT (see C-III, 1.3). In this case too, an invitation to pay search fees under Rule 164(2) is to be issued by the examining division. The invitation under Rule 164(2) must be sent before any communication under Art. 94(3). For Rule 164(2) to apply, the claims must be sufficiently clear to allow the identification of a non-searched invention triggering the procedure under Rule 164(2). If the claims are so unclear that a non-searched invention cannot be identified, the first action must be to issue a communication under Art. 94(3) setting out the objections under Art. 84. Should it turn out later in the procedure that amended claims are indeed directed to a non-searched invention, the applicant must file a divisional application for any such subject-matter. Recourse to Rule 164(2) is not provided for if, as a result of further amendments or clarification, (further) non-searched inventions are identified, since the procedure under Rule 164(2) applies to the application documents as submitted by the applicant as the basis for examination. If auxiliary requests are submitted before a search under Rule 164(2) is performed, only the main request is taken into account for the purpose of the search (notwithstanding the exceptions relating to cases under Rule 62a or Rule 63 where main and auxiliary requests are both considered at the search stage, see B-VIII, 3.2.2 and B-VIII, 4.2.2). If any search fees are paid in due time, the results of the searches are communicated to the applicant as an annex to a communication under Art. 94(3) and Rule 71(1) and (2) or under Rule 71(3), as set out in Rule 164(2)(b). This annex is entitled \"Search result according to Rule 164(2)\". If the applicant pays the search fees in due time under Rule 164(2) and at the same time files a new set of claims, the search will be carried out and the written opinion issued for the claims on file upon expiry of the period under Rule 161 for which the invitation to pay was sent and the requested fees paid. The amended documents may, however, informally be taken into account by the examiner carrying out the search, where this appears appropriate. Applicants will have the opportunity to file amendments of their own volition after receiving the results of the search under Rule 164(2) annexed to the communication under Art. 94(3) (see H-II, 2.3). If search fees are not paid in due time under Rule 164(2), a communication under Art. 94(3) and Rule 71(1) and (2) or under Rule 71(3) will be issued and the examining division will require deletion from the claims of any subject-matter that was not searched either because a search fee under Rule 164(2) was not paid (see H-II, 6) or for a different reason (see H-IV, 4). Before the patent is granted, this subject-matter should be either deleted from the description and drawings or indicated as not forming part of the claimed invention (see F-IV, 4.3(iii)). A communication under Rule 164(2)(b) deals with all objections for each of the inventions searched in accordance with Rule 164(2). For claims relating to inventions already searched by the EPO in the international phase that have been amended but still lack unity, it is sufficient to argue in detail why lack of unity is still present. The communication, where appropriate, further requests the applicant to limit the application to a single searched invention (see Rule 164(2)(c)). It follows from Rule 164(2)(b) and (c) that the special procedure under Rule 164(2) as set out in H-II, 2.3 ends upon expiry of the time limit set in the communication issued under Rule 164(2)(b). This means that the applicant's right to make amendments of their own volition ends upon expiry of that time limit. Furthermore, the special procedure as set out in F-V, 7.1(iv), which exempts amendments from the requirements of Rule 137(5), first sentence, ends upon expiry of the time limit under Rule 161(1). Such amendments will result in an invitation under Rule 164(2)(a) and allow the applicant to obtain a search of unsearched subject-matter referred to in Rule 137(5). However, any amendments submitted after expiry of the time limit under Rule 161(1) are subject to the requirements of Rule 137(5), first sentence (see H-IV, 4.1.2). The EPO's obligations under Rule 164(2) are fulfilled and the applicant's rights under this rule are exhausted once a single communication under Rule 164(2) has been sent. It follows that in cases of cascading non-unity no (further) invitation under Rule 164(2) is sent. The same applies if, during the examination procedure, claims are added or existing claims amended so that they relate to non-searched inventions. Exceptional cases may arise where the following sequence of events has occurred in the international phase: (i) The EPO acted as ISA in the international phase (ii) The EPO acting as ISA invited the applicant to pay one or more additional international search fees in accordance with Art. 17(3)(a) PCT and Rule 40 PCT (due to a lack of unity according to Rule 13 PCT) (iii) The applicant paid at least one such additional search fee (iv) The additional search or searches led to a further objection as to a lack of unity a posteriori (a cascading lack of unity), resulting in one of the inventions identified in the invitation under Art. 17(3)(a) PCT and Rule 40 PCT being further subdivided and resulting in sub-inventions not originally identified in that invitation (v) The EPO did not search all such sub-inventions. In the above case, the EPO will invite the applicant to pay search fees for any such unsearched sub-inventions in the claims that are to form the basis for examination on expiry of the six-month period under Rule 161(1), in accordance with Rule 164(2). Where the EPO acted as SISA in accordance with Rule 45bis.9 PCT, it may make a finding of a lack of unity of the international application according to Rule 45bis.6(a) PCT. However, in the procedure before the SISA, the applicant cannot pay additional supplementary international search fees, and the supplementary international search report will be directed only to the invention or unitary group of inventions first mentioned in the claims (Rule 45bis.6(a) PCT). Where such an application contains unsearched inventions in the claims that are to form the basis for examination on expiry of the six-month period under Rule 161(1), a communication under Rule 164(2) is issued allowing the applicant to have these inventions searched upon payment of search fees and to pursue one of them in the examination proceedings. Rule 164(2)(b) provides for a right to amend the application in response to the results of any search under Rule 164(2). This means that applicants may make amendments of their own volition once in response to the communication under Art. 94(3) to which the search results under Rule 164(2) are annexed (H-II, 2.3)."
                },
                "3.2": {
                    "content": "Relation to unity in search; limitation to searched invention An objection of lack of unity of invention, if applicable, should already have been raised at the search stage. If such an objection was not raised, but the examining division nevertheless considers that the requirements of Art. 82 are clearly not met, the question of lack of unity will be addressed as early as possible during examination (see F-V, 7.1 and H-II, 6.3). When raising a finding of lack of unity or upholding an earlier one objected to by the applicant on the basis of unconvincing reasons, the examining division will invite the applicant to limit the application to one invention or group of inventions. In response to such an invitation, applicants must clearly indicate which searched invention they wish to prosecute further. If the response is unclear, the examining division must seek clarification before continuing with the examination (see T 736/14).",
                    "subsections": {
                        "3.2.1": {
                            "content": "No additional search fees paid If applicants have not availed themselves of the opportunity to have the search results on the other inventions included in the search report because they have paid no additional search fees in response to the invitation under Rule 64(1) (see B-VII, 1.2) or 164(1) (see B-VII, 2.3), they will be assumed to have elected to proceed with the application on the basis of the searched invention (see G 2/92). In cases where a communication under Rule 164(2) has been sent (see C-III, 3.1), Rule 164(2)(c) requires the applicant to delete all unsearched inventions from the claims. Final responsibility for establishing whether the application meets the requirement of unity of invention ultimately rests with the examining division (see T 631/97). When considering the issue of unity, the examining division will consider both the reasons given in the search opinion and the applicant's response (see B-XI, 8 for details of when a response to the search opinion is required); for Euro-PCT applications where no supplementary European search report is prepared, the examining division will consider the reasons given in the WO-ISA, IPER or supplementary international search report prepared by the EPO and the applicant's response as required by Rule 161(1) (see E-IX, 3.2). In the absence of any convincing response from the applicant to the issue of unity as raised earlier, the examining division will normally initially uphold the position taken earlier (see B-XI, 1.2) and will then require deletion of all the inventions other than that which has been searched. If the examining division is convinced, e.g. by arguments from the applicant, that the opinion on unity at the search stage was incorrect, then an additional search is performed for that part of the subject-matter that is judged to be unitary with an invention that was searched (see B-II, 4.2(iii) and C-IV, 7.3) and the examination is carried out on those claims that comply with the requirement of unity of invention. The applicant may file a divisional application for any excised subject-matter (see C-III, 3.3)."
                        },
                        "3.2.2": {
                            "content": "Additional search fees paid If the applicant has taken the opportunity to have other inventions searched, they may decide that the application is to proceed on the basis of one of these inventions and to delete the others. If the applicant has not yet done so and if the examining division maintains the objection of lack of unity (see C-III, 3.2), it should invite the applicant at the beginning of substantive examination to state which invention the prosecution of the application should be based on and to limit the application accordingly by excising those parts belonging to the other inventions. For the latter inventions, the applicant may file divisional applications (see C-III, 3.3)."
                        },
                        "3.2.3": {
                            "content": "Invitation to pay additional search fees combined with invitation to restrict the scope of the search In exceptional cases, an invitation to pay additional search fees under Rule 64(1), Rule 164(1) or Rule 164(2) may be combined with an invitation to restrict the scope of the search under Rule 62a(1) and/or Rule 63(1). When the application enters the examination phase or, in the case of Rule 164(2), after the reply to the first communication, the examiner will check whether the claims on which substantive examination is based meet the requirement of unity of invention (Art. 82) and cover only subject-matter that has been searched. If the claims lack unity of invention, the applicant will be invited to limit the claims to one searched invention and to exclude all unsearched subject-matter from the scope of the claims. If, in reply to the objection raised by the examiner, the applicant fails to respond adequately (either by amending the claims or by submitting convincing arguments) and the non-unity objection can be maintained, the application may be refused under Art. 97(2) in conjunction with Art. 82 (see H-II, 6.3 and 6.4), provided that the right to be heard, which includes the right to oral proceedings if so requested (Art. 116(1)), has been respected. If the original set of claims has been amended before entering the examination phase or, in the case of Rule 164(2), in reply to the first communication such as to meet the requirements of Art. 82 but includes subject-matter that was excluded from the search following an invitation under Rule 62a(1) and/or Rule 63(1), the examiner will either (i) invite the applicant to limit the set of claims to the searched subject-matter under Rule 62a(2) and/or Rule 63(3) or (ii) raise an objection under Rule 137(5) against the claims concerned (see H-IV, 4.1.2). In cases under Rule 164(2), if the first communication already included the relevant objections/invitations and the right to be heard has been respected, the application may be refused. If, in reply to the invitation under Rule 62a(2) or 63(3), the applicant fails to respond adequately (either by amending the claims or by submitting convincing arguments), the application may be refused under Art. 97(2), provided that the right to be heard has been respected (see F-IV, 3.3)."
                        }
                    }
                },
                "3.3": {
                    "content": "Excision of other inventions; filing divisional applications The applicant may file divisional applications for inventions deleted in accordance with C-III, 3.2.1 or 3.2.2. A divisional application may only be filed if the application being divided is still pending (see A-IV, 1.1.1)."
                },
                "3.4": {
                    "content": "Refund of additional search fees If the applicant has paid further search fees in response to an invitation under Rule 64(1), 164(1) or (2) and has requested a refund, the examining division is required to review the validity of the finding of lack of unity (see also F-V, 4 to F-V, 7). A refund request should be handled promptly. If the examiner concludes that it should not be granted, the applicant is informed of the examining division's preliminary opinion in a communication under Art. 94(3). This preliminary opinion takes into account the arguments put forward by the applicant in their reply to the search opinion. The applicant is informed that they may request an interlocutory decision on the refund, allowing a separate appeal under Art. 106(2). If there is a pending request for oral proceedings, the applicant is also invited in the communication to clarify whether this request also applies to the issuing of the interlocutory decision on the request for refund. If the applicant confirms this to be the case, oral proceedings will have to be held before a negative decision on the request for refund can be issued. An interlocutory decision should be issued at the earliest opportunity, subject to the requirements of Art. 113(1), and not left until the final decision on the application. Of course, if the stage in the procedure when the examiner is in a position to issue the decision on the refund coincides with the issuing of either a Rule 71(3) communication or a decision refusing the application, then, in the former case, the interlocutory decision can be issued with the Rule 71(3) communication; in the latter case, the decision on the refund can be included in the decision refusing the application. The examiner ensures that the interlocutory decision issued on this matter clearly states that a separate appeal under Art. 106(2) is allowed. The same procedure applies to the refund of search fees paid under Rule 164(1) and (2). Rule 164(5) provides for a refund of any search fee paid under Rule 164(1) or (2) in line with Rule 64(2) (see A-X, 10.2.2). Where the applicant pays a search fee in response to the Rule 164(2) invitation and at the same contests the basis for requiring payment of a search fee and requests its refund under Rule 164(5), the examining division may deal directly with this issue in the communication under Art. 94(3) and Rule 71(1) or (2) that accompanies the search results under Rule 164(2). Such an immediate review of the applicant's request is not possible in cases under Rules 64(1) and 164(1) until the examining division assumes responsibility for the application. The review under Rule 64(2) or 164(5) is restricted to a reconsideration of the validity of the original finding under the circumstances existing at the time the Rule 64(1), 164(1) or (2) invitation was sent, taking into account only the prior art that was available at that time. For more details on the assessment of unity of invention, see F-V. The issue of refunds of additional international search fees paid to the EPO acting as ISA in response to an invitation under Art. 17(3)(a) PCT, however, does not arise in the European phase because these fees were paid in the international phase, which is closed by this stage of the procedure. The applicant may contest the payment of additional international search fees to the EPO acting as ISA by paying these under protest according to Rule 40.2(c) PCT. However, this must be done in the international phase (see also the decision of the President of the EPO dated 9 June 2015, OJ EPO 2015, A59, and the notice from the EPO dated 24 March 2010, OJ EPO 2010, 322)."
                },
                "3.5": {
                    "content": "Changing from one searched invention to another Once the applicant has limited the claims to one searched invention, the examining division will refuse to admit amendments involving switching to a different searched invention (for further information, see H-II, 6.1)."
                }
            }
        },
        "4. ": {
            "title": "First communication If deficiencies persist in the application even after the applicant has filed their response to the search opinion, the examining division will issue a communication under Art. 94(3) and Rule 71(1), (2) in subsequent examination proceedings and will consider the applicant's reply before issuing a negative decision or a summons to oral proceedings. For the exceptional case where a summons to oral proceedings is issued as the first action in examination proceedings, see C-III, 5.",
            "subsections": {
                "4.1": {
                    "content": "Reasoning",
                    "subsections": {
                        "4.1.1": {
                            "content": "Reasoned objections As with the search opinion, for each objection, the communication should indicate the part of the application that is deficient and the EPC requirement not met, either by referring to specific articles or rules or by other clear indication; it should also give the reason for any objection where not immediately apparent (for more details see B-XI, 3.2). The burden of proof and the onus to present the relevant facts about patentability requirements lie initially with the examining division, which must provide evidence and facts to support its objection (see T 655/13). Accordingly, prior-art documents forming the basis for novelty or inventive step objections must be cited in such a way that these conclusions can be checked without difficulty (see E-X, 2.6)."
                        },
                        "4.1.2": {
                            "content": "Positive statements/suggestions Where appropriate, the communication should also contain positive statements on patentability where some of the claims meet the patentability requirements (see B-XI, 3.2.2). In this phase of the proceedings, the examiner should make such statements in particular where the claims for which a positive conclusion is reached have not yet been commented on. Concerning making suggestions on how to overcome objections, see B-XI, 3.8. When suggesting an acceptable form of amendment to the claims, the examining division will also invite the applicant to adapt the description to bring it into line with the amended claims (see F-IV, 4.3)."
                        }
                    }
                },
                "4.2": {
                    "content": "Invitation to file comments and amendments The communication should include an invitation to the applicant to file observations, correct any deficiencies and, if necessary, submit amendments to the description, claims and drawings. It must also state the period within which the applicant must reply. Failure to reply in due time will cause the application to be deemed withdrawn (see C-VI, 1 and E-VIII, 1). Further processing is available for this loss of rights (E-VIII, 2)."
                }
            },
            "content": " When drawing up such a communication (or exceptionally the summons to oral proceedings), the examining division will take into account the documents (if any) cited in the search report and any further documents found as a result of the search referred to in C-IV, 7.1 as well as any amendments proposed or comments made by the applicant in reply to the search opinion (see B-XI, 8) or the Rule 161(1) communication (see E-IX, 3). The examiner should identify in this communication any EPC requirements that, in their opinion, the application does not satisfy. The communication will give reasons for any objections raised and invite the applicant within a specified period to file observations or submit amendments. The filed application documents are not sent back to the applicant although a copy of the description and claims may be sent in appropriate cases (see H-III, 2). The examiner will re-examine the application once the applicant has replied. If no search opinion has been issued (see C-VI, 3, F-V, 7.1(ii) and B-XI, 1.1), the examiner's first communication under Art. 94(3) will, as a general rule (see B-XI, 3) and by analogy with the search opinion, cover all objections to the application (see B-XI, 3.4 for exceptional cases where not all objections are raised). A summons will not be issued as the first office action in examination proceedings in such a case."
        },
        "5. ": {
            "title": "Summons to oral proceedings as the first action in examination In exceptional cases, the examining division may decide to issue a summons to oral proceedings as the first action in examination. It may do so only if:",
            "subsections": {},
            "content": " - in its opinion, there is no prospect of a grant, even taking into account the applicant's reply to the search opinion - the content of the claims on file is not different in substance from that of the claims that served as a basis for the search - one or more of the objections raised in the search opinion and crucial to the outcome of the examination procedure still apply. In addition, in examination of a divisional application, the examining division may exceptionally issue a summons to oral proceedings as the first action if: - the parent application was refused or withdrawn and there is no prospect of a grant for the divisional application, even taking into account the applicant's reply to the search opinion - the content of the claims on file is substantially the same as or broader than the subject-matter of claims that were examined for the refused or withdrawn parent application or that served as a basis for the search of the divisional application - one or more of the objections that are crucial to the outcome of the examination procedure and that were raised in either the search opinion established for the divisional application, the parent's refusal or a communication issued for the withdrawn parent still apply. The annex to the summons issued as the first action in examination must deal with the applicant's requests in their entirety and be as detailed as a communication under Art. 94(3) (see, in particular, C-III, 4.1). It must not include any new objections or cite new documents that were neither included in the search opinion nor, in the case of a divisional application, in the refusal of the parent application or in a communication issued for the withdrawn parent application. All objections to the application must be covered and substantiated by giving the essential legal and factual reasons. In addition, it must include the reasons for the decision to directly summon to oral proceedings as the first action in examination. The division may inform the applicant in a telephone call if it is considering issuing a summons to oral proceedings as the first action in examination (C-VII, 2.5). In order to allow the applicant sufficient time to prepare any submissions ahead of the oral proceedings, the summons should be issued with at least six months' notice. In accordance with the principles applicable to the summons to oral proceedings, applicants may avail themselves of the possibility to submit any arguments and amendments by expiry of the deadline set under Rule 116(1). Requests filed after the date set under Rule 116(1) are not to be treated as late-filed (H-II, 2.7) in the case of a summons to oral proceedings issued as first action in examination. Should the applicant's submissions contain a genuine effort to overcome the examining division's objections, oral proceedings may be cancelled or postponed. Otherwise, a decision on the substance of the application will in principle be taken during the oral proceedings, even if the applicant does not attend them (see E-III, 6 and E-III, 8.3.3.3)."
        },
        "6. ": {
            "title": "Requesting information on prior art (not confined to priority)",
            "subsections": {},
            "content": " The EPO may invite the applicant to submit, within a period of two months, information on prior art taken into consideration in national or regional patent proceedings and concerning an invention to which the European patent application relates. This in particular encompasses search results with respect to applications for patents or utility models whose priority is not being claimed. The EPO may by the same means request the copy of the search results on the priority or priorities referred to in Rule 141(1), where those results were not available to the applicant when requested under Rule 70b(1) (see the notice from the EPO dated 28 July 2010, OJ EPO 2010, 410). Failure by the applicant to comply with this invitation results in the application being deemed withdrawn under Art. 124(2). Further processing is available for this loss of rights (see E-VIII, 2). Given the considerable work such invitations can entail for applicants, further requests under Rule 141(3) will be issued only in individual cases where there are cogent reasons to suspect the existence of additional, relevant prior art. This invitation is an independent communication and the above-mentioned time limit is non-extendable. The invitation can be sent by itself or at the same time as an Art. 94(3) communication. If sent at the same time, the time limits set in both communications are independent of one another. Any information on prior art provided by the applicant will be included in the file and will be open to file inspection (see A-XI)."
        },
        "7. ": {
            "title": "Evaluation of prior-art documents cited in the search report and late priority claim As explained in A-III, 6.5.1 and A-III, 6.5.2, the applicant has the right to correct or introduce a priority claim within 16 months of the earliest priority",
            "subsections": {},
            "content": " (with a minimum of four months from the European filing date in the case of corrections). If this happens before finalisation of the search report, the examiner may review the draft search report to take into account the change in the application's effective date. In cases where the search report was issued on the basis of the original priority status (i.e. addition or correction of a priority claim is effected after the search report is drawn up), the examiner at the substantive examination stage should reevaluate the relevance of the documents cited in the search report. Where it appears that the prior art available to the examiner is unlikely to reflect the state of the art in a sufficiently complete way for the purpose of a patentability assessment, the examiner should then conduct an additional search (see C-IV, 7.3). No further search report will be issued in these cases: the applicant will be informed of any newly found documents in a communication under Art. 94(3) (with copies of such documents annexed to that communication)."
        }
    },
    "Chapter IV – Examination of replies and further stages of examination": {
        "1. ": {
            "title": "General procedure Following the applicant's reply to the search opinion (see B-XI, 8), WO-ISA, IPER or supplementary international search report prepared by the EPO",
            "subsections": {},
            "content": " (see E-IX, 3) or to the first communication, the examiner must examine the application, taking into account observations or amendments made by the applicant. Where the application is one of those mentioned in H-III, 2.1.4, Rule 137(4) requires that any amendments made by the applicant in reply to the search opinion, WO-ISA, IPER or supplementary international search report be identified and their basis in the application as filed indicated. Failure to do so may result in the examining division sending a communication under Rule 137(4). For more details of the procedure, see H-III, 2.1.1 and 2.1.2. In the case of one or more auxiliary requests directed to alternative texts for grant of a patent, every such request qualifies as a text submitted or agreed by the applicant within the meaning of Art. 113(2) and therefore must be dealt with in the order indicated or agreed to by the applicant, up to and including the highest-ranking allowable request, if any (see also H-III, 3 and C-V, 1.1). For the types of application mentioned in H-III, 2.1.4, Rule 137(4) must also be complied with in respect of auxiliary requests, which may also be subject to a communication under Rule 137(4)."
        },
        "2. ": {
            "title": "Extent of examination of replies After the first examination stage, provided that the:",
            "subsections": {
                "3.1": {
                    "content": "Further action where a request for a translation of the priority application was sent earlier in examination proceedings In cases where an invitation under Rule 53(3) to file a translation of one or more priority applications was sent earlier in examination proceedings (either separately or at the same time as an Art. 94(3) communication – see A-III, 6.8.2), a subsequent communication (under Art. 94(3) or Rule 71(3) or a summons to oral proceedings) cannot be sent until the translation is filed or the period for further processing has expired (see also C-VIII, 5.1). This also applies in cases where the Rule 53(3) invitation was sent at the same time as a previous Art. 94(3) communication and the applicant has already replied to that communication (e.g. by filing amendments) but not yet provided the translation and the original time limit or the period for further processing is still running."
                }
            },
            "content": " - search opinion - WO-ISA (when prepared by the EPO) - explanation accompanying the supplementary international search report under Rule 45bis.7(e) PCT (when prepared by the EPO, see the notice from the EPO dated 24 March 2010, OJ EPO 2010, 316, point 6) - IPER (when prepared by the EPO) - first communication (see B-XI, 1.1 and 8) was comprehensive and clear (see B-XI, 3 and C-III, 4 and 4.1), the examiner will not normally need to completely re-read the application but rather should concentrate on the amendments themselves, the related passages and the deficiencies previously noted. 3. Further action upon examination of replies Examiners should be guided at this stage by the overriding principle that a final position (grant or refusal) should be reached in as few actions as possible, and should conduct the procedure with this always in mind. The EPC provides that the process of communicating with the applicant described in C-III, 4 is repeated \"as often as necessary\". In most cases, the applicant will have tried to deal with all the examiner's objections. A letter of reply from the applicant does not have to be substantively complete or cogent to qualify as a reply within the meaning of Art. 94(4). For the application not to be deemed withdrawn, it is enough for the applicant to comment on, even incompletely, or to file amendments in reply to at least one of the objections raised in the Art. 94(3) communication. In contrast, purely formal requests, such as for extension of the time limit under Art. 94(3) or for a consultation, do not qualify as replies under Art. 94(4) (see also B-XI, 8 and E-VIII, 2). A request for a decision according to the state of the file (see C-V, 15), however, qualifies as a reply within the meaning of Art. 94(4). If the only outstanding objection is the need to amend the description, see C-VI, 1.1. If examination of the applicant's reply shows that despite their submissions objections persist, and provided that at least one communication has been sent in examination proceedings (see C-III, 4 and E-IX, 4.1) and the applicant has been given the right to be heard (Art. 113(1)), i.e. the decision is based solely on grounds they have had an opportunity to comment on, the examiner will consider recommending to the other members of the examining division that the application be refused (see T 201/98). However, where there is a reasonable prospect that an additional invitation to overcome the objections could lead to a grant, the examiner will send a further written communication or contact the applicant by telephone. The examiner may also make suggestions on how to overcome the raised objections (see B-XI, 3.8 and C-III, 4.1.2). If examination of the applicant's reply shows that they have not dealt with all the main objections in their reply, it may be appropriate to draw the deficiencies to their attention, e.g. by telephone. But if no positive reaction is to be expected, the examiner should consider recommending to the other members of the examining division that the application be refused immediately (again provided that at least one communication has been sent in examination proceedings). If substantial differences of opinion exist, the issues are generally best dealt with in writing. If, however, there seems to be confusion about points in dispute, e.g. the applicant seems to have misunderstood the examiner's arguments or the applicant's own arguments are unclear, then a consultation may be useful. A consultation may also expedite the procedure if the matters to be resolved are minor. Consultations do not constitute oral proceedings (see E-III) and are more fully considered in C-VII, 2."
        },
        "4. ": {
            "title": "Later stages of examination The considerations explained in C-IV, 3 also apply to later stages of examination given that, having regard to the principle stated in C-IV, 3, the greater the number of actions performed, the more likely it is that the most appropriate course of action is to refer the application to the other members of the examining division for a decision. Where this decision is to refuse the application, particular care should be taken to ensure that the decision does not offend against Art. 113(1).",
            "subsections": {}
        },
        "5. ": {
            "title": "Examination of amendments Amendments must satisfy the conditions listed in C-III, 2. When they were effected must also be established.",
            "subsections": {}
        },
        "6. ": {
            "title": "Admissibility of amendments made by the applicant For matters relating to the admissibility of amendments made in examination proceedings, see H-II, 2.",
            "subsections": {}
        },
        "7. ": {
            "title": "Search-related issues in examination",
            "subsections": {
                "7.1": {
                    "content": "Search for conflicting European patent applications The examiner should make a search for any additional conflicting European patent applications falling within the area defined by Art. 54(3) unless this was already covered by the search report. This is because, in general, the search files will not be complete in respect of such material at the time of the main search. Since priority dates claimed (if any) may not be accorded to all or part of the application but may be accorded to the appropriate part of a conflicting application (see F-VI, 2.1), this search should be extended to cover all European patent applications published up to eighteen months after the filing of the application under consideration. If the examiner is unable to complete this top-up search when preparing the search opinion or the first communication under Art. 94(3), they should ensure that it is completed before the application is reported to be in order for the grant of a patent. In the rare cases where the application is found to be in order before this search can be completed (e.g. due to a request for accelerated prosecution of an application not claiming priority, \"PACE\", see the notice from the EPO dated 30 November 2015, OJ EPO 2015, A93), the grant of a patent should be postponed until the top-up search can be completed. If the top-up search is performed at the earliest 18 months from the filing date of the application under examination, the priority situation needs to be checked only if intermediate documents and/or conflicting applications are retrieved. The top-up search may exceptionally be performed at the earliest 18 months after the priority date on condition that the priority claim is valid for the whole content of the patent application under examination. In addition to retrieving Art. 54(3) documents not available at the time of the original search, the top-up search takes into consideration potentially relevant prior art cited by other patent offices on applications belonging to the same patent family as the application under examination at the EPO and therefore needs to be performed for any file at the start and end of examination. The examiner may retrieve relevant intermediate and/or conflicting Euro- PCT applications for which it is not yet clear if they will become prior art under Art. 54(3) alone or in conjunction with Rule 165 (see G-IV, 5.2). In these cases, the examining division cannot issue an intention to grant before it can be established if these documents are prior art under Art. 54(3). The examiner will first check if the Euro-PCT application has entered the European phase at 31 months after the earliest priority date of the application. If not, it may still constitute conflicting prior art under Art. 54(3) if the PCT applicant has paid the required filing fee under Rule 159(1)(c) and has supplied the PCT application in any official EPO language. The examiner will then verify if the application has become prior art under Art. 54(3) in conjunction with Rule 165. Since August 2021, the EPO publishes these cases in section I.2(2) of the European Patent Bulletin under the heading \"International applications considered as comprised in the state of the art under Rule 165 and Art. 54(3) EPC\". For the refund of examination fees (see A-VI, 2.5), the launch of a top-up search is triggered at the start of examination. This creates a marker that serves as evidence in the file that the examining division has started its substantive work."
                },
                "7.2": {
                    "content": "National prior rights In view of the importance of national prior rights (see B-VI, 4.2) for applicants in proceedings before the Unified Patent Court, the examiner expands the top-up search scope at the grant stage (see C-IV, 7.1) to include national applications and patents of all contracting states in so far as they are present in the EPO's databases. The division informs the applicant about the outcome of the top-up search for national prior rights. Those that appear prima facie relevant for the application are communicated to the applicant."
                },
                "7.3": {
                    "content": "Additional searches during examination An additional search will sometimes be required either at the first stage of amendment or subsequently. This may arise for a number of reasons. An additional search may be necessary: (i) where a partial search taking the place of the search report under Rule 63 has been issued at the search stage after an invitation under Rule 63(1) (see B-VIII, 3, 3.1 and 3.2) and the deficiencies rendering a meaningful search impossible under Rule 63 have been subsequently corrected by amendment complying with Rule 137(5) (see H-IV, 4.1.1) or successfully refuted by the applicant (ii) where a declaration that a meaningful search was not possible took the place of the search report under Rule 63 and the applicant successfully refuted the objections (iii) where the applicant successfully argues that a plurality of independent claims in the same category, which led to a limitation of the search report in accordance with Rule 62a (see B-VIII, 4.1 and 4.2), is in fact allowable according to the exceptions provided for in Rule 43(2) (see F-IV, 3.2) (iv) where a particular part of the application has not been searched because of an objection of lack of unity of invention and the arguments advanced by the applicant have convinced the examining division that unity is given (v) where the claims have been so amended that their scope is no longer covered by the original search (vi) where a search report under Rule 61 was issued containing no prior-art documents because the technical features were considered notorious (see B-VIII, 2.2.1) and the examining division does not share this opinion (vii) where no prior-art document was cited for features that were considered part of the common general knowledge and the examining division does not share this opinion or the common general knowledge is challenged by the applicant (see G-VII, 2 and 3.1) (viii) exceptionally, where the applicant states that a mistake was made in the acknowledgement of prior art (see G-VII, 5.1) or the examiner believes that material relevant to obviousness might be found in technical fields not taken into account during the search (ix) where the applicant has introduced a new priority claim after the filing date (see C-III, 6). If the application was filed under the PCT, the search report will be the international search report issued under the PCT and will be accompanied by a supplementary European search report unless the Administrative Council decides that that is to be dispensed with (see E-IX, 3.2). Both of these reports will have to be considered by the examiner when deciding whether any additional search is required. In the case of a Euro-PCT application for which the EPO acting as ISA or SISA issued an incomplete search report or a declaration of no search (see PCT-EPO Guidelines, B-VIII, 1), an additional search may be necessary if the deficiencies underlying the limitation of the search have been corrected by amendment or successfully refuted by the applicant (see B-II, 4.2 (ii)). Otherwise, the examining division will object to claims relating to subject- matter not searched by the EPO acting as ISA, referring to the EPC provision invoked for the limitation of the search, e.g. Art. 84. Rule 137(5), second sentence, cannot be invoked in that context. For searches under Rule 164(2), see C-III, 3.1."
                },
                "7.4": {
                    "content": "Search at the examination stage Although all search work (other than for Art. 54(3) material) should as a rule be done at the search stage, in exceptional circumstances examiners are not barred from looking for a relevant document whose existence they know of or have reason to suspect, provided they can retrieve that document in a short time."
                },
                "7.5": {
                    "content": "Citing documents not mentioned in the search report A copy of any document cited by the examiner but not mentioned in the search report, for example one found in a search under C-IV, 7.1, C-IV, 7.2 or C-IV, 7.3, should be sent to the applicant and identified in the electronic dossier (see the decision of the President of the EPO dated 12 July 2007, Special edition No. 3, OJ EPO 2007, J.2)."
                }
            }
        },
        "8. ": {
            "title": "New submissions in reply to a summons New requests filed in reply to a summons to oral proceedings will normally be discussed at the oral proceedings. As a rule, there is no provision for detailed discussion before the oral proceedings.",
            "subsections": {},
            "content": " However, informal consultation to discuss the new requests may be allowed by the first member (see C-VII, 2), in particular if there is a reasonable prospect that the consultation could lead to an agreed allowable claim set. The examining division strives to review newly filed requests in good time before oral proceedings so the proceedings can be cancelled if necessary, in particular where a newly filed main request is considered patentable. For cases where the newly filed main request is not considered patentable but one of the auxiliary requests is, see E-X, 2.9."
        }
    },
    "Chapter V – The final stage of examination": {
        "1. ": {
            "title": "Communication under Rule 71(3)",
            "subsections": {
                "1.1": {
                    "content": "Text for approval Once the examining division decides that a patent can be granted, it must inform the applicant of the text it intends to use for the grant. This text may include amendments and corrections that the examining division made on its own initiative and can reasonably expect the applicant to accept. If in doubt as to whether the applicant will agree to the proposed amendments, the examining division should contact them by telephone or via an official communication. The applicant's agreement to such amendments during a consultation will usually be recorded in the communication under Rule 71(3) (see C-VII, 2.4). Examples of amendments not requiring consultation with the applicant: (a) amendment of a statement of invention in the description to bring it into conformity with the claims (b) deletion of vague general statements in the description (see F-IV, 4.4) or of obviously irrelevant matter (see F-II, 7.4) (c) insertion of values in SI units (see F-II, 4.13) (d) insertion of reference numerals in claims unless the applicant is known to object to this or has previously objected to this (e) introduction of a summary of background art that clearly represents the prior art closest to the invention (see F-II, 4.3) (f) amendments that, despite changing the meaning or scope of an independent claim, are very clearly necessary and so assumed acceptable to the applicant (see for example G-VI, 6.1.2, G-VI, 6.1.3 and G-VI, 6.1.4) (g) correction of linguistic and other minor errors (h) reformulation of method-of-treatment claims into an allowable format (see G-II, 4.2). (i) deletion of redundant claims (e.g. omnibus claims and claims that the applicant has not deleted despite having incorporated their features into other claims). Examples of amendments that may not be proposed without consulting the applicant: (i) amendments that significantly change the meaning or scope of a claim when there are several different ways to amend it and the examiner cannot predict which amendment the applicant will agree to (ii) deletion of entire claims, with the exception of so-called \"omnibus claims\" (i.e. claims reading \"An apparatus substantially as described herein\", or the like) (iii) combining of claims to overcome a novelty or inventive step objection. The above list is designed to avoid changes likely to be rejected by the applicant and thus to help avoid delays in the conclusion of examination proceedings. For the standard marks used by the division to indicate amendments and corrections using the in-house electronic tool, see C-V, Annex. The text is communicated to the applicant via a Rule 71(3) communication, which includes an invitation to pay the fee for grant and publishing (see C-V, 1.2) and to file a translation of the claims in the two official EPO languages other than the language of the proceedings (see C-V, 1.3) within a non-extendable period of four months. If the applicant pays the fees and files the translations in time (and files or requests no corrections or amendments to the text proposed in the Rule 71(3) communication, see C-V, 4.1), they will be deemed to have approved the text intended for grant (Rule 71(5)). If, during examination proceedings, a main request and auxiliary requests have been filed (see C-IV, 1 and E-X, 2.9) and one of the requests is allowable, the communication pursuant to Rule 71(3) is to be issued on the basis of the (first) allowable request unless there is a higher ranking request for oral proceedings (see E-X, 2.2). The communication pursuant to Rule 71(3) must briefly indicate the essential reasons for the non- allowability of the subject-matter of the higher-ranking requests or their inadmissibility (see also H-III, 3). The examining division should provide sufficient information about the objections raised to enable the applicant to comment on them. Handwritten amendments by the applicant to the description, claims and abstract, unless they involve graphic symbols and characters and chemical or mathematical formulae, are no longer accepted in strict compliance with Rule 50(1) in conjunction with Rule 49(2) (Art. 2(7) of the decision of the President of the EPO dated 25 November 2022, OJ EPO 2022, A113) (see OJ EPO 2013, 603, and A-III, 3.2). For the procedure to follow in oral proceedings, see E-III, 8.7."
                },
                "1.2": {
                    "content": "Grant and publishing fee The communication under Rule 71(3) also invites the applicant to pay the fee for grant and publishing within a non-extendable four-month period. For European patent applications filed before 1 April 2009 and international applications entering the regional phase before that date, the fee for grant and printing may include an element depending on the number of pages, but for applications filed or entering the regional phase on or after that date, this additional element is payable as part of the filing fee (see A-III, 13.2)."
                },
                "1.3": {
                    "content": "Translations of the claims The communication under Rule 71(3) also invites the applicant to file a translation of the claims in the two official EPO languages other than the language of the proceedings within a non-extendable four-month period. If the application contains different sets of claims for particular contracting states (see H-III, 4), a translation of all the sets of claims must be filed. Only one copy of the translation needs to be filed. Examiners should not concern themselves with the quality of the translation filed. The translation should meet the requirements pursuant to Rule 50(1)."
                },
                "1.4": {
                    "content": "Claims fees due in response to Rule 71(3) communication If the text of the European patent application serving as the basis for grant contains more than fifteen claims, the examining division requests the applicant to pay, within the period under Rule 71(3), claims fees in respect of each claim in excess of that number unless they have already done so under Rule 45(1) or Rule 162(1) and (2) (see A-III, 9). Where there is more than one set of claims, fees are incurred under Rule 45(1), Rule 162(1) and (2), or Rule 71(4) only for the set with the highest number of claims. If the text on which the Rule 71(3) communication is based contains fewer claims than the set in respect of which claims fees were paid on filing under Rule 45 or on entry into the European phase under Rule 162, no refund of claims fees will be made. Where the communication under Rule 71(3) is based on an auxiliary request, the number of claims in the request determines the claims fees due in response to the communication. However, if the applicant replies by requesting a grant based on a higher-ranking request, no claims fees need to be paid in response to the communication (see C-V, 4.1)."
                },
                "1.5": {
                    "content": "Other information in the communication under Rule 71(3) An annex to the Rule 71(3) communication indicates the contracting states validly designated as well as the extension and validation states for which the corresponding fees have been paid, the title of the invention in the three official languages, the international patent classification, the application's filing date, any priorities claimed, the designated inventors and the applicant's registered name. The Rule 71(3) communication also states that, where a renewal fee falls due between the communication's notification and the proposed date of the mention of the grant's publication, publication will be effected only after the renewal fee and any additional fee have been paid (see C-V, 2). Where the examining division changes its opinion after an earlier negative communication, it will communicate its reasons for this unless they are clear from the applicant's reply, from a communication or from the minutes of a consultation. During the grant procedure an applicant may submit further technical information, for example: - comparative tests - further examples - statements concerning the effects and/or advantages of the invention. Technical information extending beyond the content of the application as filed, however, cannot be included in the application by way of amendment (Art. 123(2), H-IV and H-V). Such information is added to the file, which is open to inspection (Art. 128(4)), and its existence is indicated on the cover page of the patent specification. All further documents that were neither cited in the application as filed nor mentioned in the search report but that were cited during the examination procedure are to be indicated, even if they have not been used in an objection concerning novelty or inventive step. This also applies to documents cited to show, for instance, a technical prejudice."
                }
            },
            "content": " In the PDF file created from the working copy of the document prepared for the printer (\"Druckexemplar\"), the tool will insert change bars to the right of amendments and indicate amended pages as such. The tool also adds pairs of insertion signs to mark the beginning and end of each insertion: Mark Explanation Denotes the beginning of text inserted Denotes the end of text inserted \"No break\", \"line break\" or \"paragraph break\" signs precede and follow the signs above to indicate whether the inserted text should be kept in the same line or if a new line or paragraph should start before or after the inserted text: Mark Explanation No breaks: inserted text is kept on the same line (this is the default) Line break: starts a new line (must be set if needed) ¶ Paragraph break: starts a new paragraph (must be set if needed) If inserting an entire newly filed page, e.g. a page numbered \"1a\", the instruction [insert page 1a] is used."
        },
        "2. ": {
            "title": "Approval of the proposed text – grant of a patent If an applicant pays the fee for grant and publishing along with any claims fees due under Rule 71(4) and files the translation of the claims within the specified period (and files or requests no corrections or amendments to the text proposed for grant in the Rule 71(3) communication, see C-V, 4.1), they are deemed to have approved the text intended for grant.",
            "subsections": {
                "2.1": {
                    "content": "Request for unitary effect Requests for unitary effect must be filed with the EPO no later than one month after the mention of the European patent's grant is published in the European Patent Bulletin (Rule 6 of the Rules relating to Unitary Patent Protection). To offer flexibility, users can file requests after the decision to grant the European patent is issued (EPO Form 2006A), see Supplementary publication 3, OJ EPO 2023. Requests for unitary effect filed early will not be processed by the EPO before the date on which the mention of the European patent's grant is published in the European Patent Bulletin and will appear in the Register for unitary patent protection only from that date."
                }
            },
            "content": " The above also applies where the Rule 71(3) communication was based on an auxiliary request, provided that the applicant does not reply to the Rule 71(3) communication by requesting that a grant be based on a higher- ranking request. This means that, in the absence of any indication to the contrary, the above acts imply approval of the auxiliary request text upon which the Rule 71(3) communication was based as well as the abandonment of all higher-ranking requests. The above also applies where the Rule 71(3) communication included the examining division's proposals for amendments or corrections to the text intended for grant (see C-V, 1.1). Consequently, provided the applicant does not reject these proposals in their reply, completion of the above acts constitutes approval of the text amended or corrected by the examining division. Once all the requirements set out in C-V, 1.1 to 1.4, are met, the decision to grant the European patent is issued, provided that renewal fees and any additional fees already due have been paid. If a renewal fee falls due after the Rule 71(3) communication's notification but before the next possible date for publication of the mention of the European patent's grant, the decision to grant is not issued and the mention of the grant is not published until the renewal fee has been paid. The applicant is informed accordingly. If the renewal fee or any additional fee is not paid in time, the application is deemed withdrawn (see A-X, 5.2.4). In rare cases where examination was accelerated to such an extent that the Rule 71(3) communication is issued before the designation fee falls due, the decision to grant will not be issued and the mention of the grant will not be published until the designation fee has been paid. The applicant is informed accordingly. For European patent applications filed before 1 April 2009 or international applications entering the regional phase before that date, publication will not take place until the designation fees have been paid and the designation of states for which no designation fees have been paid has been withdrawn (see also A-III, 11.1 and 11.3). The decision to grant does not take effect until the date on which the grant is mentioned in the European Patent Bulletin."
        },
        "3. ": {
            "title": "No reply in time – application deemed withdrawn If the applicant fails to pay the fee for grant and publishing or the claims fees or to file the translation within the period under Rule 71(3), the application is deemed withdrawn unless, within the same period, the applicant files or requests corrections or amendments to the text proposed for grant in the Rule 71(3) communication (see C-V, 4.1).",
            "subsections": {},
            "content": " If the applicant fails to meet the time limit under Rule 71(3), further processing may be requested under Art. 121 (see E-VIII, 2). In such a case, the omitted act to be completed would be either: (i) all of the following acts referred to in Rule 71(3) and Rule 71(4): (a) payment of the fee for grant and publishing (b) payment of any claims fees due (c) filing of the translations of the claims; or (ii) one or more of the following acts: (a) filing amendments and/or corrections to the application documents (b) rejecting amendments proposed by the examining division in the Rule 71(3) communication (c) requesting the grant to be based on a higher-ranking request than the auxiliary request on which the Rule 71(3) communication was based."
        },
        "4. ": {
            "title": "Request for amendments or corrections in reply to the Rule 71(3)",
            "subsections": {
                "4.1": {
                    "content": "No payment of fees or filing of translations necessary In the case referred to in C-V, 4, the applicant will not be required to pay the fee for grant and publishing or any claims fees in reply to the first Rule 71(3) communication, nor will they be required to file any translations of the claims within the relevant period. This applies irrespective of whether the examining division subsequently finds these amendments or corrections to be admissible and allowable and whether the amendments or corrections are reasoned (see C-V, 4.3). This also applies if the applicant requests the reversal of amendments proposed by the examining division in the Rule 71(3) communication (see C-V, 1.1). And it applies if the Rule 71(3) communication was based on an auxiliary request and the applicant replies by requesting that a grant be based on a higher-ranking request."
                },
                "4.2": {
                    "content": "Crediting of fees paid voluntarily Although the applicant is not required to pay fees in response to the Rule 71(3) communication when requesting amendments or corrections in their reply (see C-V, 4.1), they can do so voluntarily. In that case, the amount of the fees paid will be credited to the payment of the same fees in response to a subsequent Rule 71(3) communication (issued either directly or after resumption of examination – see C-V, 4.6 and 4.7.2 respectively). This crediting will be dealt with according to the procedures explained in A-X, 11. This is subject to the following: if the amount of the claims fees due in response to the second Rule 71(3) communication is less than the amount voluntarily paid in response to the first Rule 71(3) communication, a refund will be made of the excess paid since the higher claims fees were not due when paid in response to the first Rule 71(3) communication. If, after such voluntary payment, the application is withdrawn, deemed withdrawn or refused, a refund of the voluntarily paid fee for grant and publishing will be possible under the conditions explained in A-X, 10.2.5. Furthermore, since the claims fees were paid when they were not due, they will also be refunded under the same conditions."
                },
                "4.3": {
                    "content": "Amendments or corrections should be reasoned The reasoning accompanying amendments or corrections filed in response to the Rule 71(3) communication should indicate respectively: - why the applicant considers that the amended application documents comply with the EPC, in particular the patentability requirements, Art. 123(2) and Art. 84 - why the applicant considers that the errors and their proposed corrections are evident according to Rule 139. If, within the period under Rule 71(3), the applicant files amendments or corrections that are not reasoned, no payment of the fee for grant and publishing or claims fees is necessary, nor is the filing of translations (see C-V, 4.1). However, the absence of any reasoning means that such amendments or corrections are more likely to result in a resumption of the examination procedure (see C-V, 4.7)."
                },
                "4.4": {
                    "content": "Admissibility of amendments The criteria for assessing the admissibility of amendments are dealt with in detail in H-II, 2.5 and subsections. By way of exception, in cases where the Rule 71(3) communication was also the first communication in examination proceedings, amendments filed in response must be admitted into the proceedings under Rule 137 in cases (i) to (iii) mentioned in H-II, 2.2. However, where a further Rule 71(3) communication is sent in respect of such cases (see C-V, 4.6 and 4.7.2), any amendments filed in response must be consented to by the examining division according to Rule 137(3) (see H-II, 2.5)."
                },
                "4.5": {
                    "content": "Adaptation of the description If the amendments or corrections filed by the applicant in the Rule 71(3) period concern the claims, the applicant should consider the need to adapt the description. To avoid potential delays in cases where adaptation is necessary, the applicant should provide an adapted description when filing amended claims in the Rule 71(3) period. If no such adapted description is filed, the examining division may adapt the description by itself and propose these amendments in the second Rule 71(3) communication (see C-V, 4.6.3). Alternatively, it may resume examination (see C-V, 4.7) and send the applicant a communication under Art. 94(3) requesting the adapted description before issuing a second Rule 71(3) communication (see C-V, 4.7.2)."
                },
                "4.6": {
                    "content": "Amendments/corrections admitted and allowable – second Rule 71(3) communication sent If the amendments and/or corrections filed within the period under Rule 71(3) are admitted under Rule 137(3) and also comply with the EPC, the examining division will send a second communication under Rule 71(3) based on them.",
                    "subsections": {
                        "4.6.1": {
                            "content": "Second Rule 71(3) communication reversing the amendments proposed by the examining division in first Rule 71(3) communication A second communication under Rule 71(3) is also sent if the applicant requests reversal of amendments proposed by the examining division in the first Rule 71(3) communication and the examining division overturns its previous opinion, finding that the amendments proposed earlier were not necessary, possibly as a consequence of arguments or evidence provided by the applicant in their reply to the first Rule 71(3) communication (in the absence of such convincing arguments or evidence, examination will normally be resumed; see C-V, 4.7)."
                        },
                        "4.6.2": {
                            "content": "Second Rule 71(3) communication based on higher-ranking request initially rejected in first Rule 71(3) communication In cases where the first Rule 71(3) communication was based on an auxiliary request (see H-III, 3, in particular H-III, 3.1 and 3.3 and subsections), the first communication under Rule 71(3) would have been accompanied by an indication of why the examining division did not consider the higher-ranking requests admissible or allowable (see C-V, 1.1). If the applicant replies to this first Rule 71(3) communication indicating their wish to base a grant on one of those higher-ranking requests (see C-V, 1.1), that reply will normally lead to examination being resumed (see C-V, 4.7 and 4.7.1.1). The examining division may reverse its opinion, for example due to convincing arguments or evidence filed by the applicant with their reply to the first Rule 71(3) communication. If the applicant is successful in this regard, the examining division will send a second communication under Rule 71(3) based on the higher-ranking request."
                        },
                        "4.6.3": {
                            "content": "Examining division proposes amendments in second Rule 71(3) communication As with the first Rule 71(3) communication, the examining division may propose amendments to the applicant's latest request forming the basis for the second Rule 71(3) communication (this request includes amendments or corrections filed in response to the first Rule 71(3) communication). The types of amendment that may or may not be proposed by the examining division in the second Rule 71(3) communication are the same as those mentioned in C-V, 1.1. However, in the second Rule 71(3) communication, the examining division cannot repropose amendments already rejected by the applicant. Where the examining division considers that such an amendment is necessary to overcome an objection, it should consider resuming examination (see C-V, 4.7)."
                        }
                    }
                },
                "4.7": {
                    "content": "Amendments not admitted and/or not allowable, examination resumed The examining division may resume the examination proceedings at any time up to the decision to grant the European patent.",
                    "subsections": {
                        "4.7.1": {
                            "content": "Communications/oral proceedings/refusal after resumption If the examining division finds the amendments submitted by the applicant in reply to the Rule 71(3) communication either inadmissible or not allowable, it will resume the examination proceedings. The next action may be a communication under Art. 94(3) or a consultation with the applicant (see C-VII, 2). The examining division may also issue a summons to oral proceedings or, if the necessary requirements are met, refuse the application directly. The application may be refused directly if the following criteria are satisfied: (a) the grounds leading to the finding that the requests filed in response to the Rule 71(3) communication are inadmissible or not allowable have already been formally dealt with in examination proceedings (Art. 113(1)), for example in a communication under Art. 94(3) and Rule 71(1) and Rule 71(2) (see C-III, 4, E-X, 1.1); and (b) the applicant's right to oral proceedings on request has been respected (Art. 116(1)). If one of the following situations applies, the examining division will have to arrange for the holding of oral proceedings before issuing a decision to refuse (see C-V, 4.7.3): (i) oral proceedings have been requested but have not yet been held (ii) oral proceedings have been held, but: - the subject of the proceedings has changed such that a right to subsequent oral proceedings arises under Art. 116(1) (e.g. as a result of the amendments filed in response to the Rule 71(3) communication) and - the applicant has requested subsequent oral proceedings. Requests for oral proceedings must be allowed as long as proceedings before the EPO are still pending, i.e. until the decision to grant has been handed over to the internal post (see G 12/91 and T 556/95, especially reasons for the decision 4.4). 4.7.1.1 Higher-ranking request not admissible and/or not allowable If the applicant replies to the Rule 71(3) communication by requesting that a grant be based on a higher-ranking request but the examining division is not convinced by the arguments and evidence filed with their reply, the examining division resumes examination following the procedure in C-V, 4.7.1. The examining division may also directly refuse the application providing a full reasoning under the proviso that: - the short indication of the essential reasons given in the Rule 71(3) communication for the non-allowability of the subject-matter of the higher-ranking requests or the inadmissibility of these requests (see C-V, 1.1 and C-V, 4.6.2) provides sufficient information about the objections raised by the examining division to enable the applicant to comment on them (such that the applicant is not taken by surprise, in particular where amendments or corrections have been filed together with their disagreement; see C-V, 4.7.1) and - the applicant's right to oral proceedings on request has been respected (Art. 116(1)) (see also H-III, 3.3.2). For the purposes of determining whether the reasons not to grant the higher-ranking requests given in the Rule 71(3) communication allow the division to issue a refusal, a general indication such as \"Auxiliary request 3 is not clear because an essential feature is missing\" is not sufficient. Rather, a more detailed statement is needed to ensure that the applicant's right to be heard is properly respected. For example, the division may provide the applicant with an explanation such as: \"Auxiliary request 3 is not inventive in view of D1 (see col. 5, lines 25-46; fig. 4) because the skilled person, wishing to avoid friction between the cable and the carpet, would make the clip recess deeper than the cable diameter\"."
                        },
                        "4.7.2": {
                            "content": "Agreement reached on a text - second Rule 71(3) communication If the resumption of examination described in C-V, 4.7.1 results in an allowable and admissible text being filed or in the applicant convincing the examining division that the text already filed in response to the Rule 71(3) communication is in fact admissible and allowable, a second Rule 71(3) communication is sent based on this agreed text. Such cases are dealt with in the same way as described in C-V, 4.6."
                        },
                        "4.7.3": {
                            "content": "No agreement reached on a text - refusal If no agreement can be reached on a text after examination is resumed, the application is refused (see C-V, 14). For details on conducting resumed examination proceedings before issuing such a decision, see C-V, 4.7.1."
                        }
                    }
                },
                "4.8": {
                    "content": "Fees to be paid within the second Rule 71(3) period Where the applicant files amendments or corrections in response to the first communication under Rule 71(3), they do not have to pay either the fee for grant and publishing or the claims fees (see C-V, 4.1). A second Rule 71(3) communication may then be issued either immediately (where the amended/corrected text is allowable, see C-V, 4.6) or after examination is resumed and an allowable text is agreed on (see C-V, 4.7.2).",
                    "subsections": {
                        "4.8.1": {
                            "content": "Claims fees For the text on which the second Rule 71(3) communication is based to be deemed approved according to Rule 71(5), the applicant must pay any claims fees due in response to the communication, thus also avoiding deemed withdrawal of the application under Rule 71(7). For the calculation of claims fees due at this stage, see C-V, 1.4. Since no claims fees would normally have been paid in response to the first Rule 71(3) communication, the number of claims in the text on which this first communication was based plays no role in calculating the amount of the claims fees due in response to the second Rule 71(3) communication. However, in cases where the applicant paid the claims fees voluntarily in response to the first Rule 71(3) communication, the amount paid is credited according to Rule 71a(5) (see C-V, 4.2 and A-X, 11.2)."
                        },
                        "4.8.2": {
                            "content": "Fee for grant and publishing For the text on which the second Rule 71(3) communication is based to be deemed approved according to Rule 71(5), the applicant must pay the fee for grant and publishing in response to the communication, thus also avoiding deemed withdrawal of the application under Rule 71(7). For European patent applications filed before 1 April 2009 or international applications entering the European phase before that date, the fee for grant and publishing incorporates a fee for each page of the application in excess of 35 (see C-V, 1.2 and A-III, 13.2). If the number of pages of such an application changes between the first and second Rule 71(3) communication, it is the number of pages on which the second Rule 71(3) communication is based that is used to calculate the fee amount. Where the applicant paid the fee voluntarily in response to the first Rule 71(3) communication, the amount paid will be credited according to Rule 71a(5) (see C-V, 4.2 and A-X, 11.1)."
                        }
                    }
                },
                "4.9": {
                    "content": "Reply explicitly disapproving with the proposed text without indicating an alternative text If the applicant replies to the communication under Rule 71(3) by simply disapproving with the text proposed for grant, not indicating an alternative and not paying any fees or filing the translations of the claims, the following will apply: (1) If the text proposed for grant was based on the main request submitted by the applicant (without any amendments or corrections proposed by the examining division), the application will be refused, provided that the criteria in C-V, 4.7.1 are met. The basis for the refusal in this case is the absence of an application text agreed to by the applicant (Art. 113(2)). (2) If amendments or corrections were proposed by the division in the Rule 71(3) communication, the applicant's disagreement is interpreted as a rejection of the proposal and the procedure continues as described in C-V, 4.6.1. (3) If the communication under Rule 71(3) was based on an auxiliary request, the applicant's disagreement is interpreted as a request to base the grant on a higher-ranking request. The procedure continues as described in C-V, 4.6.2 and 4.7.1.1. If it is not clear which higher- ranking request the applicant wishes to pursue, the examining division must request clarification of this in resumed examination proceedings. If the applicant first files only their disagreement with the text and then (still within the Rule 71(3) period) a request for amendment or correction, this is interpreted as a desire to proceed with the application as amended or corrected. The procedure in C-V, 4 applies. (i) filing further amendments or corrections (ii) rejecting amendments proposed by the examining division in the second Rule 71(3) communication (iii) reverting to a higher-ranking request (where the second Rule 71(3) communication is based on an auxiliary request). In particular, in such cases the applicant will be required neither to pay the fee for grant and publishing or any claims fees, nor to file translations of the claims within this second period under Rule 71(3). If the examining division agrees to a text (either with or without resumption of examination), a third communication under Rule 71(3) is then sent. Furthermore, if the applicant replies to the second Rule 71(3) communication by rejecting amendments proposed by the examining division in the first Rule 71(3) communication (where these have not been superseded), the procedures described in C-V, 4.1 to 4.9 likewise apply mutatis mutandis (no need to pay fees or file translations, etc.). In respect of repeated requests for amendments in response to the second or subsequent Rule 71(3) communication, the division may exercise its discretion under Rule 137(3) not to admit such amendments (H-II, 2.5.1). If the division intends not to admit the amendments, it will resume the examination proceedings, e.g. by summoning the applicant to oral proceedings."
                },
                "4.10": {
                    "content": "Amendments/corrections filed in second Rule 71(3) period In cases where a second Rule 71(3) communication is sent (see C-V, 4.6 and 4.7.2) and the applicant replies within the second Rule 71(3) period by doing one or more of the following, the procedures explained in C-V, 4.1 to"
                }
            },
            "content": " communication If the applicant, within the period under Rule 71(3), requests reasoned amendments or corrections to the communicated text (see C-V, 4.3 for the reasoning required), the examining division will issue a new Rule 71(3) communication if it gives its consent (i.e. if it finds the amendments admissible and allowable; see C-V, 4.6); otherwise it will resume the examination proceedings (see C-V, 4.7). This also applies in the following cases: - if the applicant requests the reversal of amendments proposed by the examining division in the Rule 71(3) communication (see C-V, 4.6.1) - if the Rule 71(3) communication was based on an auxiliary request and the applicant replies by requesting that a grant be based on a higher-ranking request (see C-V, 4.6.2 and 4.7.1.1). In this and sections C-V, 4.1 to 4.10, unless otherwise stated, the terms \"amendments\" and \"corrections\" refer only to amendments or corrections of the application documents and not of other documents (e.g. bibliographic data, the designation of the inventor, etc.)."
        },
        "5. ": {
            "title": "Further requests for amendment after approval The criteria for assessing the admissibility of such amendments are dealt with in detail in H-II, 2.6. The procedure for dealing with such late-filed amendments is explained in C-V, 6.",
            "subsections": {}
        },
        "6. ": {
            "title": "The examining division resumes examination after approval of the text",
            "subsections": {
                "6.1": {
                    "content": "When does the examining division resume examination after approval? Following the applicant's approval in response to the Rule 71(3) communication (see C-V, 2), the examining division may resume the examination procedure at any time up to the moment the decision to grant is handed over to the EPO's internal postal service for transmittal to the applicant (see G 12/91). This will seldom occur, but may be necessary if: - the applicant files further prior art necessitating further substantive examination - the examining division becomes aware of very relevant prior art following observations by third parties under Art. 115 - the applicant files amendments or corrections (having already approved the text) - the examining division becomes aware in some other way of circumstances that cause the subject-matter claimed to fail to comply with the EPC. The resumption of examination after approval is subject to the same considerations as resumption due to amendments filed in the Rule 71(3) period (see C-V, 4.7.1). The next action issued after resumption of examination must however indicate that the proceedings have been resumed as well as the substantive reasons that led to the resumption. In particular, the applicant's right to comment (Art. 113(1)), the right to at least one communication under Art. 94(3) and Rule 71(1) and (2) in examination proceedings (see C-III, 4) and the right to oral proceedings on request (Art. 116(1)) must be respected. The criteria applied in assessing the admissibility of amendments or corrections filed by the applicant after approval are dealt with in H-II, 2.6."
                },
                "6.2": {
                    "content": "A further communication under Rule 71(3) A second Rule 71(3) communication is issued if the resumed examination results in a text on the basis of which a patent can be granted (substantive amendments directed to resolving the issues which gave rise to the resumption of examination are possible). If the translations of the claims have already been filed (see C-V, 1.3) and the fees paid (see C-V, 1.2 and 1.4) in reply to a previous Rule 71(3) communication, e.g. in the case of resumption of examination after approval (see C-V, 6 and Rule 71(6)), the applicant must express agreement as to the text to be granted (Rule 71a(1)) within the non-extendable four-month period mentioned in the further Rule 71(3) communication (e.g. by approving the text and verifying the bibliographic data, by confirming that grant proceedings can continue based on the documents on file and/or by stating which translations of the claims already on file are to be used). This also applies if a further Rule 71(3) communication was sent."
                },
                "6.3": {
                    "content": "Crediting of fees under Rule 71a(5) If, in response to an invitation under Rule 71(3), the applicant has already paid the fee for grant and publishing or the claims fees, the amount paid will be credited if a further such invitation is issued. For more details, see A-X, 11."
                }
            }
        },
        "7. ": {
            "title": "Correction of errors in the decision to grant Under certain circumstances, a decision to grant a European patent may be corrected. For more details, see H-VI, 3.",
            "subsections": {}
        },
        "8. ": {
            "title": "Further processing If the applicant fails to meet the time limit under Rule 71(3), further processing may be requested under Art. 121 (see E-VIII, 2). The procedure to follow is explained in C-V, 3.",
            "subsections": {}
        },
        "9. ": {
            "title": "Refund of the fee for grant and publishing If the application is refused, withdrawn prior to notification of the decision on the grant of a European patent or, at that time, deemed withdrawn, the fee for grant and publishing will be refunded (for more details, see A-X, 10.2.5).",
            "subsections": {}
        },
        "10. ": {
            "title": "Publication of the patent specification The decision to grant contains the date of the mention of the European patent's grant and is sent to the applicant when the technical preparations for printing the patent specification have been completed.",
            "subsections": {},
            "content": " As soon as possible after the mention of the grant is published in the Bulletin, the EPO publishes the patent specification containing the description, claims (in the three official languages) and any drawings. The front page of the published specification shows, in particular, the contracting states still designated at the time of grant (or whose designation has been withdrawn after completion of the technical preparations for printing). Regarding the form in which the publication takes place, see the decision of the President of the EPO dated 12 July 2007, Special edition No. 3, OJ EPO 2007, D.3. Mistakes in a European patent specification made during its production have no effect on the content of the patent granted. For this, only the text on which the decision to grant is based is decisive (see H-VI, 4). If necessary, the EPO may arrange for correction to be made public as soon as any mistake in a specification is discovered. This is done by means of a note in the European Patent Bulletin and publication of a corrigendum, the sole purpose being to bring the specification into line with the content of the decision to grant (see Rule 143(2) and the decision of the President of the EPO dated 15 July 2014, OJ EPO 2014, A86, Art. 1(2))."
        },
        "11. ": {
            "title": "Withdrawal before publication of the patent specification The European patent specification is not published if the application is withdrawn before termination of the technical preparations for publication.",
            "subsections": {},
            "content": " If, after termination of the technical preparations, the application is withdrawn to avoid publication, non-publication cannot be guaranteed. The EPO will, however, try (in accordance with the principles of J 5/81) to prevent publication on a case-by-case basis if the stage reached in the publication procedure permits this reasonably easily. The application may be withdrawn by means of a signed declaration, which should be unqualified and unambiguous (see J 11/80). The applicant is bound by an effective declaration of withdrawal (see J 25/03, J 4/97 and J 10/87) (see also E-VIII, 8)."
        },
        "12. ": {
            "title": "Certificate As soon as the European patent specification has been published, the EPO issues the proprietor with a certificate attesting that the European patent has been granted to the person named on the certificate. Where there is more than one proprietor, each of them is issued with a certificate.",
            "subsections": {},
            "content": " Proprietors may request that a certified copy of the certificate with the specification attached be supplied to them upon payment of an administrative fee. For further details see the decision of the President of the EPO dated 17 December 2021, OJ EPO 2021, A94, and the notice from the EPO dated 17 December 2021, OJ EPO 2021, A95."
        },
        "13. ": {
            "title": "European Patent Bulletin If no notice of opposition is recorded in the dossier of the European patent within nine months of publication of the mention of grant, the patent proprietor is informed and an appropriate entry is published in the European Patent Bulletin (Art. 1(1) of the decision of the President of the EPO dated 15 July 2014, OJ EPO 2014, A86). If it subsequently emerges that an opposition was filed in due time, the proprietor is again informed and a correction is published in the Bulletin.",
            "subsections": {}
        },
        "14. ": {
            "title": "Refusal A decision to refuse the application cannot be issued without a first communication in examination having been sent (see C-III, 4 and E-IX, 4.1)",
            "subsections": {},
            "content": " or oral proceedings having been held (see C-III, 5). Consequently, the examining division may not refuse the application directly after the reply to the search opinion under Rule 70a(1) or directly after the reply to the WO-ISA under Rule 161(1), even if the objections raised in the search opinion or WO-ISA remain the same and there is no pending request for oral proceedings. The examining division may also not refuse the application if the only communication issued is under Rule 137(4). If, despite the applicant's submissions, i.e. amendments or counter- arguments, objections persist after the applicant's reply to the first communication under Art. 94(3) in examination, then a refusal can be issued. If there is a pending request for oral proceedings, oral proceedings must be held and the decision to refuse will, where appropriate, be announced at the end of them. Similarly, if a summons was issued as the first action in examination, the decision to refuse will, where appropriate, be announced at the end of the oral proceedings. If a refusal is envisaged, the first member should bring the application before the other members of the examining division, who may then decide to refuse the application. In any event, the first member will always consult the other members of the division at some stage to establish whether an application should be refused or a patent granted. If the division intends to refuse the application, a written reasoned decision is necessary and this will normally be prepared by the first member (see E-X, 2.3 and E-X, 2.6). In preparing the decision, the first member must take care to abide by the general principles set out in Art. 113(1), i.e. the decision must be based on grounds or evidence that the applicant has had the opportunity to comment on (see E-X, 1.1 and E-X, 1.2). In addition, the applicant's attention must be directed to the provisions for appeal laid down in Art. 106 to Art. 108. If oral proceedings take place (see E-III), the decision may be given orally but must subsequently be notified in writing, the time limit for appeal then running from the date of such notification. If the applicant appeals against the decision and the examining division considers, in the light of the applicant's statement, that the appeal is admissible and well-founded, it should rectify its decision accordingly within three months after receipt of the statement of grounds. Otherwise, the appeal will be considered by a board of appeal. If a decision to refuse a patent is reversed on appeal, the application may be referred back to the examining division for further examination. In such a case, the further examination will normally be entrusted to the examiner who performed the original examination. The examining division is bound by the reasoning of the board of appeal in so far as the facts are the same."
        },
        "15. ": {
            "title": "Decision according to the state of the file A special case is where the applicant does not file comments or amendments in reply to the examiner's communication but requests a decision \"according to the state of the file\" or \"on the file as it stands\", meaning that the applicant wishes to close the debate and a decision is taken on the basis of the current status of the application and any supporting arguments. The decision, which may be appealed, may only be based on grounds and evidence that the applicant has had an opportunity to comment on (Art. 113(1)).",
            "subsections": {
                "15.1": {
                    "content": "The request for a decision according to the state of the file An applicant may file a request for a decision according to the state of the file at any stage during examination proceedings, provided that at least one communication in examination has been sent (see also C-V, 15.4). The request should be in writing (see C-VII, 2.3) and should be explicit and unambiguous, preferably using the wording \"according to the state of the file\" or \"on the file as it stands\". If the request is not clear in this respect, the examiner should solve the ambiguity with an enquiry to the applicant. If, at the time the applicant files a request for a decision according to the state of the file, a request for oral proceedings is pending, the examining division will interpret the request for a decision as equivalent to the applicant's implicit withdrawal of the pending request for oral proceedings."
                },
                "15.2": {
                    "content": "Decision by means of a standard form If the applicant has filed an explicit and unambiguous request for a decision according to the state of the file (see C-V, 15.1) in their latest reply, the examiner may be in a position to refuse the application using a standard form referring to the previous communication. To comply with the requirement that such a decision be reasoned (Rule 111(2)), a number of conditions have to be met: (i) the previous communication must properly identify the application documents on file, be well-reasoned and complete with respect to the grounds and the reasons for the refusal of the current request and address all the arguments raised by the applicant (ii) no new arguments or amendments have been submitted by the applicant since the previous communication (iii) all objections raised in the previous communication referred to must still apply. If, in its reply to the last communication from the examining division, the applicant has submitted new arguments that are at least likely to be effective, these arguments cannot be ignored even if, in the same reply, the applicant has explicitly requested a decision according to the state of the file. In this case, the division must consider these freshly presented arguments either by issuing a regular reasoned decision (see C-V, 15.3) or by issuing a further communication (see C-V, 15.4). A decision according to the state of the file by means of a standard form can be based on minutes of a consultation if they contain a full exposition of all the legal and factual reasons for refusing the application, as in the case of minutes of a consultation issued as the first communication in examination (see C-VII, 2.5). Examining divisions are not to refer to the minutes of oral proceedings in decisions by means of a standard form. Although it is possible by way of exception to refer to more than one communication in the standard form, the examiner should carefully consider the requirements of Rule 111(2). In particular, if the different communications deal with different sets of claims, such that it is not clear which of the reasons given by the examining division in its communications might be essential to the decision to refuse, a fully reasoned decision should be issued instead (see C-V, 15.3)."
                },
                "15.3": {
                    "content": "Issuing a self-contained decision If the conditions set out in C-V, 15.2 are not met, a self-contained decision to refuse must be issued to comply with Rule 111(2). This is necessary, for example, where the numerous objections raised in the previous communications with respect to different sets of claims render unclear the grounds and the reasons for the refusal. This also applies if the applicant has made further submissions (including amendments) since the previous communication, where these do not cause the subsequent decision to be based on grounds or evidence on which the applicant has not had the opportunity to present comments. In all cases, the requirements of Art. 113(1) should be carefully considered (see also E-X, 1)."
                },
                "15.4": {
                    "content": "Issuing a further communication (no refusal) If it appears that the previous communications were insufficiently reasoned or incomplete, or if the applicant has filed amendments and/or arguments since the previous communication, the examiner should carefully consider Art. 113(1) and Rule 111(2) before issuing a refusal (see E-X, 1). A further communication may have to be issued with sufficient reasoning unless oral proceedings are to be held (see E-III, 2), in which case the reasoning would be given in the summons (Rule 116(1)). In the communication or summons the applicant should be informed that the request for a decision according to the state of the file could not be followed. Annex Standard marks for indicating amendments or corrections by the divisions"
                }
            }
        }
    },
    "Chapter VI – Time limits and acceleration of examination": {
        "1. ": {
            "title": "Time limits for response to communications from the examiner",
            "subsections": {
                "1.1": {
                    "content": "General considerations The general considerations relating to time limits are set out in E-VIII. The time limit for response to a communication from the examiner should in general be between two and four months in accordance with Rule 132. The period to be allowed will be determined by the examiner taking all the factors relevant to the particular application into account. These include the language normally used by the applicant or their representative; the number and nature of the objections raised; the length and technical complexity of the application; the proximity of the EPO to the applicant or, if they have one, their representative and the distance separating the two. If the only outstanding objection is the need to amend the description, the examiner may invite the applicant to amend the description by issuing a communication under Art. 94(3) with a two-month time limit to reply. Alternatively, the examiner may consult the applicant informally, e.g. by telephone, explain the objection and set a one-month time limit documented in the minutes of the consultation referring to this objection (unless a shorter limit is agreed during the consultation). This time limit can be extended if the applicant so requests before it expires (see E-VIII, 1.6). Failure to respond to a communication under Art. 94(3) and Rule 71(1) and (2) in due time results in the application being deemed withdrawn. This loss of rights is subject to further processing (see E-VIII, 2)."
                },
                "1.2": {
                    "content": "Special circumstances In certain special circumstances the examiner may allow a time limit of up to six months. The six-month period may be appropriate, for instance, if the applicant resides a long way from the representative and the language of the proceedings is not one to which the applicant is accustomed; or if the subject-matter of the application or the objections raised are exceptionally complicated (for more information see E-VIII, 1.2). The search opinion is not a communication under Art. 94(3)."
                }
            }
        },
        "2. ": {
            "title": "Influencing the speed of examination proceedings – PACE With a request for accelerated examination under the programme for accelerated prosecution of European patent applications (PACE), the applicant can speed up the proceedings at the examination stage (see the notice from the EPO dated 30 November 2015, OJ EPO 2015, A93). For further information, see E-VIII, 4.2.",
            "subsections": {}
        },
        "3. ": {
            "title": "Further ways to accelerate examination Where the applicant files a request for examination before the search report is transmitted to them, they may also dispense with the need to comply with the invitation pursuant to Rule 70(2) and file a categorical request for examination whatever the search result may be, thereby also accelerating the procedure (see the notice from the EPO dated 30 November 2015, OJ EPO 2015, A93). In this case, confirmation that they desire to proceed further with their application is deemed given when the search report is transmitted to them so that in accordance with Rule 62(1) the search report is not accompanied by a search opinion. Under these circumstances, if the application is not in order for grant, a communication under Art. 94(3) and Rule 71(1) and (2) is transmitted to the applicant. Own-volition amendments under Rule 137(2) may in that case be submitted by the applicant in reply to this communication (see C-III, 2).",
            "subsections": {},
            "content": " If the application is in order for grant, the subsequent procedure will depend on whether it is possible at that time to carry out the search for conflicting European patent applications according to Art. 54(3) (see C-IV, 7.1 and B-XI, 7). If it can, and assuming no conflicting applications are identified, then the communication under Rule 71(3) is transmitted to the applicant. If it cannot yet be carried out, then the communication from the examining division will be postponed until the said search is completed. If the European patent application is subsequently withdrawn before the substantive examination has begun, the examination fee will be refunded in full. If substantive examination has already begun, withdrawal of the application may still result in a refund of 50% of the examination fee in the cases laid down in Art. 11(b) RFees (for more details, see A-VI, 2.5 and OJ EPO 2016, A49). The applicant can also accelerate the processing of Euro-PCT applications by waiving the right to the communication under Rule 161 and Rule 162 (see E-IX, 3.1) or by filing an explicit request for early processing of an international application by the EPO as designated/elected Office (see E-IX, 2.8)."
        }
    },
    "Chapter VII – Other procedures in examination": {
        "1. ": {
            "title": "General remark In this chapter, the term \"applicant\" is intended to mean \"representative\"",
            "subsections": {},
            "content": " where the applicant has appointed one. Where this is the case, the procedures described here should be conducted with that representative."
        },
        "2. ": {
            "title": "Consultations",
            "subsections": {
                "2.1": {
                    "content": "General There are instances where personal consultation with the applicant can be helpful in advancing the procedure. Such a consultation will preferably be held by videoconference so that, where necessary, documents can be presented, other persons participate and the identity of those attending verified (see C-VII, 2.2). The shared area in MyEPO Portfolio provides a space for applicants and examiners to upload documents and informally discuss changes (see OJ EPO 2023, A59). Consultations can also be held by telephone at the request of the applicant, if the situation so requires. The consultation may take place at the initiative of either the applicant or the examiner or formalities officer. However, the decision on whether it is to be held is up to the formalities officer or examiner. A consultation request from the applicant should usually be granted unless the nature of the issue to be discussed requires formal proceedings or the examiner believes that no useful purpose would be served by such a discussion. For example, where substantial differences of opinion exist in examination, written procedure or oral proceedings are normally more appropriate. Typical situations in which the applicant may want a consultation are: (i) to enquire about a procedural issue such as how to proceed in particular circumstances (note however that the examiner is not normally in charge of formal issues such as extensions of time limits and payment of fees); for enquiries as to the processing of files, see E-VIII, 7 (ii) where there appears to be an error in the communication or in the applicant's reply making it difficult for them or the examiner to prepare the next reply/communication (e.g. wrong document cited, communication based on wrong set of claims, new submissions referred to but not included). Typical situations in which the examiner may consider it appropriate to consult the applicant are: (iii) where there appears to be confusion about certain points in dispute, e.g. the applicant seems to have misunderstood the examiner's arguments – or vice versa – so that the written procedure is leading nowhere (iv) where the application seems to be ready for grant except that the examiner needs to clarify some minor issues with the applicant or would like to discuss a proposal for amendments to overcome the objections raised (v) where amendments or corrections requested by the applicant after the Rule 71(3) communication have been submitted but the examiner cannot agree to them. For consultations in response to the EESR before the application has entered the examination phase, see B-XI, 8. Telephone conversations held for the sole purpose of arranging a date for a consultation or oral proceedings do not in and of themselves constitute a consultation within the meaning of this section. Therefore, no minutes need to be prepared (C-VII, 2.4) unless so required where the applicant agrees to a notice period of less than two months for oral proceedings (E-III, 6)."
                },
                "2.2": {
                    "content": "Persons participating in the consultation The person consulted must be entitled to act for the applicant before the EPO. If the applicant is a natural or legal person having either residence or place of business in a contracting state, consultations may only be conducted with: (a) the applicant (see A-VIII, 1.1) (b) a professional representative (see A-VIII, 1.1) (c) a duly authorised employee of the applicant (see A-VIII, 1.2) or, to the extent defined in Art. 134(8), a legal practitioner (see A-VIII, 1.4). Regarding (c), see also A-VIII, 1.5. If the applicant is a natural or legal person having neither residence nor place of business in a contracting state, consultations may only be conducted with: - a professional representative (see A-VIII, 1.1) - a legal practitioner (see A-VIII, 1.4 and A-VIII, 1.5). The person entitled to act before the EPO, i.e. one of those listed above, may be accompanied by other persons, such as the inventor, a non-European representative or an employee of the applicant. At the request of the entitled person, such other persons may be allowed to take part in the consultation if their participation is relevant to the proceedings. Where the consultation is held by videoconference, these persons may connect from a different location than the entitled person. If there is any doubt as to the identity of any of the persons participating in the consultation or if the consulted person so requests, the examiner or formalities officer will check the identity of the person or persons concerned. This can be done by inviting them to show an official identity document to the camera in the case of a videoconference or to send a copy of the document by email. For data protection reasons, the copy of the identity document sent by email will not be included in the file (see also E-III, 8.3.1). From the examining division, only the first member dealing with the case will normally be present. However, there is no objection to one or even both of the other members participating in the consultation. When the inventor or an expert is attending the consultation, it is recommended that the chair of the examining division at least should also attend. However, the applicant or representative does not have the right to demand the presence of additional division members. If a request is made for a consultation with all three members, it will usually be advisable to arrange for the holding of oral proceedings instead."
                },
                "2.3": {
                    "content": "Informal nature of consultations A consultation is not a formal procedure (for formal oral proceedings before the examining division, see E-III), and the character of the minutes of the consultation depends on the nature of the matters discussed. It should always be made clear to the applicant that any agreement reached is ultimately subject to the views of the other members of the examining division. A decision cannot be taken during a consultation. Oral statements made during a consultation must be confirmed in writing in order to be procedurally effective. Indeed, such statements are not normally legally binding. Such a statement cannot, for instance, be effective to meet a time limit (see, however, C-VII, 2.4). For the purpose of the European grant procedure, except in oral proceedings, only written statements are effective and only from the date on which they are received by the EPO. Oral statements substantively addressing the objections raised in an earlier communication may however lead the examiner to cancel any running time limit (see C-VII, 2.4 (iv)). Furthermore, documents validly submitted by email during the consultation (see C-VII, 3) may indeed be effective to meet a running time limit (see C-IV, 3). If a fresh objection of substance is raised during a consultation and no amendment to meet it is agreed at the time, the objection must be confirmed by a communication of the minutes of the consultation, giving the applicant a fresh period within which to reply (see C-VII, 2.4(iii))."
                },
                "2.4": {
                    "content": "Minutes of a consultation The minutes of a consultation should list the participants, summarise the main results and state any oral requests. They must be signed by the examiner. Documents filed by email during a consultation (see C-VII, 3), such as new claims or an amended description, must be attached to the minutes. The minutes should always indicate whether the next action is due to come from the applicant or the examiner. In this regard, the minutes when despatched to the applicant may: (i) be issued for information only, in which case if a time limit is still pending, it should be observed; if no time limit is pending, no action is required from the applicant (ii) be issued such as to extend a pending time limit, in which case the applicant must reply within that extended time limit (iii) be issued such as to set a new time limit for response, in which case the applicant must reply within this new time limit (iv) be issued such as to cancel a pending time limit (v) be issued such as to reflect the decision to cancel scheduled oral proceedings where an agreement on an allowable set of claims can be reached during the consultation. Cancellation of the oral proceedings is communicated to the applicant orally during the consultation and noted in the minutes. No separate communication regarding the cancellation of the oral proceedings is issued (vi) be issued for information only where the applicant announces during the consultation that they do not intend to attend oral proceedings. The applicant is informed that oral statements must be confirmed in writing to be procedurally effective (see C-VII, 2.3). Where the consultation is concerned with the clarification of obscurities, the resolution of uncertainties or putting the application in order by clearing up a number of minor points, it will usually be sufficient for the examiner to make a note in the minutes of the matters discussed and the conclusions reached or amendments agreed unless a time limit is set for reply (see below). Where the consultation involves the discussion of weightier matters, such as questions of novelty, inventive step, unity or whether the amendment introduces added subject-matter, a fuller note of the topics raised will be made in the minutes. In particular, the minutes will specify in concrete terms the topics discussed, together with any amendments agreed, any opposing views, the reasons for any change of opinion and any conclusions drawn unless these are clear from other documents in the dossier. Furthermore, the reasons for any amendments required by the examiner should be clearly indicated. It is important to avoid statements that are unclear, ambiguous or universally applicable in the minutes. For example, statements such as \"Amendments to the claims were proposed to take account of the prior art cited in the search report\" are of no assistance to members of the public, other members of the division or indeed the first member at later stages of the procedure. The same applies to conclusions worded in a generalised manner. If the minutes are sent as a first communication in examination, see C-VII, 2.5. The minutes are placed in the dossier, made available for file inspection (including all documents filed by an applicant or representative during the consultation) and sent to the applicant or their representative, even where the consultation merely changes/confirms/cancels the time/date of a proposed consultation. However, by way of exception, consultations relating to amendments agreed immediately prior to completing the Rule 71(3) communication may be reflected in that communication, provided that there is no uncertainty for the public as to what was agreed. The amendments must be identified as precisely as possible."
                },
                "2.5": {
                    "content": "Minutes as the first communication in examination A consultation may be used as the first action in examination provided that: - minutes are issued - the minutes present the matters discussed with the same level of information and structure as an Art. 94(3) communication - the minutes are issued with a time limit for reply not shorter than four months unless agreed otherwise with the applicant. Matters (e.g. objections or reasoning) not discussed during the consultation itself may be included in such minutes. However, it must be made clear that they were not discussed during the consultation. If the above criteria are met, minutes issued as the first action in examination replace the first communication under Art. 94(3) and Rule 71(1), (2) (see C-III, 4). Where the examining division is considering issuing a summons to oral proceedings as the first action in examination (see C-III, 5), the examiner may inform the representative of this in a call. Instead of issuing separate minutes, a remark regarding the call may be included in the summons. If, however, the examining division decides not to issue summons at that stage, minutes must be issued."
                }
            }
        },
        "3. ": {
            "title": "Use of email At present, email is an admissible filing means only for the submission of subsequently filed documents as referred to in Rule 50 during consultations and during oral proceedings held by videoconference (for details, in particular on signature and format of attachments, see the decision of the President of the EPO dated 13 May 2020, OJ EPO 2020, A71, and E-III, 8.5.2).",
            "subsections": {
                "3.1": {
                    "content": "Initiation of exchanges by email Except in cases where it is a valid filing means (see C-VII, 3 and E-III, 8.5.2), neither the examiner nor the applicant should use email without having previously agreed to this, e.g. during a consultation. There must be mutual agreement between the examiner and the applicant to such use if the content of the email goes beyond simply arranging of a date for a consultation or oral proceedings. Furthermore, the mere fact that an email address is indicated on a letter head does not mean that the examiner can use it for file-related matters. If, on the other hand, an examiner receives an email from an applicant concerning procedural requests or addressing substantive issues without previous agreement, this email cannot simply be ignored, but must be dealt with, ensuring that the content is put in the official file (see also T 599/06). A reply should be sent making clear that email is not an official means of communication and that requests should be filed by permitted means (see A-II, 1.1, A-II, 1.2 and A-II, 1.3)."
                },
                "3.2": {
                    "content": "Confidentiality For non-published applications, confidentiality must be carefully maintained, and substantive matters should not form part of any email correspondence about such applications."
                },
                "3.3": {
                    "content": "Inclusion in the file of any email exchange If email is used, it is essential to ensure that email exchanges are properly documented in the file by sending the result of the consultation to the applicant for information with no time limit. This ensures that the exchange is included in the public part of the file and that the applicant is aware of this. Submissions filed by email during a consultation or during oral proceedings held by videoconference, including all attachments, should be annexed to the minutes (see E-III, 8.5.2 for details)."
                }
            },
            "content": " Other than in the above-mentioned cases, email has no legal effect in proceedings under the EPC and thus cannot be used to validly perform any procedural act and, in particular, to comply with time limits (see OJ EPO 2000, 458, and A-VIII, 2.5). If, for instance, shortly before oral proceedings, the applicant would like to submit new requests and/or amended documents, they should do so by electronic filing or fax. Documents submitted via electronic filing are normally visible in the electronic file on the same day. Examples of situations where exchanges by email may be useful are: (i) to arrange a date for a consultation (ii) when, during a consultation, possible amendments to claims are being discussed and the applicant wants to communicate them immediately without submitting them formally (iii) shortly before oral proceedings to send an electronic copy of amended claims in addition to the official submission made; this ensures that the examining division gets the documents well in time to prepare for the oral proceedings. Emails cannot replace an official communication under Art. 94(3)."
        },
        "4. ": {
            "title": "Taking of evidence",
            "subsections": {
                "4.1": {
                    "content": "General remark The general considerations relating to the taking of evidence are set out in E-IV. This section deals only with the kind of evidence most likely to arise in pre-grant proceedings (i.e. written evidence)."
                },
                "4.2": {
                    "content": "Producing evidence An examining division does not, as a general rule, require evidence to be produced. The primary function of the examiner in proceedings before grant is to point out to the applicant any ways in which the application does not meet the requirements of the EPC. If the applicant does not accept the examiner's view, then it is for them to decide whether they wish to produce evidence in support of their case and, if so, what form that evidence should take. The examining division should afford the applicant a reasonable opportunity to produce any evidence that is likely to be relevant. However, this opportunity should not be given where the examining division is convinced that it would serve no useful purpose or result in undue delay."
                },
                "4.3": {
                    "content": "Written evidence Written evidence can include the supply of information or the production of a document or a sworn statement. For example, to rebut an examiner's allegation of lack of inventive step, the applicant might supply information as to the technical advantages of the invention. Or they might produce a sworn statement, either from themself or from an independent witness, purporting to show that workers in the art have been trying for a long time unsuccessfully to solve the problem with which the invention is concerned or that the invention is a completely new departure in the relevant art."
                }
            }
        },
        "5. ": {
            "title": "Oral proceedings If a request for oral proceedings, even conditional, was filed before the examining division became responsible for the application (see C-II, 1), the division must honour the request, even if it was not repeated in examination.",
            "subsections": {},
            "content": " On dealing with new requests filed in reply to a summons to oral proceedings, see C-IV, 8. As a rule, oral proceedings in examination proceedings are held by videoconference unless the direct taking of evidence is required or if there are other serious reasons for not doing so, e.g. where an impediment prevents an applicant or representative from participating in oral proceedings held by videoconference. Sweeping objections against the reliability of videoconferencing technology or the non-availability of videoconferencing equipment will, as a rule, not qualify as serious reasons in this regard, nor will the need to consider written evidence (see E-III, 1.3, OJ EPO 2020, A134 and A40). The general considerations relating to oral proceedings are set out in E-III."
        },
        "6. ": {
            "title": "Examination of observations by third parties The general considerations relating to observations from third parties are set out in E-VI, 3.",
            "subsections": {}
        }
    },
    "Chapter VIII – Work within the examining division": {
        "1. ": {
            "title": "General remarks An examining division will normally consist of three technical examiners.",
            "subsections": {},
            "content": " However, within the examining division responsible for the application, one member (the first member) will, as a general rule, be entrusted to carry out all substantive examination work up to the point of a decision to grant a patent, issue a summons to oral proceedings or refuse the application. While acting on behalf of the examining division in all communications with the applicant up to that point, this examiner may confer informally with the other members of the division at any time on specific points of doubt or difficulty. The term \"examiner\" as used in this part of the Guidelines is normally understood to mean the \"first\" member. As stated above, the first member may seek the advice of other members of the examining division at any stage in the examination. However, there will come a point when it becomes appropriate for them to refer the case formally to the other members of the examining division. This will be when they consider the case to be in order to proceed to grant or, alternatively, where there seems no possibility of an amendment to overcome their objections or where the applicant has not overcome these objections, and when they consider the case to be in order to proceed to refusal. There are also other circumstances in which reference to the examining division is appropriate, e.g. oral proceedings may be suggested by the examiner or requested by the applicant because an impasse has been reached. In considering whether to refer the application to the division, the examiner should be guided by the principle stated in C-IV, 3. The first member should also bear in mind that when they issue a communication they do so in the name of the division, and the applicant is entitled to assume that if the examiner had doubts as to the views of the rest of the division, they would have discussed the matter with them beforehand. Although the examining division assumes ultimate responsibility for an application as soon as that application passes to it under Rule 10, formal matters are normally dealt with by a formalities officer (see the decision of the President of the EPO dated 12 December 2013, OJ EPO 2014, A6; OJ EPO 2015, A104). Examiners should not spend time checking the work of the Receiving Section or the formalities officer. However, they should refer an application to the formalities officer for further consideration if they believe the formalities report to be incorrect or incomplete. If required by specific circumstances (e.g. sickness), an application may be reallocated to another examiner/examining division. In such cases, the decision to reallocate will be taken by the line manager."
        },
        "2. ": {
            "title": "Recommendation to grant If the examiner considers that the application satisfies the requirements of the EPC and is thus in order to proceed to grant, they should make a brief written report (the \"votum\"). As a general rule, the examiner will list in this report the reasons why, in their opinion, the subject-matter as claimed in the application is not obvious having regard to the state of the art. They should normally comment on the document reflecting the nearest prior art and the features of the claimed invention that make it patentable, although there may be exceptional circumstances where this is not necessary, e.g. where patentability is based on a surprising effect. They should also indicate how any apparently obscure but important points have ultimately been clarified, and if there are any borderline questions that the examiner has resolved in favour of the applicant, they should draw attention specifically to these.",
            "subsections": {}
        },
        "3. ": {
            "title": "Recommendation to refuse When referring an application that is not in order for the grant of a patent to the examining division, the first member should confer with the other members of the division, bringing to their attention the points at issue, summarising the case history to the extent necessary to enable them to obtain a quick grasp of the essential facts and recommending the action to be taken, e.g. refusal, or grant conditional upon certain further amendments. As the other members will need to study the case themselves, there is no need for a detailed exposition. It will be useful, however, to draw attention to any unusual features or points not readily apparent from the documents themselves. If the first member recommends refusal and the issue seems clear-cut, they may have a draft reasoned decision ready for issue by the examining division (see C-V, 14); if the issue is not clear-cut, the drafting of the reasoned decision should be deferred until the division has discussed the case.",
            "subsections": {}
        },
        "4. ": {
            "title": "Tasks of the other members of the examining division When an application is referred to the other members of the division, they will first consider the case individually and each will indicate their opinion on the course of action to be taken. If there is complete agreement with the first member's recommendation, no further consultation will be necessary.",
            "subsections": {},
            "content": " Any further action needed will be entrusted to the first member. If, initially, there is not complete agreement with the first member, or at least one member of the division wishes to discuss the case further, further consultation will be arranged. In such discussions, the division should strive for unanimity, but where this seems unlikely, the difference of opinion must be resolved by voting. When the division is enlarged to four members (see C-VIII, 7), the chair has a casting vote, where necessary. The other members of the division should bear in mind that their function is not to completely re-examine the application. If, following a discussion, the first member's conclusions are generally considered to be reasonable, the other members should accept them."
        },
        "5. ": {
            "title": "Further communication with the applicant If, in the opinion of the examining division, the application can be amended to bring it into a form that meets the requirements of the EPC, then the first member should be entrusted with informing the applicant of the division's opinion that the application should be refused on certain grounds unless satisfactory amendments are submitted within a stated period (see C-VI, 1).",
            "subsections": {
                "5.1": {
                    "content": "When can a summons to oral proceedings be issued in substantive examination? At the beginning of substantive examination, if the examining division is of the opinion that the application cannot be granted directly, at least one substantive communication within the meaning of Art. 94(3) will generally be sent before the division issues a summons to oral proceedings (see C-III, 4). In particular, neither the search opinion of an EESR or a supplementary search (ESOP) nor an opinion or report from the PCT procedure (WO-ISA, SISR, IPRP or IPER) is a communication under Art. 94(3), so even if the applicant has replied to them, it is not generally appropriate to send a summons as a first communication in European substantive examination. Nor are the following communications/requests considered as substantive communications from the examining division for this purpose: invitation under Rule 62a or Rule 63, communication under Rule 137(4), request under Rule 53(3), request under Art. 124 and Rule 141, invitation under Rule 164(2)(a). Exceptionally, a summons to oral proceedings may be issued as the first action in examination proceedings, provided that the criteria set out in C-III, 5 are met. In examination proceedings, where the applicant has been invited to provide a translation of the priority according to Rule 53(3) (see A-III, 6.8.2 and F-VI, 3.4), no summons to oral proceedings will be issued until either the translation is provided or the period for further processing in respect of the time limit according to Rule 53(3) has expired."
                }
            },
            "content": " If, within the time limit, satisfactory amendments are made, the examiner will then report back to the division recommending that the application should proceed to grant. If not, they should report back recommending refusal."
        },
        "6. ": {
            "title": "Decision All decisions are issued by the examining division as a whole and not by an individual examiner. All members therefore sign the written decision, irrespective of whether it was unanimous. If, exceptionally, one or more division members cannot sign the decision, one of the other members - normally the chair – may sign it on their behalf, subject to the conditions defined in E-X, 2.3. A seal may replace the signature.",
            "subsections": {}
        },
        "7. ": {
            "title": "Enlargement of the examining division; consultation of a legally qualified member If the examining division deems it necessary given the nature of a decision, it is enlarged to include a legally qualified member. The decision to enlarge or to set aside an enlargement lies with the examining division.",
            "subsections": {},
            "content": " The participation of a legally qualified member or at least internal consultation of Directorate Patent Law and Processes, the unit responsible for providing legally qualified members for examining and opposition divisions, will be required in the event of a difficult legal question not yet solved by the Guidelines or jurisprudence. The applicant is informed of the division's enlargement in the communication accompanying and/or the annex to the summons or the decision following enlargement, as appropriate. Once the division has been enlarged, communications or decisions must be signed by all four members. If the examining division has been enlarged to four members, the chair will have a casting vote. As a rule, enlargement will be required in cases involving technical opinions (Art. 25 – see E-XIII, 3.1) and where evidence has to be taken according to Rule 117 (including the giving of evidence by witnesses – see E-IV). It is also to be considered in the case of oral proceedings. Where an examining division has been enlarged pursuant to Art. 18(2) but the case is decided in a three-member composition, there should be clear evidence in the public file that a decision to set aside enlargement was taken by the division in its four-member composition prior to the final decision. Therefore, if enlargement is considered no longer necessary, the examining division will set it aside. This decision is not separately appealable. The applicant is informed about the setting aside of the enlargement in the communication accompanying and/or the annex to the summons or the decision following the setting aside of the enlargement. Depending on the nature of the problem, as an alternative to enlarging the examining division, it may be sufficient to consult a legally qualified member in Directorate Patent Law and Processes. For instance, doubts may arise whether an application concerns an invention within the meaning of Art. 52(2) or whether the claimed invention is excluded from patentability by virtue of Art. 53. Such consultation may also be appropriate where legal considerations predominate in a decision, as in proceedings following a request for re-establishment of rights according to Art. 122. Formalities officers may also consult Directorate Patent Law and Processes within the scope of the duties conferred to them under Rule 11(3) (see the decision of the President of the EPO dated 12 December 2013, OJ EPO 2014, A6)."
        }
    },
    "Chapter IX – Special applications": {
        "1. ": {
            "title": "Divisional applications (see also A-IV, 1)",
            "subsections": {
                "1.1": {
                    "content": "General remarks A divisional application may be filed subsequent to the filing of a European patent application or on a Euro-PCT application's entry into the European phase. The divisional application is accorded the same filing date as the parent application, which must be pending when the divisional application is filed (A-IV, 1.1.1), and benefits from any right of priority of the parent application in respect of subject-matter contained in the divisional application. A European patent application may give rise to more than one divisional application, and a divisional application may itself give rise to one or more divisional applications. Divisional applications are to be treated the same as ordinary applications and are subject to the same requirements unless specific EPC provisions, in particular Art. 76 or Rule 36, require something different (G 1/05, G 1/06). Furthermore, as soon as the requirements of Rule 36 and Art. 76(1) are fulfilled, the proceedings for grant of a divisional application become separate and independent from the proceedings concerning the parent application (G 4/98). Pending opposition or appeal proceedings concerning the parent application (or any member of that family of applications) do not constitute grounds for staying the examination proceedings for a divisional application, either by the EPO on its own initiative or on request. Reasons for a stay or interruption of proceedings are set out in E-VII, 1 to E-VII, 3."
                },
                "1.2": {
                    "content": "Voluntary and mandatory division Applicants may file a divisional application of their own volition (voluntary division). The most common reason, however, for filing a divisional application is to meet an objection under Art. 82 due to lack of unity of invention (mandatory division). If the examiner raises an objection due to lack of unity, the applicant is allowed a period (see C-VI, 1) in which to limit their application to a single invention. The limitation of the parent application has to be clear and unconditional. The communication inviting the applicant to limit the application due to lack of unity should therefore indicate that if not limited within the set time limit the application may be refused."
                },
                "1.3": {
                    "content": "Abandonment of subject-matter The mere deletion of subject-matter in the parent application is not prejudicial to the later filing of a divisional application. When deleting subject-matter, the applicant should, however, avoid any statements that could be interpreted as abandonment with substantive effect, thereby impeding the valid filing of a divisional application for that subject-matter (see also H-III, 2.5, last paragraph)."
                },
                "1.4": {
                    "content": "Examination of a divisional application The substantive examination of a divisional application should in principle be carried out in the same way as for any other application. However, there are a number of special points to be considered (see also C-III, 5). The claims of a divisional application need not be limited to subject-matter already claimed in the parent application's claims. Furthermore, no abuse of the system of divisional applications can be identified in the mere fact that the claims of the application on which the examining division had then to decide had a broader scope than the claims granted in relation to the parent application (see T 422/07). However, under Art. 76(1), the subject-matter may not extend beyond the content of the parent application as filed. If a divisional application as filed contains subject-matter additional to that contained in the parent application as filed, it can be amended later so that its subject-matter no longer extends beyond the earlier content, even at a time when the earlier application is no longer pending (see G 1/05). If the applicant is unwilling to remedy the defect by removing that additional subject-matter, the divisional application must be refused under Art. 97(2) for failure to comply with Art. 76(1). The divisional application cannot be converted into an independent application taking its own filing date. Moreover, a further divisional application for this additional subject-matter should also be refused under Art. 97(2) for failure to comply with Art. 76(1). Amendments made to a divisional application subsequent to its filing must comply with the requirements of Art. 123(2), i.e. they may not extend the subject-matter beyond the content of the divisional application as filed (see G 1/05 and T 873/94). If the amendments have not been identified and/or their basis in the application as filed not indicated by the applicant (see H-III, 2.1) and the application is one of those mentioned in H-III, 2.1.4, the examining division may send a communication under Rule 137(4) requesting the applicant to provide this information (see H-III, 2.1.1). If the subject-matter of a divisional application is restricted to only a part of the subject-matter claimed in the parent application, this part must be directly and unambiguously derivable from the parent application as being a separate part or entity, i.e. one that can be used even outside the context of the invention of the parent application (see T 545/92). In the case of a sequence of applications consisting of a root (originating) application followed by divisional applications, each divided from its predecessor (see A-IV, 1.1.2), it is a necessary and sufficient condition for a divisional application of that sequence to comply with Art. 76(1), second sentence, that anything disclosed in that divisional application be directly and unambiguously derivable from what is disclosed in each of the preceding applications as filed (see G 1/06)."
                },
                "1.5": {
                    "content": "Description and drawings The description and drawings of the parent application and the/each divisional application should in principle be confined to matter that is relevant to the invention claimed in that application. However, amendment of the description should be required only where absolutely necessary. Thus, the repetition in a divisional application of matter in the parent application need not be objected to unless it is clearly unrelated to or inconsistent with the invention claimed in the divisional application. As for the matter of cross-references, there is no need for the examiner to check in the description since, under present practice, cross-references are always made between the parent and divisional applications. These appear on the front page of the respective application and patent published after receipt of the divisional application unless the technical preparations for publication have already been completed."
                },
                "1.6": {
                    "content": "Claims Parent and divisional applications may not claim the same subject-matter, even in different words (for further information, see G-IV, 5.4). The difference between the claimed subject-matter of the two applications must be clearly distinguishable. As a general rule, however, one application may claim its own subject-matter in combination with that of the other application. In other words, if the parent and divisional applications claim separate and distinct elements – A and B respectively – that function in combination, one of the two applications may also include a claim for A plus B."
                }
            }
        },
        "2. ": {
            "title": "Applications resulting from a decision under Art. 61",
            "subsections": {
                "2.1": {
                    "content": "General remarks In certain circumstances, before a patent has been granted on a particular application, it may be adjudged by a final decision of a national court that a person other than the applicant is entitled to the grant of a patent on it. In this event the third party may either: (i) prosecute the application as their own application in place of the applicant (ii) file a new European patent application in respect of the same invention (iii) request that the application be refused. If the first of these options is chosen, the third party becomes the applicant in place of the former applicant and the prosecution of the application is continued from the position at which it was interrupted (see also A-IV, 2). If, however, the third party files a new application under Art. 61(1)(b), the provisions of Art. 76(1) apply to this new application mutatis mutandis. This means that the new application is treated as though it were a divisional application i.e. it takes the filing date and benefit of any priority right of the original application (see also A-IV, 1.2). The examiner must therefore ensure that the subject-matter content of the new application does not extend beyond that of the original application as filed. The original application is deemed withdrawn on the new application's filing date for the designated states concerned."
                },
                "2.2": {
                    "content": "Original application no longer pending In cases where the original application has been withdrawn, refused or deemed withdrawn and is thus no longer pending, Art. 61(1)(b) is applicable, allowing the third party to still file a new European patent application in respect of the same invention (see G 3/92)."
                },
                "2.3": {
                    "content": "Partial entitlement If, by a final decision, it is adjudged that a third party is entitled to the grant of a European patent in respect of only part of the matter disclosed in the European patent application, then the above considerations apply only to that part. In such a case, option (i) mentioned in C-IX, 2.1 is not open to the third party and, regarding option C-IX, 2.1(ii), the new application must be confined to that part of the original subject-matter to which the third party has become entitled. Similarly, the original application must, for the designated states concerned, be confined to the subject-matter to which the original applicant remains entitled. The relationship between the new application and the amended original application will be similar to that between two divisional applications, and the relationship between each of those and the original application will be similar to that between divisional applications and the application from which they are divided. The guidance set out in C-IX, 1.4, 1.5 and 1.6 is therefore applicable to this situation."
                },
                "2.4": {
                    "content": "Entitlement for certain designated states only Where the final decision on entitlement applies to only certain designated states, the original application may contain different description, claims and drawings for those states compared with the others (see H-III, 4.1, last paragraph, and 4.3). If the sole result of the application of Art. 61(1) is to divide the right to the grant between the original applicant and the third party so that each may apply for the entire subject-matter for different designated states, each application should be examined in the normal way without regard to the other, with the proviso that the subject-matter of each application must not extend beyond that of the original application."
                }
            }
        },
        "3. ": {
            "title": "Applications where a reservation has been entered in accordance with Art. 167(2)(a) EPC 1973",
            "subsections": {},
            "content": " See H-III, 4.4."
        },
        "4. ": {
            "title": "International applications (Euro-PCT applications)",
            "subsections": {},
            "content": " For more details on these, see E-IX."
        }
    }
}