{
    "Chapter II – General": {
        "1. ": {
            "title": "Search and substantive examination The procedure a European patent application goes through from its filing to the grant of a patent (or the refusal of the application) has two separate main stages, i.e. the search and substantive examination.",
            "subsections": {
                "1.1": {
                    "content": "Contact between the applicant and the search division Consultations with the search division can only take place after the application has entered the examination stage, except in the cases mentioned in B-VIII, 3.2.2 and 4.2.2, and for issues related to the timing of the search report. The search division must not consent to earlier consultations (see also B-XI, 8) and must instead tell applicants that any issues they wish to raise will be dealt with in examination. For the procedure at the examination stage, see C-VII, 2.5."
                }
            }
        },
        "2. ": {
            "title": "Aim of the search The search is aimed at identifying the state of the art relevant for determining whether, and if so to what extent, the claimed invention is new and involves an inventive step.",
            "subsections": {},
            "content": " It is not usually aimed at finding disclosures of potential interest to the applicant, but documents not directly relevant for assessing the patentability of the claimed invention may be cited in the search report in certain circumstances (see B-X, 9.2.2 and 9.2.5). Both the content of the search opinion and the later substantive examination depend on the outcome of the search as it establishes what state of the art is to be taken as the basis for assessing the patentability of the invention. The search must therefore be as complete and effective as possible, within the limitations necessarily imposed by unity of invention and other factors (see B-III, 2, B-VII and B-VIII)."
        },
        "3. ": {
            "title": "Search documentation The search is carried out in in-house or external document collections or databases. Their contents can be accessed systematically, e.g. using keywords, classification symbols or indexing codes. The available documentation consists largely of patent documents but also includes non-patent literature, such as articles from periodicals (see B-IX).",
            "subsections": {}
        },
        "4. ": {
            "title": "Search report The search report contains the results of the search and, in particular, identifies the documents forming the relevant state of the art (see B-X, 9).",
            "subsections": {
                "4.1": {
                    "content": "European searches The main task of the EPO's search divisions is to carry out searches and draw up search reports for European patent applications. However, they may also be called on to perform the various other types of search listed below."
                },
                "4.2": {
                    "content": "Additional European searches An additional search may be necessary once a European patent application reaches the examination stage, for example because: (i) the claims have been amended and now encompass subject-matter not covered by the original search (see, however, C-III, 3.2.1 and H-II, 6.1 on claims not searched because of a lack of unity and H-IV, 4.1.2 on amendments introducing subject-matter from the description and so resulting in claims defining subject-matter which is not linked to the originally searched subject-matter by a single general inventive concept). (ii) the deficiencies which resulted in an incomplete search or the issue of a declaration replacing a search report under Rule 63 or a declaration under Art. 17(2)(a) or (b) PCT (see B-VIII and C-IV, 7.3) have been overcome by amendments or been rebutted during substantive examination. (iii) the examining division has reversed the search division's opinion on novelty or lack of inventive step (see B-III, 1.1) or on other issues (see B-III, 1.2), in particular lack of unity of invention (see B-VII), subject-matter to be excluded from the search (see B-III, 3.11 and B-VIII) or Rule 62a. (iv) the original search was limited or suffered from imperfections. The examining division will use any new documents found in an additional search if it considers them relevant for examining the application. It must then make copies available to the applicant (Art. 113(1)). Similarly, an additional search may be needed if a granted European patent is opposed (see D-VI, 5)."
                },
                "4.3": {
                    "content": "Supplementary European searches An international (PCT) application for which the EPO acts as designated Office or elected Office and which has been accorded an international filing date is deemed to be a European patent application. Where an international (PCT) search report is already available, it will replace the European search report. The search division will then draw up a supplementary European search report or issue a declaration replacing it under Rule 63 except in cases where the Administrative Council has decided that it can be dispensed with (see B-II, 4.3.1). The (S)ISA/IPEA (other than the EPO) will have given opinions on the novelty, inventive step and industrial applicability of the claimed invention under Art. 33(1) PCT and possibly also on unity of invention under Art. 34(3) PCT and any subject-matter to be excluded from the international search/preliminary examination under Art. 17(2)/Art. 34(4) PCT. The search division will consider these opinions but is free to diverge from them in its supplementary European search report and its search opinion (if applicable – see B-XI, 7). The search division can use the documents cited in the international search report to support its findings (e.g. lack of novelty) in the search opinion (if applicable – see B-XI, 7).",
                    "subsections": {
                        "4.3.1": {
                            "content": "Dispensing with the supplementary European search report The Administrative Council has decided that no supplementary European search report is to be drawn up for an international application if: (i) the EPO was the ISA or the SISA (OJ EPO 2009, 594; OJ EPO 2010, 316) (ii) the Swedish Intellectual Property Office, the Austrian Patent Office or the Spanish Patent and Trademark Office was the ISA and it was filed before 1 July 2005 (OJ EPO 1979, 248; OJ EPO 1995, 511; OJ EPO 2012, 212 and 219). The search fee may be reduced in these cases (see A-X, 9.3.1)."
                        },
                        "4.3.2": {
                            "content": "A supplementary European search report is required If a supplementary European search report is required (see B-II, 4.3.1), the supplementary European search will generally be carried out in the same way as a European search. Any limitation is left to the search division's discretion; a fixed approach to this is not possible since the search practices at other ISAs are not fully harmonised with those of the EPO and the documentation available to them may differ too. The EPO generally aims to avoid any unnecessary duplication of work and so relies on the efficiency and quality of the international searches as far as possible. If the international search report has not yet been drawn up when the application enters the European phase, the EPO will wait until it is available before starting to process the application. The EPO as designated Office requests the ISA or the SISA to supply, together with the international search report, copies of the documents cited in it (Art. 20(3) PCT, see also Rule 44.3(a) PCT or Rule 45bis.7(c) PCT). If a cited document is not in one of the EPO's official languages and the search division needs a translation into one of them, it provides this itself (e.g. a patent family member or an abstract of the document in an official language, see B-VI, 6.2) unless it can obtain it from another source, e.g. the applicant or the ISA."
                        },
                        "4.3.3": {
                            "content": "Application documents for the supplementary European search report The European grant procedure, including the supplementary European search, is based on the application documents specified by the applicant when the application enters the European phase (Rule 159(1)(b)). However, if the applicant amends the application within a non-extendable period of six months from notification of a communication under Rule 161(2) (see E-IX, 3), the amended application will be taken as the basis for the supplementary European search instead (see also B-XI, 2). For procedures relating to Euro-PCT applications where no supplementary European search report is drawn up by the EPO, see E-IX, 3.2, 3.3 and 3.4."
                        }
                    }
                },
                "4.4": {
                    "content": "International (PCT) searches For the practice as regards international (PCT) searches, see the PCT International Search and Preliminary Examination Guidelines and the latest version of the EPO's guide for applicants entitled \"Euro-PCT Guide: PCT procedure at the EPO\", which is available at epo.org."
                },
                "4.5": {
                    "content": "International-type searches Under the PCT, the EPO, as an ISA, may be entrusted with carrying out \"international-type searches\" for national patent applications (Art. 15(5) PCT). These searches are by definition similar to international searches, and the same considerations apply, except where the national application searched is found to lack unity of invention, in which case no reasoned statement on this finding is included in the search report and no invitation to pay further search fees is issued. However, it may be possible for applicants to pay these fees directly to the national offices. Where a written opinion is issued, it is drafted in accordance with EPO practice under PCT Chapter I and does include a reasoned statement on any potential lack-of-unity objection."
                },
                "4.6": {
                    "content": "Searches on national applications The EPO search divisions also carry out searches on national applications for some of the EPC contracting states. These Guidelines are not necessarily fully applicable to these national searches and do not always give details of how they differ from European searches. However, national and European searches are largely identical and at any rate compatible."
                }
            },
            "content": " It informs the applicant, the EPO examining divisions and ‒ once published ‒ the public of the relevant state of the art. It is accompanied by a search opinion (see B-XI; except in the cases mentioned in B-XI, 7) and, together, they make up the extended European search report (EESR)."
        }
    },
    "Chapter III – Characteristics of the search": {
        "1. ": {
            "title": "Opinions of the search division",
            "subsections": {
                "1.1": {
                    "content": "Opinions in relation to the search report The aim of the search is to identify the state of the art relevant for assessing novelty and inventive step (see B-II, 2). Decisions on novelty and inventive step are the responsibility of the examining divisions, but the search division already gives the applicant a reasoned assessment of whether the application and the claimed invention meet the EPC requirements in the search opinion (if applicable ‒ see B-XI, 7). The applicant can then reply to this in the examination proceedings (Art. 113(1) and B-XI, 8). The categories the search division assigns to the documents cited in the search report (see B-X, 9.2) similarly amount to implicit opinions on patentability and are subject to review by the examining division at the examination stage (see B-II, 4.2(iii) and B-XI, 1.2), in particular in the light of the applicant's reply (see B-XI, 8). The assessment of patentability at the search stage can have a direct bearing on how the search itself is carried out: see B-III, 3.8 (on searching the subject-matter of dependent claims), B-III, 2.3 (on searching in neighbouring technical fields) and B-IV, 2.6 (on stopping the search when only trivial subject-matter remains)."
                },
                "1.2": {
                    "content": "Opinions on matters relating to limitation of the search Occasionally, matters of substantive examination other than novelty or inventive step have a direct bearing on how the search is carried out and may result in its limitation. The search division's opinions on theses matters are likewise subject to review by the examining division (see T 178/84 and T 631/97, and B-II, 4.2(iii) and B-XI, 1.2), in particular in the light of the applicant's reply to the search opinion (see B-XI, 8). See B-VII (Unity of invention) and B-VIII (Subject-matter to be excluded from the search) for examples."
                }
            }
        },
        "2. ": {
            "title": "Scope of the search",
            "subsections": {
                "2.1": {
                    "content": "Completeness of the search A European search is essentially a thorough, all-encompassing search carried out to a high quality standard. Nevertheless, a search of this kind cannot always be 100% complete, in particular because all information retrieval systems, however they are operated, are inevitably imperfect. The search is carried out in a way that minimises the risk of overlooking complete anticipations of any claims, or other highly relevant prior art. Given the sheer amount of material on less relevant prior art that is available in the document collection, it is acceptable if not all of it is found (however, see also B-III, 2.3). For limitations of the subject-matter searched, see B-VIII. The scope of the international search is defined in Art. 15(4) PCT, which states that the ISA must endeavour to discover as much of the relevant prior art as its facilities permit and must, in any case, consult the minimum documentation specified in Rule 34 PCT. It follows from this definition (\"as much … as its facilities permit\") that international searches must be equivalent in scope to a European search and must be carried out to the same high quality standard. This means that, if the EPO carried out the international search or the supplementary international search, it does not need to draw up a supplementary European search report and its international search report can replace the European search report (Art. 153(6) EPC, see OJ EPO 2010, 316, and OJ EPO 2011, 616; see also B-II, 4.3)."
                },
                "2.2": {
                    "content": "Effectiveness and efficiency of the search The effectiveness and efficiency of any search for relevant documents (Rule 61(1)) depend on the degree of order which is inherent in, or which can be applied to, the searched document collection as it is this order that enables the search division to determine which parts of the documentation to consult. The basic means of creating order in a document collection are words, classification units, indexing codes or bibliographical links. The order can be permanent, as with indexing words or codes and classification symbols, or it can be created on demand by a search strategy judiciously using the basic means mentioned above to identify the parts of the documentation that are likely to contain material relevant to the invention. To ensure its resources are deployed as efficiently as possible, the search division, drawing on its knowledge of the technology in question and the available search tools, uses its judgement to omit parts of the documentation in which it is unlikely that any relevant documents will be found, for example parts containing documents from before the area of technology in question began to develop. Similarly, it only needs to consult one member of a patent family unless it has good reason to suppose that, in a particular case, there are relevant substantial differences in the content of different members of the same family (see B-IX, 2.4)."
                },
                "2.3": {
                    "content": "Search in neighbouring fields The search division carries out the search in document collections and databases in which it can expect to find material covering all the technical fields directly relevant to the invention. The search strategy determines which parts of this documentation should be consulted. The scope of the search may then have to be extended to parts covering neighbouring fields, but it is for the search division to decide in each individual case whether this is necessary in view of what it has already found in the initially consulted parts (see B-III, 3.2). When deciding which technical fields are to be regarded as neighbouring in a particular case, the search division has to consider what appears to be the invention's essential technical contribution and not only the specific functions expressly mentioned in the application. It is left to the search division's discretion whether to widen its search to include fields not mentioned in the application. In deciding on this, it does not put itself in the inventor's shoes and does not try to imagine every single possible application of the invention. The most important question guiding its decision is whether searching in neighbouring fields is likely to uncover material on which a reasonable inventive-step objection could be based (see T 176/84, T 195/84 and G-VII, 3)."
                },
                "2.4": {
                    "content": "Internet searches The search can also cover internet sources, including online technical journals, online databases or other websites (see OJ EPO 2009, 456). The scope of any search on the internet will depend on the specific case, but there are some technical fields, especially in the area of information or software technology, where the most relevant prior art is unlikely to be found without systematically searching there. The search division may use the internet even when searching unpublished applications but must bear its duty to keep them confidential in mind and take great care to ensure that its search terms do not inadvertently disclose any confidential information about the invention. It is up to the search division to select suitable keywords that will enable it to search the invention effectively without disclosing it. This means, for example, not entering long portions of a claim's wording as a search term. On the dating of internet citations, see G-IV, 7.5."
                }
            }
        },
        "3. ": {
            "title": "The subject-matter of the search",
            "subsections": {
                "3.1": {
                    "content": "Basis for the search The search is carried out on the basis of the claims, with due regard to the description and any drawings (Art. 92). The claims determine the extent of the protection the European patent will confer if granted (Art. 69(1))."
                },
                "3.2": {
                    "content": "Interpretation of claims The search is not restricted by the literal wording of the claims but also not broadened to include everything that a person skilled in the art might envisage from considering the description and drawings. The search division may need to consider the contents of the description and/or drawings when performing the search in order to: (i) identify the technical problem and its solution (ii) define unclear terms not defined in the claims (iii) define clear terms given a definition different from their usual meaning (iv) ascertain whether there is a fallback position. The aim of the search is to identify prior art which is relevant to novelty and/or inventive step (see B-II, 2). The search covers what appear to be the invention's essential features and is adapted to take account of any changes in the (objective) technical problem solved by the invention that may later arise in view of the prior art found so far (see B-IV, 2.3 and 2.4 and G-VII, 5.2). When interpreting claims for the purpose of the search, the search division will also consider any prior art comprising technical features which are well-known equivalents of the technical features of the claimed invention and which may mean it lacks inventive step (see G-VII, Annex, 1.1(ii)).",
                    "subsections": {
                        "3.2.1": {
                            "content": "Claims with explicit references to the description or drawings Although explicit references in the claims to features elucidated in the description or in the drawings are only permissible where \"absolutely necessary\" (Rule 43(6) – see also B-III, 3.5 and F-IV, 4.17), claims containing such references are still searched if these features are unambiguously defined by specific parts of the description. However, where the reference does not clearly identify which subject- matter of the description and/or drawings is to be regarded as included in the claim, an invitation under Rule 63(1) is issued. In the special case of an \"omnibus claim\" (e.g. one reading: \"The invention substantially as herein described\"), no invitation under Rule 63(1) is issued, and the search report will subsequently be treated as complete. This means that this kind of subject-matter will be dealt with only during examination. The same procedure is followed regardless of whether or not the reference to the drawings and/or the description is allowable under Rule 43(6). In either case, the claim will have the same scope: if the reference is not allowable, the applicant will be asked to copy the definition of the technical feature from the description and/or drawings into the claim; if it is allowable, the claim will stay as it is. However, where the reference does not appear to be allowable under Rule 43(6), the search division will object to it in the search opinion (if applicable – see B-XI, 7)."
                        },
                        "3.2.2": {
                            "content": "Using the description and/or drawings to identify the technical problem Rule 42(1)(c) states that the description must (at least implicitly) mention the technical problem the invention is intended to solve (see also F-II, 4.5). This means the technical problem can be identified even if it is not immediately apparent from the claims. However, the technical problem may change in view of the prior art found (see G-VII, 5.3, H-V, 2.4 and T 39/93, OJ EPO 1997, 134; see also G-VII, 5.2, T 184/82, OJ EPO 1984, 261, and T 732/89)."
                        },
                        "3.2.3": {
                            "content": "Using the description and/or drawings to define unclear terms not defined in the claims Sometimes, the terms used to define claimed technical features are unclear and so the scope of the claims cannot be determined unambiguously. The search division then uses the description and/or drawings to interpret what these terms mean (see F-IV, 4.2). For example: Claim 1: Pneumatic tyre comprising a wide groove disposed in a tread portion, characterised in that the wide groove is provided on the groove bottom with at least one longitudinal rib extending in the longitudinal direction of the wide groove. Description: The term \"wide\", as used in the context of the present invention, means not less than 20mm wide. The term \"wide\" in claim 1 is unclear because it is a relative term with no well-defined meaning in the technical field, and so the scope of the claim is also unclear (F-IV, 4.6, Art. 84). However, the description unambiguously defines \"wide\" as meaning \"not less than 20mm wide\". The search division takes this definition into account during the search (and subsequently objects to the clarity of the term \"wide\" under Art. 84, second sentence, in the search opinion). The definition of \"wide\" in the description is also a fallback position (see B-III, 3.2.5)."
                        },
                        "3.2.4": {
                            "content": "Using the description and/or drawings to define clear terms given a definition different from their usual meaning The meaning given to a technical term in the description and/or the drawings sometimes differs from the one commonly accepted in the relevant technical field. The meaning given can make the term (and so the scope of the claim) broader (see Example 1) or narrower (see Example 2). Example 1 Claim 1: Halide salt of compound A \"Halide salt\" normally means fluoride, chloride, bromide or iodide salt. Description: In the context of the present invention the term halide salt means fluoride, chloride, bromide, iodide or tosylate salt. Here, the claim at first appears to be clear because it uses a technical term (\"halide salt\") that has a clear and well-established meaning in the relevant technical field. However, the description gives this term a broader meaning than its well-established definition (i.e. it also includes tosylate salt). Example 2 As in Example 1, except that the description defines \"halide salt\" as meaning fluoride, chloride or bromide salt. Here, the meaning of \"halide salt\" is narrower than its well-established definition (i.e. it does not cover iodide salt). In both cases, the search will take into account both the term's generally accepted definition in the relevant technical field and its definition in the application itself."
                        },
                        "3.2.5": {
                            "content": "Ascertaining whether there is a fallback position Claims sometimes contain an unclear and undefined term for which a clear preferred embodiment (i.e. a \"fallback position\"; see B-III, 3.2(iv)) is given only in the description and/or drawings (see B-III, 3.2.3). The search will then be based on the broadest technically sensible interpretation of the term. However, if the term's meaning is so unclear that a meaningful search cannot be carried out, it is justified to limit the scope of the search under Rule 63."
                        }
                    }
                },
                "3.3": {
                    "content": "Amended claims, missing parts (Rule 56) or erroneously filed application documents or parts (Rule 56a)",
                    "subsections": {
                        "3.3.1": {
                            "content": "General considerations Where a European application does not derive from an earlier international application, the applicant is not allowed to amend the claims before receiving the European search report (Rule 137(1)). This means that the search is carried out on the basis of the claims in the European application as originally filed or of any set of claims filed under Rule 57(c) or 58. Search and examination will be based on the filing date and the application documents established during the procedure under Rule 56 or 56a. These documents are considered the documents as originally filed within the meaning of Art. 123(2). If they contain missing parts of the description and/or missing drawings filed under Rule 56(3), the application including the missing parts will form the basis for the search. In cases where erroneously filed documents and correct documents are both part of the application as filed (i.e. in cases under Rule 56a(4) of corrections without a change in the filing date), the search will be performed as usual, and the procedures under Rule 63 or 64 applied where appropriate. If the EPO has already begun to draw up the search report when correct documents are filed, the applicant will be invited to pay a further search fee (Rule 56a(8)) (see A-II, 6.7). In addition, when the search division expects the application to be redated by the examining division later on in the proceedings (see C-III, 1), it checks whether the Receiving Section's assessment of the \"completely contained\" criterion was correct (see H-IV, 2.2.2). If the Receiving Section wrongly considered that the missing parts and/or elements or the correct parts and/or elements were completely contained in the priority document, the search will be widened to include documents which would be relevant if the application were to be redated (such documents can be cited as \"L\" documents in the European search report (see also B-XI, 2.1)). The same applies to Euro-PCT applications which contain missing parts of the description, drawings or claims and/or missing elements filed under Rule 20.6 PCT."
                        },
                        "3.3.2": {
                            "content": "Specific rules applicable to Euro-PCT applications Where a European application derives from an earlier international application, the applicant may have amended the international application in the international phase, either after receiving the international search report (Art. 19(1) PCT) or during international preliminary examination (Art. 34(2)(b) PCT). Under Rule 159(1)(b), the applicant can then choose whether to enter the European phase with these amended application documents (including claims) or with the ones originally filed. The EPO also gives them an opportunity to amend the application documents (including the claims) within a set time limit (Rule 161(2), see E-IX, 3). The application as amended is then taken as the basis for any supplementary European search to be carried out under Art. 153(7) (see B-II, 4.3 and B-XI, 2). See B-VIII, 6 for the procedure followed where the claims of an international application entering the European (regional) phase are amended in such a way that they contravene Art. 123(2)."
                        }
                    }
                },
                "3.4": {
                    "content": "Abandoned claims Claims in a European patent application that are deemed to have been abandoned because the fees for them were not paid must be excluded from the search. The claims which have actually been searched are specified in the search report. This applies both to searches on directly filed European patent applications and to supplementary European searches on Euro-PCT applications entering the European phase (see B-II, 4.3)."
                },
                "3.5": {
                    "content": "Anticipation of amendments to claims In principle, and in so far as possible and reasonable, the search covers all the subject-matter to which the claims are directed or to which they might reasonably be expected to be directed if they are amended (see, however, B-VII, 1.3 on cases of lack of unity and H-IV, 4 on the ambit of Rule 137(5)). Example Where an application relating to an electric circuit contains one or more claims directed only to the function and manner of operation, and the description and drawings include an example detailing a non-trivial transistor circuit, the search includes this circuit. However, it is not sufficient for the application as filed to contain one broadly worded independent claim covering several embodiments, and no dependent claims, for the applicant to be entitled to a search of all the features of those embodiments (see T 1679/10)."
                },
                "3.6": {
                    "content": "Broad claims The search division does not have to make any special effort to search unduly wide or speculative claims beyond the subject-matter that is sufficiently disclosed in the application (Art. 83) and supported by the description (Art. 84). Example 1 If the claims in an application that relates to an automatic telephone exchange and describes it in detail are directed to an automatic communication switching centre, the search is not widened to include automatic telegraph exchanges, data switching centres, etc. merely because the claims are broadly worded but only if it is probable that it will then produce a document on which a reasonable novelty or inventive-step objection could be based. Example 2 If a claim is directed to a process for manufacturing an \"impedance element\" but the description and drawings relate only to the manufacture of a resistor element, and do not indicate how other types of impedance element could be manufactured by the claimed process, widening the search to include, say, the manufacture of capacitors is normally not justified. Example 3 If the main claim relates to the chemical treatment of a substrate, but it appears from the description or all the examples that the problem to be solved depends solely on the nature of natural leather, the search is normally not widened to cover the fields of plastics, fabrics or glass. Example 4 If the description and drawings are directed to a lock with a safety cylinder but the claims refer to a device allowing the indexation of the angular position of a first element with respect to two other rotating elements, then the search is limited to locks. In exceptional cases where there is such a lack of disclosure or support that a meaningful search over the whole scope of the claims is impossible, it may make sense to follow the procedure under Rule 63 and issue either a partial search report or a declaration replacing the search report (see B-VIII, 3)."
                },
                "3.7": {
                    "content": "Independent and dependent claims The search carried out in the documentation to be consulted for the independent claim or claims must also cover all dependent claims (for cases not complying with Rule 43(2), see B-VIII, 4). Dependent claims are ones which are restricted by all the features of the claim or claims on which they depend. So, where the subject-matter of an independent claim is novel, that of its dependent claims will also be novel (see, however, F-VI, 2.4.3). When the patentability of the subject-matter of the independent claim is not in doubt after the search, there is no need to carry out a further search or cite documents for the subject-matter of the dependent claims as such (see, however, B-II, 4.2(iii) and B-XI, 1.2). Example 1 An application relating to cathode ray oscilloscope tubes has an independent claim directed to specific means along the edge of the front of the tube for illuminating the screen and a dependent claim directed to a specific connection between the front and the main part of the tube. When searching in the parts of the documentation consulted for the illumination means, the search division will also look for material relating to the connecting means, whether in combination with the illumination means or not. But, if its search in these parts of the documentation does not cast any doubt on the patentability of the illuminating means, it will not continue the search on the connecting means in other parts of the documentation which are likely to contain material relevant to or dealing specifically with these connections. Example 2 An application dealing with a pharmaceutical composition for treating nail infections has an independent claim relating to specific combinations of the active ingredients The patentability of this claim's subject-matter is not in doubt after the search, so there is no need to continue the search in relation to dependent claims dealing with the use of a specific volatile organic solvent as a carrier in the composition."
                },
                "3.8": {
                    "content": "Search on dependent claims However, where there is doubt about whether the independent claim's subject-matter is patentable, the search may have to be continued in other parts of the documentation, e.g. in one or more additional classification units, in order to assess whether the subject-matter of the dependent claim as such is novel and involves an inventive step. No special search is carried out for features that seem prima facie trivial or are generally known in the art. However, a handbook or other document showing that a feature is generally known can be cited if it can be found quickly (see G-VII, 6(iii)). A dependent claim that adds another feature (instead of providing more detail on something already in the independent claim) has to be considered in combination with the features in the independent claim and is dealt with accordingly (see F-IV, 3.4)."
                },
                "3.9": {
                    "content": "Combination of elements in a claim For claims characterised by a combination of elements (e.g. A, B and C), the search is aimed at finding prior art relating to the combination. However, when searching the parts of the documentation selected for this, the search division should also search them for sub-combinations, including the elements individually (e.g. A and B, A and C, B and C, and also A, B and C separately). Other parts of the documentation are searched either for sub-combinations or for individual elements of the combination only if this is still necessary for establishing the novelty of the element in order to assess whether the combination involves an inventive step."
                },
                "3.10": {
                    "content": "Different categories If the application contains different categories of claims, the search must cover all of them (for cases not complying with Rule 43(2), see B-VIII, 4). However, if a product claim clearly seems to be both new and non-obvious, the search division will not carry out any special search on claims for a process which inevitably results in the manufacture of that product or for use of the product (see F-IV, 3.8 and G-VII, 13). When the application contains only claims of one category, it may make sense to include other categories in the search. For example, it can generally be assumed, i.e. unless the application contains contrary information, that, in a claim directed to a chemical process, the starting products form part of the state of the art and need not be searched. The intermediate products will only be searched if they are the subject-matter of one or more claims. The final products on the other hand will always have to be searched unless they are clearly known."
                },
                "3.11": {
                    "content": "Subject-matter excluded from search The search division can decide to exclude certain subject-matter from its search. It may do this where the subject-matter falls under one of the exceptions to patentability laid down in the EPC or cannot be considered susceptible to industrial application (see B-VIII, 1 and 2). It may also do this where the application falls so short of other EPC requirements that it is impossible to carry out a meaningful search on some or all of the claims or part of a claim (see B-VIII, 3) or where the application does not comply with Rule 43(2) (see B-VIII, 4)."
                },
                "3.12": {
                    "content": "Lack of unity Where the claims do not relate to a single invention only ‒ or to a group of inventions that are so closely linked that they form a single general inventive concept ‒ the search will normally be restricted to the invention or linked group of inventions first mentioned in the claims (see B-VII and F-V, 3.4). If the search is restricted this way, the applicant will be informed in a communication accompanying the partial search report (see B-VII, 1.2)."
                },
                "3.13": {
                    "content": "Technological background It makes sense to widen the scope of the search to include the following \"technological background\" to the invention: - the preamble to the first claim, i.e. the part coming before the expression \"characterised by\" or \"characterised in that\" - any state of the art which the introductory part of the description says is known but which is not identified by specific citations - the general technological background to the invention (often called \"general state of the art\")."
                }
            }
        }
    },
    "Chapter IV – Search procedure and strategy": {
        "1. ": {
            "title": "Procedure before searching Starting the workflow for a European search report, a European search opinion or a clarification request under Rule 62a and/or 63(1) triggers a pre-search algorithm that generates a list of documents to be inspected by the search division. This creates a marker in the file showing that the search division has started the search. The date when the search started will be relevant if the search fee has to be refunded because the application is withdrawn, refused or deemed to be withdrawn (see A-X, 10.2.1).",
            "subsections": {
                "1.1": {
                    "content": "Analysis of the application The search division first of all studies the application to determine the subject-matter of the claimed invention (see B-III, 3) and critically analyses the claims in the light of the description and drawings to establish whether they are potentially open to any objection. In particular, it studies the content of the claims, description and drawings in enough detail to identify the problem the invention is intended to solve, the inventive concept leading to its solution, the features essential to the solution, as found in the claims, and the results and effects obtained (see, however, B-III, 3.5). If, according to the description, technical features not included in the claims are essential to solving the stated problem, these features are included in the search (see F-IV, 4.3(ii) and T 32/82)."
                },
                "1.2": {
                    "content": "Formal deficiencies If the search division notices any formal shortcomings which have been overlooked by the Receiving Section, it issues an internal communication bringing them to the attention of the Receiving Section (or of the examining division, where it has requested an additional search), which then takes appropriate action. However, the search division does not redo the Receiving Section's work and does not make any time-consuming enquiries into the formalities. Deficiencies it might notice in an application include: (i) physical deficiencies (see A-III, 3.2), including: (a) no electronic sequence listing (Rule 30(1), OJ EPO 2011, 372, OJ EPO 2013, 542) (b) incorrect sequence and/or positioning of page numbering and/or failure to use Arabic numerals to number pages (Art. 2(5) of the decision of the President of the EPO dated 25 November 2022, OJ EPO 2022, A113) (c) drawings in the description and/or claims (Art. 2(8) of the decision of the President of the EPO dated 25 November 2022, OJ EPO 2022, A113) (d) erasures and/or alterations in the application documents that cast doubt on the authenticity of their content and/or are not conducive to good reproduction (Art. 2(11) of the decision of the President of the EPO dated 25 November 2022, OJ EPO 2022, A113). (ii) prohibited matter, i.e. content which: (a) is contrary to \"ordre public\" (see A-III, 8.1, F-II, 7.2 and G-II, 4.1, 4.1.1 and 4.1.2) or (b) amounts to a disparaging statement (see A-III, 8.2) (as opposed to permissible \"fair comment\" – see F-II, 7.3). (iii) non-compliance with the provisions on depositing biological material (see A-IV, 4), in particular any failure to properly identify the depositary institution and the accession number it assigned to the biological material (Rule 31(1)(c); see G 2/93 and A-IV, 4.2). (iv) a failure to correctly identify the application as a divisional application within the meaning of Art. 76(1) (Rule 41(2)(e); see A-IV, 1.3.2). (v) text in two different EPO official languages (Art. 14)."
                },
                "1.3": {
                    "content": "Documents cited or supplied by the applicant Under the utilisation scheme (see Rule 141(1) and B-XI, 9, as well as OJ EPO 2010, 410), applicants whose application claims a priority are expected to file a copy of the results of any search carried out by the office of first filing (for more details, see A-III, 6.12). If the prior-art information found by the office of first filing is made available before the search has been completed, the search division will check the citations and assess whether they are relevant for examination and for defining the search strategy. The search division will also look at documents cited in the application if they are referred to as the starting point of the invention, as showing the state of the art or as providing alternative solutions to the problem concerned or if the application's content cannot be properly understood without them. But it can disregard them if they clearly relate only to details not directly relevant to the claimed invention. In the exceptional case that the application cites a document that has not been published or is otherwise unavailable to the search division, and it appears to be so essential to properly understanding the claimed invention that a meaningful search on at least part of it would not be possible without knowing what is in it, the search division will send an invitation under Rule 63 (see B-VIII, 3) that specifies: (i) which document is needed (ii) why it is needed (iii) what will happen if it is not submitted in time (see below). The applicant can respond by: (a) either submitting a copy of the document (b) or arguing why the document is not needed for a meaningful search and/or indicating a part of the application whose subject-matter can be searched without knowing what is in the document. If the applicant does not submit a copy of the document ‒ or convince the search division that it is not needed for a meaningful search ‒ within the time limit under Rule 63(1), the search division will issue a partial search report or, where applicable, a declaration replacing the search report under Rule 63 (see B-VIII, 3.2.1) on the following grounds: (1) because the document was not available, the claimed invention had to be regarded as insufficiently disclosed within the meaning of Art. 83 and (2) the invention was so insufficiently disclosed that it was impossible to carry out a meaningful search on at least part of it (see B-VIII, 3). If the applicant submits the document after the search report and the search opinion (if applicable ‒ see B-XI, 7) have been drawn up, the examining division may later carry out an additional search on the originally excluded subject-matter in view of the correction of the deficiency which led to the incomplete search (see C-IV, 7.3). However, applicants should bear in mind that information in documents referred to in their application can only be taken into account for sufficiency of disclosure under Art. 83 in the circumstances described in F-III, 8."
                }
            }
        },
        "2. ": {
            "title": "Search strategy",
            "subsections": {
                "2.1": {
                    "content": "Subject-matter of the search; restrictions Once the search division has determined the subject-matter of the invention as outlined in B-IV, 1.1, its first step is to define its approach to the search ‒ in terms of what concepts, classes, keywords, etc. it plans to use ‒ as precisely as possible. Often, one or more of the claims themselves can be used for this, but they may have to be generalised in order to cover all aspects and embodiments of the invention. At this point, the search division should also think about whether there is any non-patentable subject-matter (see B-VIII, 1 and 2) or any lack of unity of invention (see B-VII, 1.1). It may also have to restrict the search because claims have to be regarded as abandoned (see B-III, 3.4), because the application falls so short of the EPC requirements that a meaningful search is impossible (see B-VIII, 3) or because the application does not comply with Rule 43(2) (see the procedure described in B-VIII, 4). If the search is restricted, this must be mentioned in the search report or the declaration replacing it under Rule 63. The declaration must indicate the reasons for any restrictions under Rule 63 (see B-X, 8(iii)). The declaration or the partial search report is then treated as the search report for the purposes of the subsequent proceedings."
                },
                "2.2": {
                    "content": "Devising a search strategy The search division next starts the search process by devising a search strategy, i.e. a plan consisting of a series of search statements reflecting the subject-matter to be searched and determining the parts of the documentation to be consulted. A search strategy will initially be made up of one or more combinations of the basic search means mentioned in B-III, 2.2. But the search process is interactive and iterative in the sense that the search division will revise its initial search statements depending on how useful it considers the information it has found so far (see B-III, 1.1 and B-IV, 2.4 and 2.6). When using classification groups, the search division selects not only ones in all directly relevant fields but also ones in neighbouring fields. If appropriate, the search division will also consult other classification (e.g. FI) or indexing (e.g. F-terms) schemes. It can also consult colleagues working in a similar technical field or in fields possibly related to the content of the application (see B-I, 2.1). If in doubt about the right fields to search, the search division can ask a classification expert. There are usually various possible search strategies, and the search division, drawing on its experience and knowledge of the available search tools, will use its judgement to select the one most appropriate in the case in hand. The search division prioritises search strategies leading to those parts of the documentation where relevant documents are most likely to be found. It will usually give the main technical field of the application priority, first of all using the basic search means (see B-III, 2.2) most relevant to the specific examples and preferred embodiments of the claimed invention. It will always consider the results already obtained in deciding whether it needs to widen the search to include other, less relevant parts of the documentation."
                },
                "2.3": {
                    "content": "Carrying out the search; types of documents The search division then carries out the search, focusing on documents relevant for novelty and inventive step. It also notes any documents that may be important for other reasons, such as: (i) conflicting documents (see B-VI, 4), i.e.: (a) published European patent applications under Art. 54(3) (see G-IV, 5.1 and 5.1.1) (b) published international applications under Art. 54(3) and Art. 153(3) and (5) (see G-IV, 5.2) (c) published national applications of EPC contracting states under Art. 139(2) (see G-IV, 6 and H-III, 4.4) (d) any document published during the priority interval of the application which may become relevant under Art. 54(2) if the priority date turns out to be invalid. If the applications listed above were published within the searched application's priority interval, they will be cited in the search report as \"P\" documents (see B-X, 9.2.4); if they were published on or after the European or international filing date, they will be cited as \"E\" documents (see B-X, 9.2.6). (ii) documents that cast doubt on the validity of any priority claimed (see B-VI, 3 and F-VI, 1.4.1), which are cited in the search report as \"L\" documents (see B-X, 9.2.8(a)). (iii) documents that help to understand the claimed invention better or to understand it correctly, which are cited in the search report as \"T\" documents (see B-X, 9.2.5). (iv) documents illustrating the technological background, which are cited in the search report as \"A\" documents (see B-X, 9.2.2). (v) European patent applications that have the same filing or priority date as the searched application, were filed by the same applicant and relate to the same invention and that are therefore relevant to the issue of double patenting (see G-IV, 5.4), which are cited in the search report as \"L\" documents (see B-X, 9.2.8 (c)). (vi) documents indicating or establishing the publication date of a document found on the internet (see G-IV, 7.5), which are cited in the search report as \"L\" documents (see B-X, 9.2.8 (b)). (vii) documents found on the internet which do not have any publication date but which the search division nonetheless wants to cite to inform the applicant or third parties (see G-IV, 7.5.4), which are also cited in the search report as \"L\" documents (see B-X, 9.2.8). However, the search division does not spend a lot of time searching for these documents or considering any related matters unless it has a special reason for doing so in a particular case (see B-VI, 5.3 and B-XI, 4)."
                },
                "2.4": {
                    "content": "Redefining the searched subject-matter Throughout its search, the search division continuously evaluates the results obtained so far and, based on the outcome, uses its judgement to decide whether to redefine the searched subject-matter. For example, the results may show that it needs to change the classification units selected for search or the order of searching them. They may also show that it needs to approach the search documentation in a different way, e.g. by consulting: (i) documents cited in relevant documents found during the search, for example cited in the description or search report of a patent document, or (ii) documents citing a relevant document found during the search or that it needs to turn to documentation not available to it in-house (see B-IX). When searching external document collections for material relating to unpublished subject-matter using non-secure connections, e.g. on the internet, the search division must choose its search strategies extremely carefully to ensure it does not unwittingly reveal confidential material – i.e. any part of the unpublished patent application (see B-III, 2.4)."
                },
                "2.5": {
                    "content": "Closest prior art and its effects on the search Sometimes the search division does not find any documents published before the earliest priority date which prejudice the novelty or the inventive step of the claimed invention. Wherever possible, it will then cite in the search report at least that prior art found which discloses a solution to the same subjective problem as the one dealt with by the claimed invention and whose known solution comes technically closest to the claimed solution. This prior art is cited as an \"A\" document in the search report (see B-X, 9.2.2). If it cannot find such a document, the search division will instead cite as the closest prior art a document which discloses a solution to a problem closely related to the one dealt with by the claimed invention and whose solution is technically the most similar to the one in the searched application. The search division proceeds in the same way where it finds documents which are accidentally prejudicial to the novelty of the claimed invention (cited as \"X\" documents) but which do not affect inventive step once the application has been amended appropriately, and does not retrieve any other documents prejudicing inventive step. Where a European application is derived from an international application and undergoes a supplementary European search after entering the European phase (Art. 153(7) – see B-II, 4.3), the search division sometimes does not uncover any relevant prior-art documents other than the ones already cited by the ISA in its international search report. When this happens, it is permissible for its supplementary European search report not to cite any additional relevant documents (see B-X, 9.1.4)."
                },
                "2.6": {
                    "content": "End of search Efficiency dictates that the search division use its judgement to end its search once the probability of discovering any more relevant prior art becomes very low in comparison to the work involved. It can also stop its search once it has found documents which clearly demonstrate that the entire subject-matter of the claimed invention and its embodiments in the description lack novelty, except for features which are trivial or common general knowledge in the relevant field and whose application would not involve any inventive step. As to the search for conflicting applications, see B-VI, 4."
                }
            }
        },
        "3. ": {
            "title": "Procedure after searching",
            "subsections": {
                "3.1": {
                    "content": "Drawing up the search report Once it has ended its search, the search division selects the documents to be cited in the search report from among those it has found. These always include the most relevant ones (which will be specially labelled in the report, see B-X, 9.2.1). Less relevant documents are only cited when they concern aspects or details of the claimed invention not found in the documents already selected for citation. If there is some doubt about novelty or inventive step, the search division will cite rather more readily to enable the examining division to consider the matter more fully (see B-III, 1.1). The search division does not cite more documents than necessary in the search report and so, if there are several equally relevant documents, it normally cites only one of them. The search report is anyway accompanied by an automatically generated annex listing the available patent documents belonging to the same patent family. When selecting which of these documents to cite, the search division should think about what language is the most convenient, and should preferably cite (or at least note) documents in the same language as the application (see B-X, 9.1.2)."
                },
                "3.2": {
                    "content": "Documents discovered after completion of the search The search division occasionally discovers other relevant documents after completing the search report (e.g. in a later search for a related application). These documents can be used in examination (see C-IV, 7.5)."
                },
                "3.3": {
                    "content": "Errors in the search report If an editorial error is found in a search report before it has been published, a new search report will be drawn up to replace it. Where the search report has already been sent to the applicant in accordance with Rule 65 but has not yet been published, the applicant is notified of the error immediately. If a serious error is discovered after publication, a corrigendum is published in the European Patent Bulletin, and the applicant and the examining division are informed accordingly. If a different document from the one cited has been made available to the applicant by mistake, the right one is made available."
                }
            }
        }
    },
    "Chapter V – Preclassification, IPC and CPC classification of European patent applications": {
        "1. ": {
            "title": "Definitions",
            "subsections": {},
            "content": " \"Preclassification\" is a first stage of classification using appropriate classification symbols to broadly identify the subject-matter of the claimed invention (or the invention first claimed if there is more than one) for the purposes of internal application (file) routing and allocation. \"IPC classification\" involves assigning the appropriate classification symbols under the International Patent Classification (IPC) scheme published by WIPO. See the WIPO website for the IPC edition currently in force, and the \"Guide to the IPC\", which explains the principles and rules of IPC classification. \"CPC classification\" involves assigning the appropriate classification symbols under the Cooperative Patent Classification (CPC) scheme published by the EPO and the USPTO. See the CPC website for the CPC edition currently in force, and the \"Guide to the CPC\", which complements the \"Guide to the IPC\" in that it deals with the differences between the CPC and the IPC."
        },
        "2. ": {
            "title": "Preclassification (for file routing and allocation)",
            "subsections": {
                "2.1": {
                    "content": "Incorrect preclassification If the search division finds that an application has been incorrectly preclassified and so wrongly allocated to it, it will reallocate it to the right search division by making the appropriate changes on the electronic file. This is normally agreed beforehand with the other search division, but there is sometimes disagreement or uncertainty over classification boundaries, or the search division to which the application was initially allocated may be unsure how to preclassify it correctly. In such cases, it does not spend time trying to resolve the matter but instead forwards the file to a classification specialist."
                }
            },
            "content": " Applications have to be preclassified to ensure they are allocated to the right search division. The preclassification is assigned using IPC and/or CPC symbols and entered on the electronic file. Based on a cursory read of the application, this initial level of classification is kept as general as possible but should still be specific enough to avoid the need for any further preclassification of the file before it can be properly allocated. In the rare case that this is necessary, arrangements should be made for the file to be redistributed as quickly as possible."
        },
        "3. ": {
            "title": "IPC classification of the application The IPC classification of a patent application is assigned by the search division.",
            "subsections": {
                "3.1": {
                    "content": "IPC classification of late-published search reports Where the search report is published separately from the application because it was not available in time and the search division finds it necessary to amend the assigned IPC classification for the reasons given in B-V, 3, last paragraph, it will specify the new IPC classification on the search report and point out that it replaces the one on the published application (which then becomes merely the \"classification for publication\"). It will only change the IPC classification if it is quite certain that it is necessary. Where a European patent application is classified and published without the European search report (A2 publication), the European search report is drawn up and published separately at a later stage (A3 publication). It can happen that a new edition of the IPC is published in the meantime. The search division will then use the IPC edition which was in force when the application was published for the search report."
                },
                "3.2": {
                    "content": "IPC classification where the scope of the invention is unclear (e.g. a partial search) Where the scope of the invention is unclear, the IPC classification has to be based on what appears to be the invention in so far as this can be understood. It will then have to be amended if the search clears up the obscure points (see B-V, 3, last paragraph)."
                },
                "3.3": {
                    "content": "IPC classification in cases of lack of unity of invention If the search division finds that the application lacks unity of invention, each of the different inventions claimed must be classified as set out in B-V, 3 to"
                },
                "3.4": {
                    "content": "Verification of the IPC classification As a general rule, applications are not systematically scrutinised after leaving the search division to verify whether it assigned the correct IPC classification. However, the EPO may carry out any spot-checks it considers necessary to ensure that the IPC is applied correctly and uniformly. It is for line managers to decide, based on the search division members' level of experience, whether such checks are needed and, if so, to arrange for them to be carried out before the applications leave their units."
                }
            },
            "content": " The IPC classification identifies all features relevant to the technical subject-matter of the claimed invention (or of each of the claimed inventions if there is more than one) as precisely and comprehensively as possible under the IPC scheme. The IPC classification consists of \"invention information\" symbols and \"additional information\" symbols (the latter include IPC indexing codes) which are assigned according to the IPC rules set out in the \"Guide to the IPC\". If more than one symbol has to be assigned for the invention itself, the symbol which, in the search division's opinion, best identifies it ‒ or, if that is not straightforward, the one identifying it for which most information is given ‒ is indicated first. The IPC classification should preferably be assigned after the search division has studied the content of the application to decide how to carry out the search. However, if the application is due to be published before the search report is drawn up, it will have to study it in enough detail to decide on the IPC classification at this earlier stage (see B-X, 5). The IPC classification relates to what is disclosed in the published application, i.e. the application as filed, and so is determined without taking into consideration what the application could potentially contain if it is later amended. If, however, the search division's understanding of the invention, or of the content of the application as filed, changes significantly during the search (e.g. as a result of prior art found or because obscure points have been clarified) and the preparations for publication have not yet been completed, it will amend the classification accordingly."
        },
        "4. ": {
            "title": "CPC classification of the application Besides assigning an IPC classification, the search division also classifies a patent application under the CPC. In practice, the CPC classification is assigned first, and the relevant IPC symbols are then generated from the CPC ones by one-to-one concordance (see the CPC to IPC Concordance List, published on the CPC website).",
            "subsections": {},
            "content": " The CPC classification should be as precise and comprehensive as possible under this classification scheme. The CPC comprises \"invention information\" symbols and \"additional information\" symbols. Additional information symbols include CPC indexing codes. If more than one CPC classification symbol has to be assigned for the invention itself, the symbol which, in the search division's opinion, best identifies it ‒ or, if that is not straightforward, the one identifying it for which most information is given ‒ is indicated first. Like the IPC classification, the CPC classification should preferably be assigned after the search division has studied the content of the application to decide how to carry out the search. Again like the IPC classification, the CPC classification relates to what is disclosed in the published application, i.e. the application as filed, and so is determined without taking into consideration what the application could potentially contain if it is later amended. However, if the search division's understanding of the invention, or of the content of the application as filed, changes significantly during the search, it will change the CPC classification accordingly, using the appropriate classification tools. Unlike a change to the IPC classification (see B-V, 3 above), this change can be made even after the preparations for publication have been completed. If the scope of the invention is unclear (e.g. a partial search is necessary) or if there is a lack of unity of invention, the principles described in B-V, 3.2 and 3.3 for the IPC classification apply equally to the CPC classification."
        }
    },
    "Chapter VI – The state of the art at the search stage": {
        "1. ": {
            "title": "General General considerations applying to the state of the art and patentability, especially in the context of assessing novelty and inventive step, are set out in G-IV.",
            "subsections": {}
        },
        "2. ": {
            "title": "Oral disclosure, use, exhibition, etc. as state of the art Under Art. 54 EPC, a public oral description, use, exhibition, etc. is also considered to be prior art. The search division cites such an oral disclosure as prior art only if it is convinced that the facts can be proved, for example if a document confirming the oral disclosure is available. Written confirmation can be accepted as proof even if it was published after the filing date of the searched application as it is the date of the oral disclosure which is decisive under Art. 54(2). The search division then gives the date of the non-written disclosure as the relevant date (see G-VI, 3) but must also indicate the date of the subsequent written disclosure.",
            "subsections": {},
            "content": " However, such instances of oral disclosure, prior public use, disclosure by sale, etc. are more usually brought up by opponents in opposition proceedings (see G-IV, 7.1 to 7.4)."
        },
        "3. ": {
            "title": "Priority If the claimed priority dates cannot be verified at the search stage and it is therefore uncertain whether they are valid, the search for conflicting applications will be widened to cover all published applications with an earliest claimed priority date up to the searched application's filing date (not its claimed priority date or dates) (see B-IV, 2.3 and B-XI, 4).",
            "subsections": {}
        },
        "4. ": {
            "title": "Conflicting applications",
            "subsections": {
                "4.1": {
                    "content": "Potentially conflicting European and international applications Where the search is carried out less than 18 months after the application's European or international filing date (i.e. its filing date under Art. 80 and not its claimed priority date or dates), it will generally not have been possible to search for all potentially conflicting European and international applications, and so the examining division will have to complete this search at the examination stage (see C-IV, 7.1). However, if the search division does find any potentially conflicting published documents, it will cite them in the search report. Patent documents, regardless of their state or region of origin, which have a filing date or valid priority date before the filing date of the searched application (not its priority date) but were published on or after that filing date and which contain novelty-destroying subject-matter for at least one independent claim of the application are referred to as \"E\" documents (see B-X, 9.2.6). \"E\" documents cited in a European search report can be other European or international (WO) patent applications with an earlier priority date (Art. 54(3)) which are relevant because they anticipate the novelty of the subject-matter claimed in the searched application. An \"E\" document is novelty-destroying prior art under Art. 54(3) no matter where it discloses the subject-matter in question, i.e. whether it is in the claims, description or drawings.",
                    "subsections": {
                        "4.1.1": {
                            "content": "Published European patent applications as \"E\" documents (a) European patent applications filed between 1 July 1997 and 12 December 2007 were published with all EPC contracting states automatically designated (OJ EPO 1997, 160) because the designation fees were not payable until after publication (Art. 79(2) EPC 1973). However, the automatic designations made on publication were retroactively invalidated under Rule 23a EPC 1973 for the purposes of Art. 54(3) and (4) EPC 1973 if the relevant designation fees were not then paid on time. This means that, when a European patent application is found which is potentially relevant as an \"E\" document because it contains novelty-destroying subject-matter and claims earlier priority rights, and it was filed after the rule on the designation of states changed (i.e. as from 1 July 1997) but before the entry into force of EPC 2000, it is not immediately apparent from the published document which contracting states were validly designated. Nevertheless, such an application is always cited as an \"E\" document on the assumption that it has validly designated states in common with the searched application. (b) Any European patent application filed on or after 13 December 2007 which has an earlier filing date than the searched application and was published on or after that application's filing date is potentially state of the art for the purposes of Art. 54(3), regardless of whether the same states are designated."
                        },
                        "4.1.2": {
                            "content": "Published international applications (WO) as \"E\" documents (a) According to Art. 158(1) EPC 1973, a conflicting PCT application will constitute prior art within the meaning of Art. 54(3) and (4) EPC 1973 only if before 13 December 2007: - it designates the EPO, - where necessary, the applicant supplied the EPO with a translation into an official EPO language and - the applicant paid the EPO's national basic fee (the same as the filing fee) under Rule 107(1)(c) EPC 1973 and the EPO's designation fees under Rule 107(1)(d) EPC 1973. (b) According to Rule 165, a conflicting PCT application will constitute prior art within the meaning of Art. 54(3) only if on or after 13 December 2007 (see G-IV, 5.2): - it designates the EPO, - where necessary, the applicant has supplied the EPO with a translation into an official EPO language required under Art. 153(4) and Rule 159(1)(a) and - the applicant has paid the filing fee under Rule 159(1)(c). Even if it is not possible to verify any of the above requirements based on the published international (WO) application (in particular because the 31-month time limit for meeting them under Art. 22 PCT and Art. 39 PCT has not yet expired for the international application at the time of the search), the application should still be treated as potentially relevant under Art. 54(3) and so be cited as an \"E\" document in the search report (see also B-X, 9.2.6)."
                        }
                    }
                },
                "4.2": {
                    "content": "National prior rights National applications may have been filed in one or more of the contracting states designated in the European patent application before its filing or priority date and then published as national applications or patents on or after that date. Such applications do not prevent granting a European patent, but are a potential ground for revocation in the state or states concerned, and so they are important for the applicant (see H-III, 4.4). If any are found during the search, they will be mentioned in the search report for information (see B-X, 9.2.6)."
                }
            }
        },
        "5. ": {
            "title": "Relevant date for documents cited in the search report; filing and priority date",
            "subsections": {
                "5.1": {
                    "content": "Verification of claimed priority dates Where the validity of a priority claim cannot be verified at the search stage (see B-XI, 4), the filing date of the European patent application accorded by the Receiving Section must be taken as the relevant date for the search. (However, see B-VI, 3 on the relevant date for the search for conflicting applications.)"
                },
                "5.2": {
                    "content": "Intermediate documents The search division takes documents published between the priority date and the filing date of the searched application into account and labels them as such in the search report (see B-X, 9.2.4). For identifying what documents can be considered when an application has more than one priority date, the earliest date applies. When selecting which documents to cite in the search report, the search division refers to these dates and preferably chooses a document published before the priority date. For example, if there are two equally relevant documents, one published before the priority date and the other after that date but before the filing date, the search division will choose the former (see B-IV, 3.1, second paragraph)."
                },
                "5.3": {
                    "content": "Doubts about the validity of the priority claim; widening of the search The examining division is responsible for checking whether and to what extent the priority claim is justified. However, if its search uncovers intermediate state of the art (see B-VI, 5.2) or potential state of the art under Art. 54(3), the search division will, if possible, check the validity of the priority claim (see B-XI, 4, F-VI, 1.2 to F-VI, 1.5 and F-VI, 2). Similarly, if it finds a document showing that a priority claim might not be justified (e.g. an earlier application or patent belonging to the same applicant and suggesting that the application from which priority is claimed may not be the first application for the invention concerned), it will cite this document in the search report (see B-X, 9.2.8). However, it will not normally carry out any special search for such documents and will do so only if it has a particular reason, e.g. when the priority application is a \"continuation-in-part\" of an earlier application from which no priority is claimed (see B-IV, 2.3 and F-VI, 2.4.4). Sometimes the fact that the applicant's country of residence is different from the priority application's country of filing can also be an indication that it is not a first filing and so justify widening the search to some extent. If the search is widened this way, it will cover: (i) published patent documents filed earlier than the claimed priority date Example 1 (assuming that the applicant is the same for all applications) Date Application Subject-matter 01.03.98 GB1 filed A 30.05.98 GB2 filed A 30.05.99 EP1 filed (claiming priority of GB2) A 10.09.99 GB1 published A During the search for EP1, the search division found published application GB1. GB1 was filed earlier than GB2 and so may prejudice the priority claim of EP1. The search division therefore cites published GB1 in the search report as an \"L\" document (see B-X, 9.2.8(a)). (ii) published patent documents which claim priority from an application filed before the searched application's priority date Example 2 (assuming that the applicant is the same for all applications) Date Application Subject-matter 01.03.98 GB1 filed A 30.05.98 GB2 filed A 01.03.99 US1 filed A (claiming priority of GB1) 30.05.99 EP1 filed (claiming priority of GB2) A 15.04.00 US1 published A The publication US1 was found during the search on EP1. GB1 was filed earlier than GB2 and so may prejudice the priority of EP1. The search division therefore cites US1, which claims priority from GB1, in the search report as an \"L\" document (see B-X, 9.2.8(a))."
                },
                "5.4": {
                    "content": "Documents published after the filing date The search normally does not cover documents published after the filing date of the application accorded by the Receiving Section. However, documents published after the filing date can sometimes be relevant, for example written confirmation of an oral disclosure (see B-VI, 2), a later document setting out the principle or theory behind the invention and so helping to understand it better or a later document showing that the reasoning or the facts behind the invention are incorrect (see B-X, 9.2.5). The search is not specially widened to include documents of this kind, but the search division may choose to cite any it knows of in the search report. If priority is validly claimed (see B-VI, 5.1), the search also does not normally cover documents published after the earliest validly claimed priority date as that date counts under Art. 89 as the application's filing date. However, the search may have to be widened this way to some extent for specific purposes (see B-VI, 3, B-VI, 4 and B-VI, 5.3)."
                },
                "5.5": {
                    "content": "Non-prejudicial disclosures Disclosures of the invention are disregarded if they happened less than six months before the European patent application was filed (see G 3/98 and G 2/99) and if they were due either to an evident abuse in relation to the applicant or the legal predecessor or due to display at an official, or officially recognised, international exhibition. Nevertheless, the search division does cite in the search report any documents it has reason to believe fall within one of the categories mentioned in B-X, 9.2.8. For these documents too, the relevant date for the search will be the filing date of the application (see B-VI, 5.1 and B-XI, 4). Since abuse will generally only be asserted after the search report and search opinion (if applicable ‒ see B-XI, 7) have been sent, and disclosure at an exhibition involves the question whether the displayed invention and the claimed invention are identical, both matters will be investigated by the examining division."
                },
                "5.6": {
                    "content": "Doubts about the state of the art It is the examining division, not the search division, that ultimately decides on novelty (see B-III, 1.1), and so the search division does not disregard highly relevant documents because it has doubts about, for instance, when exactly they were published or made publicly available (e.g. standards or related preparatory documents, see G-IV, 7.6) or, where they refer to an oral disclosure, exhibition, etc., what exactly was said or displayed. It tries to remove any such doubts but always cites the documents in the search report anyway, while continuing its search as though they had not been found. It can also cite additional documents providing evidence on the matters in doubt (see B-X, 9.2.8). It will explain any such matters in detail in the search opinion. Any date of publication indicated in a document is accepted as correct unless there is good reason to challenge it, e.g. where the search division can show it was published earlier or where the applicant can show in examination proceedings that it was published later. If the indicated date of publication is not precise enough (e.g. because only a month or year is given) to establish whether it was published before the relevant date for the search, the search division will try to determine the exact date or at least narrow it down with enough precision to establish this. A date of receipt at the EPO stamped on the document or a reference in another document, which must then be cited (see B-X, 9.2.8), can help with this. Whether a document was publicly available may be investigated when the search opinion is drawn up and during substantive examination (see C-IV, 1). Where, despite the search division's attempts, the date is still not precise enough for it to know whether or not the document was published before or after the priority or filing date, it will cite it as though it had been published on the earliest possible date. For instance, if only the month and year of publication are known, the search division will cite it as having been published on the first day of that month."
                }
            }
        },
        "6. ": {
            "title": "Contents of prior-art disclosures",
            "subsections": {
                "6.1": {
                    "content": "General remark As a general rule, the search division cites only documents which are available in the search documentation or which it can access in some other way."
                },
                "6.2": {
                    "content": "Citation of documents corresponding to documents not available or not published in one of the EPO's official languages In certain circumstances, the search division can cite a document without having verified its content if it has good reason to assume that it is identical in content to another document which it has inspected. Both documents are then mentioned in the search report as described at the end of B-X, 9.1.2. For example, where a document published in a non-EPO language before the filing date has been selected for citation, the search division may instead have inspected a corresponding document in an official EPO language (e.g. another member of the same patent family or a translation of an article) and possibly published after the filing date. Unless the contrary is explicitly stated, it can also be assumed that an abstract's contents are included in the original document, just as it is normally assumed that what is said in a report of an oral presentation matches what was presented. Before citing a document written in a language it is not familiar with, the search division must make sure it is relevant (e.g. by using a machine translation, a translation by a colleague, a corresponding document or an abstract in a familiar language, by referring to a drawing or chemical formula in the document to be cited or by consulting database indexes relating to that document's technical content (see B-X, 9.1.3))."
                },
                "6.3": {
                    "content": "Conflict between abstract and source document Where there is a problem with an abstract, either because it appears to conflict with its source document or because it conflicts with other abstracts of the same source document, the search division will proceed as follows: (i) it will cite the source document if it is in a language it can readily understand (especially one of an EPC contracting state) and either directly available to it or easy to obtain. (ii) it will cite the abstract if the source document is in a language it cannot readily understand (e.g. Russian, Japanese, Korean or Chinese) and/or is difficult to obtain. If more than one abstract is available, it will cite the one most relevant to the claimed invention even if it conflicts with the other abstracts or the source document. The source document will be mentioned in the search report as the \"&\" document of the cited abstract. Where it is available but is in a language the search division cannot readily understand (e.g. Japanese), both it and the abstract will be made available to the applicant and included in the file (see B-X, 9.1.2). The search division must explain in the search opinion why it thinks there is a conflict. Where an abstract conflicts with the source document to such an extent that it is incorrect, it is not treated as prior art, and the source document is considered to be the state of the art instead (T 77/87). However, for the purposes of the search report and opinion, an abstract is assumed to truly reflect the source document's content unless the discrepancy between the two is obvious. Since the abstract, the source document and a machine translation of the source document are all made available (see B-X, 9.1.3 and 12), the applicant can compare their disclosures and form an opinion on whether the abstract is technically accurate. They will still have an opportunity to refute the above assumption at the examination stage (e.g. by providing a translation of the source document)."
                },
                "6.4": {
                    "content": "Insufficient prior-art disclosures The search division generally assumes that any technical subject-matter in a prior-art document is sufficiently disclosed and so part of the state of the art. Even if there is some doubt about this, it will still be cited in the search report as normal and relied on as a basis for an objection in the search opinion. It will be disregarded only if its disclosure is obviously insufficient (see G-IV, 2)."
                },
                "6.5": {
                    "content": "Incorrect compound records in online databases If the search division finds a compound when searching a database created by abstracting source documents (e.g. patents, journal articles or books) and identifying the chemical compounds disclosed in them but, on reading the source document, cannot find the compound, this does not automatically mean that there has been a mistake and that the compound is not disclosed in the document. For example, compounds which are named but whose structures are not drawn are still part of the disclosure and will be abstracted. In addition, database providers use standard nomenclature in their database records, whereas authors of technical literature frequently do not, and so the database record may use a different nomenclature for the compound from the source document. However, if the search division really is unable to find the compound in the source document, but the compound is relevant for assessing patentability, it may write to the database provider to ask why the compound was included in the abstract and where it is disclosed in the source. If the database provider has not replied by the time the search report is drafted, the document will be cited in the search report and in the search opinion on the assumption that it does disclose the compound, but the search division will also continue the search as though the compound did not exist."
                }
            }
        },
        "7. ": {
            "title": "Internet disclosures ‒ technical journals For some technical journals, the publisher's website displays the date when they were published online, especially if it differs from the date when they were published on paper (OJ EPO 2009, 456). There are various possible scenarios where a journal was published online (see G-IV, 7.5.3.1). In all cases, the search division makes a copy of the journal web page where the",
            "subsections": {},
            "content": " (electronic and paper) publication and pre-publication date or dates of the article or issue are mentioned and then cites it in the search report as an \"L\" document. It is best to do so as soon as the evidence is found and not leave it until later, since the information may be moved or removed from the website in the time between search and substantive examination."
        }
    },
    "Chapter VII – Unity of invention": {
        "1. ": {
            "title": "General remarks The requirement of unity of invention has a regulatory function and is intended to promote an efficient procedure up to grant (T 110/82 and F-V, 6). It would be unfair to treat applications as meeting this requirement where, because of their diverse content, they cost much more than average to process, especially in terms of search, since some of this extra cost would have to be covered by fees paid for other applications. Another aspect is that an application's content should be readily understandable, which will not always be the case where its subject-matter is very diverse.",
            "subsections": {
                "1.1": {
                    "content": "Partial European search report If the search division considers that a European patent application lacks unity of invention (see F-V, 1), it must carry out a search, and draw up a partial European search report under Rule 64(1), for those parts which relate to the invention (or unitary group of inventions) first mentioned in the claims (see F-V, 3.4). The partial European search report is accompanied by a list of the separate inventions identified. For more on the search opinion in cases where there is a lack of unity of invention, see B-XI, 5."
                },
                "1.2": {
                    "content": "Invitation to pay further search fees The search division will inform the applicant of the lack of unity of invention in a communication accompanying its partial search report and invite them to pay a further search fee for each invention other than the one first mentioned in the claims if they want the search to cover these inventions as well. Together with this invitation, the applicant will receive a provisional opinion on the patentability of the invention or unitary group of inventions first mentioned in the claims (see F-V, 3.4) and the reasons for the non-unity findings. This provisional opinion is for information only and the applicant does not need to reply to the points raised in it. If the applicant nevertheless submits a reply, the search division will not take it into account when drawing up the extended European search report (see the notice from the EPO dated 3 March 2017, OJ EPO 2017, A20).",
                    "subsections": {
                        "1.2.1": {
                            "content": "General The further search fees must be paid within two months (Rule 64(1)). Applicants using the automatic debiting procedure must inform the EPO within this period if they do not want some or even any of the other inventions to be searched, because otherwise further search fees for all of them will be debited automatically on the last day. (a) If the applicant does not pay any further search fees in time, there will be no further search and the partial search report will become the final search report, which is accompanied by the search opinion. Nevertheless, the final decision on unity of invention is taken by the examining division or – in the event of an appeal – ultimately by the board of appeal (B-VII, 1.4 and C-III, 3.2.1). (b) If the applicant pays further search fees for any of the remaining inventions or groups of inventions in time, a further search will be carried out on those inventions. The final search report will then be drawn up for all inventions for which search fees have been paid, i.e. the first one and the ones included in the further search. If the application does not meet the EPC requirements as regards any of the inventions for which further search fees have been paid, this will be mentioned in the search opinion. For example: invention 1 was searched and the applicant paid a further search fee for invention 3. The subject-matter of invention 3 was found to lack novelty. The search opinion will then cover invention 1 and object to a lack of novelty for the subject-matter of invention 3."
                        },
                        "1.2.2": {
                            "content": "Cascading non-unity If a European patent application is found to lack unity at the search stage, the invention first mentioned in the claims (see F-V, 3.4) will be searched and the applicant will be invited to pay further search fees for the others. They will also be warned that, even if a lack of unity \"a posteriori\" is later detected, no further invitation to pay additional fees will be issued. If the applicant pays further search fees for any of the other inventions, a search is carried out for those inventions. If this further search reveals that one or more of these inventions also lack unity \"a posteriori\", only the first invention in each group of inventions is searched. The applicant will not be invited to pay another set of further search fees. The search division will draw up the search opinion, setting out the reasons for its finding of non-unity and giving an opinion on the patentability of the searched inventions (see B-XI, 5). Divisional applications can be filed for any inventions that have not been searched (see C-IX, 1.2). Example The search division raises a lack of unity objection and identifies four different inventions A, B, C, D. The first invention A is searched and the applicant is invited to pay further search fees for inventions B, C and D. The warning mentioned above is given. The applicant pays two further search fees for inventions B and C. During the further search, B is found to lack unity \"a posteriori\" and is divided into groups of inventions B1, B2 and B3. In this case only B1 and C are searched. The European search opinion must fully explain why the claims of the application were divided into A, B, C and D and why B was then subdivided into B1, B2 and B3 and offer a view on whether A, B1 and C are patentable. Examination of the application in the European phase will be based on either A, B1 or C (see C-III, 3.2.2). The claims relating to inventions B2, B3 and D can be filed as divisional applications (see C-IX, 1.2)."
                        },
                        "1.2.3": {
                            "content": "The applicant has not paid all further search fees The applicant always has to clearly state which inventions the further search fees have been paid for. If the applicant pays only some, but not all, of the requested further search fees and does not indicate which inventions these fees are for, the search division will attempt to find out which inventions are to be covered by its further search or searches."
                        }
                    }
                },
                "1.3": {
                    "content": "Documents relevant only to other inventions The search on the invention first mentioned in the claims may also uncover documents that are relevant only to the other inventions. These documents do not necessarily have to be included in the partial European search report unless they are the basis for an objection to lack of unity \"a posteriori\" (see F-V, 5 and 7)."
                },
                "1.4": {
                    "content": "Assessment and possible review of the unity requirement A search division dealing with unity at the search stage applies the same criteria as are used in substantive examination (see F-V). In particular, it will not raise an objection of lack of unity merely because the inventions claimed are classed in separate classification groups, or simply as a way of restricting the search to certain parts of the documentation, for example certain classification groups (but see B-V, 3.3). The assessment of unity at the search stage is not definitive. Normally, the search division will have formed a first impression even before it carries out the search, but it will necessarily have done so prima facie, based on the common general knowledge in the relevant field and the prior art mentioned in the application. It will revisit this initial assessment during and after the search in the light of the documents found. Its findings will be reviewed again when substantive examination begins and even the position taken then may be changed later on in the proceedings in the light of new facts and evidence. However, as a general rule, a position already taken on unity of invention is maintained unless there are sound reasons for changing it. The final decision on the matter is taken by the examining division or – in the event of an appeal – ultimately by the board of appeal. So any previous finding on unity is basically always open to review."
                }
            },
            "content": " On the other hand, the general purpose of dealing with linked substantive issues in a single procedure would not be achieved if the provisions on unity of invention were applied too strictly, and so interconnected subject-matter must not be split up needlessly (see F-V)."
        },
        "2. ": {
            "title": "Procedures in cases of lack of unity",
            "subsections": {
                "2.1": {
                    "content": "Request for refund of further search fees At the examination stage, the applicant may challenge the finding of non-unity and request a refund of one or more of the further search fees paid. If the examining division finds that the challenge is justified, the fee or fees in question will be refunded (see, however, B-XI, 1.2)."
                },
                "2.2": {
                    "content": "Complete search despite lack of unity In some exceptional cases ‒ especially where the lack of unity was not immediately apparent and is detected \"a posteriori\" and the different inventions identified are conceptually very close ‒ the extra work and cost involved in carrying out a complete search and drawing up a search opinion (where applicable – see B-XI, 7) for all the inventions is only negligible. In such cases, the search division carries out the search on the other inventions at the same time as the one on the invention first mentioned in the claims and includes all the results in a single search report, in which it objects to the lack of unity and identifies the different inventions. It will also point out that it did not invite the applicant to pay further search fees because it was able to search all the claims without the extra work that would justify them. However, the search opinion (if applicable ‒ see B-XI, 7) will still raise the objection to the lack of unity of invention (see B-XI, 5)."
                },
                "2.3": {
                    "content": "Supplementary European search If a lack of unity of invention comes to light during a supplementary European search following an international (PCT) search, a partial supplementary European search report is drawn up on the invention or group of inventions first mentioned in the claims (see F-V, 3.4) on which the supplementary European search was based (Rule 164(1)(a)), irrespective of the ISA's findings on unity of invention. Together with this partial search report, the applicant will be invited to pay a further search fee for each invention other than the one first mentioned in the claims (Rule 164(1)(b)), i.e. the same procedure is followed as for the non-unity invitation issued under Rule 64(1) for direct European patent applications (see B-VII, 1.2). The applicant will also receive a provisional opinion on the patentability of the invention or unitary group of inventions first mentioned in the claims, which will include the reasons for the non-unity findings."
                }
            }
        },
        "3. ": {
            "title": "Lack of unity and Rule 62a or Rule 63",
            "subsections": {},
            "content": " The procedures for dealing with cases of lack of unity in which Rule 63 or Rule 62a applies are dealt with in B-VIII, 3.4 and 4.5 respectively."
        }
    },
    "Chapter VIII – Subject-matter to be excluded from the search": {
        "1. ": {
            "title": "General remarks The subject-matter listed in Rule 39.1 PCT can be regarded as excluded from the scope of a European search under the EPC too, i.e. on the basis that it is not susceptible of industrial application (Art. 57), is excluded from patentability under Art. 52(2) and (3) in so far as the European patent application relates to it as such or falls under one of the exceptions to patentability in Art. 53(b) and (c). The claims are not searched in so far as they relate to such subject-matter (for the procedure for limiting the search under Rule 63, see B-VIII, 3.1 to 3.4). For the specific case of compositions for use in methods of treatment of the human or animal body by surgery or therapy, or diagnostic methods practised on the human or animal body, see B-VIII, 2.1 below.",
            "subsections": {},
            "content": " The examining division is responsible for taking a final decision on whether the subject-matter is patentable, but the search division will also form a view on this for the purpose of drafting the search opinion (if applicable ‒ see B-XI, 7) and also in considering whether or not it needs to limit the search and apply the procedure under Rule 63(1) (see B-VIII, 3.1 to 3.4). This means that it too has to consider the patentability requirements other than novelty and inventive step (see G-II and G-III). It may be that potentially non-patentable subject-matter is found in only some of the claims or only part of a claim. This will then be indicated in the invitation under Rule 63(1) and in any subsequent partial search report or declaration replacing the search report under Rule 63(2)."
        },
        "2. ": {
            "title": "Considerations relating to specific exclusions from and exceptions to patentability",
            "subsections": {
                "2.1": {
                    "content": "Methods for treatment of the human or animal body by surgery or therapy and diagnostic methods practised on the human or animal body Even where a claim is drafted as a method of medical treatment (see G-II, 4.2) and is therefore not directed to patentable subject-matter, a meaningful search may be possible if the determinant technical feature is the effect of the substance, which can be searched. The procedure under Rule 63 (see B-VIII, 3.1 to 3.4) will then be unnecessary. For example, method claims can be worded as follows: \"A method of treating dementia by administering a compound of formula X to a patient\" or \"A method of diagnosis of disease Y practised on the human/animal body, comprising steps A, B and C\" These method claims are excluded from patentability under Art. 53(c), but the applicant will usually be able to reword them in an allowable form during the examination proceedings (see G-II, 4.2). They are therefore searched since they are usually characterised by the effect of substance X, by one or more of steps A, B and C not directly practised on the human or animal body or by the use of reagents rather than by the act of therapy or diagnosis on the human/animal body. If, however, a claim includes specific method features (e.g. a combination of pharmaceutical and physical treatment), a meaningful search may not be possible. If in doubt, the search division will issue an invitation under Rule 63(1) (see B-VIII, 3.1). But, regardless of whether such claims are searched or not, the applicant will be informed in the search opinion (if applicable ‒ see B-XI, 7) that the subject-matter in question is excluded from patentability (see B-XI, 3)."
                },
                "2.2": {
                    "content": "Subject-matter excluded from patentability under Art. 52(2) and (3) Subject-matter or activities listed in Art. 52(2), when taken as such (Art. 52(3)), are considered non-technical (G-II, 1 and 2). If a claim contains a mix of technical and non-technical features, the search division identifies which features contribute to the technical character of the claimed subject-matter (see G-VII, 5.4) and its search covers all those features. Features that appear to be non-technical when taken in isolation may still contribute to the technical character of a claimed invention if, in the context of that invention, they help to produce a technical effect that has a technical purpose. Merely implementing effects that are inherent in the excluded subject-matter (T 1543/06) or that result from circumventing the technical problem rather than contributing to its technical solution does not qualify as a technical effect (T 258/03). Examples of how to evaluate contribution to technical character for each of the items listed in Art. 52(2) are provided in G-II, 3.1-3.7. Claimed features are analysed in the light of the description and drawings to determine whether they produce a technical effect and contribute to a technical solution to a technical problem (see B-III, 3.2 and B-IV, 1.1). In particular, specific embodiments disclosed in the description and drawings ‒ to which the claims might reasonably be expected to be limited (see B-III, 3.5) ‒ are taken into account since they could confer technical character on the claimed features. If the search division considers that some claim features do not contribute to the technical character of the claimed invention, it will state this in the search opinion. If it objects to a lack of inventive step and at least some of the distinguishing features are found not to have a technical effect contributing to the solution of a technical problem (see G-VII, 5.4), it will substantiate this finding.",
                    "subsections": {
                        "2.2.1": {
                            "content": "Computer-implemented business methods If the features contributing to the technical character of the subject-matter of claims directed to computer-implemented business methods are so well-known that their existence at the relevant date cannot reasonably be disputed (T 1411/08, Reasons 4.1 and 4.2, and T 690/06, Reasons 13), the search division does not have to cite any documentary evidence of the relevant state of the art in the search report, because they then amount to \"notorious\" knowledge, for which no such evidence is needed. \"Notorious knowledge\" is not to be confused with the skilled person's common general knowledge, which is something that generally can be reasonably challenged (G-VII, 2 and 3.1). In such exceptional cases, a search report with no cited documents may be issued under Rule 61 (OJ EPO 2007, 592). This is not the same thing as issuing a declaration of no search or a partial search report under Rule 63(2)."
                        }
                    }
                }
            }
        },
        "3. ": {
            "title": "No meaningful search possible In addition to the reasons discussed in B-VIII, 1, an invitation under Rule 63(1) may be issued and the search subsequently limited under Rule 63(2) because the application falls so short of the relevant EPC requirements that it is impossible to carry out a meaningful search on all or some of the claims or part of a claim. The search division then applies the procedure under Rule 63 (see B-VIII, 3.1 to 3.4 and OJ EPO 2009, 533).",
            "subsections": {
                "3.1": {
                    "content": "Invitation to indicate subject-matter for search If the search division considers that the application falls so short of the EPC requirements that it cannot carry out a meaningful search into the state of the art on the basis of all or some of the subject-matter claimed (see B-VIII, 1, 2 and 3), it will invite the applicant to file, within two months, a statement indicating the subject-matter to be searched. The invitation will also give the reasons for this finding and may additionally indicate the claimed subject-matter on which the search division considers it feasible to base a meaningful search. In the particular case of medical method claims, the search division issues a complete search report only when the claims can easily be reworded to comprise patentable subject-matter (see B-VIII, 2.1). If, on the other hand, it plans to issue a partial search report (or a declaration of no search), it must first send an invitation (e.g. for the claims that cannot easily be reworded)."
                },
                "3.2": {
                    "content": "Reply to the invitation under Rule 63(1)",
                    "subsections": {
                        "3.2.1": {
                            "content": "No or late reply If applicants do not reply to the invitation under Rule 63(1) in time, the search division will take its own decision on what to search. It will then draw up a partial search report for what it searched or, in exceptional cases, issue a declaration of no search. As the limitation of the search has consequences in examination (see H-II, 5 and H-IV, 4.1.1), any late-filed reply will be included in the file for consideration at that stage because it may be useful for reviewing the search division's arguments for carrying out an incomplete search. Given that the search report should be published with the application, applicants cannot request further processing if they miss the two-month period under Rule 63, but they can request re-establishment of rights (see OJ EPO 2009, 533)."
                        },
                        "3.2.2": {
                            "content": "Reply in time If applicants reply to the invitation under Rule 63(1) in time and the search division considers it possible to carry out a meaningful search based on the subject-matter they have indicated, it will search that subject-matter. If applicants reply to the invitation under Rule 63(1) in time but the indicated subject-matter still cannot be fully searched, the search division will take its own decision on what to search, but will keep to what was indicated in the applicant's reply as far as possible. In exceptional cases, it may find that no meaningful search is possible at all. Statements consisting of reworded claims filed in reply to an invitation under Rule 63(1) are not considered amended claims within the meaning of Rule 137(1) but treated merely as explanations of the originally filed claims. The applicant must formally introduce these reworded claims into the proceedings by confirming that this is what they want within the time limit under Rule 70(1) or (2). The confirmation can be filed either together with the reply to the extended European search report (Rules 70a(1) and (2)) or, where applicable, when complying with the requirements under Rule 70(1) or (2). As far as possible, the search division will draw up the search report in the light of these explanations. Both the search report and the search opinion must clearly indicate what has been searched. Instead of indicating the subject-matter to be searched, applicants can reply to the invitation under Rule 63(1) by simply arguing why they believe a meaningful search can be carried out on all of the subject-matter claimed. If the search division is convinced by the applicant's arguments, it will issue a full search report. The search will therefore not be limited and there will be none of the associated consequences in examination. But if it is not convinced, or is only partially convinced, it will take its own decision on what to search and then issue a partial search report or, in exceptional cases, a declaration of no search. The examining division has final responsibility for deciding whether it was appropriate to send an invitation under Rule 63 and issue a declaration of no search or a partial search report at the search stage and it may find that it has to carry out an additional search (see C-IV, 7.3). Applicants can also reply to an invitation under Rule 63 by arguing against the findings there and ‒ as a main request ‒ asking the search division to fully search the claims as filed and ‒ as an alternative, in case the search division is still not convinced ‒ indicating specific subject-matter they would like to have searched (see also H-III, 3.2). A consultation may take place if the applicant phones the search division to enquire about the course of action after an invitation under Rule 63 has been sent. The consultation is limited to formal issues concerning the content of the invitation and the options available to the applicant. The search division writes minutes of the consultation and sends them to the applicant (without setting any time limit) for information only. The consultation itself does not count as a valid reply to the invitation and so the applicant still has to file a written reply within the time limit set there."
                        }
                    }
                },
                "3.3": {
                    "content": "Content of the extended European search report (EESR) In the two parts of the EESR, i.e. the search report (or the declaration of no search replacing it) and the search opinion, the search division will explain why it found under Rule 63 that it could not carry out a meaningful search on some or all of the claimed subject-matter and specify what subject-matter it did search (if any) following the procedures described in B-VIII, 3.2. In the search opinion, it will also invite the applicant to limit the claims to this searched subject-matter (in order to comply with Rule 63(3)). The documents cited in the search report and referred to in the search opinion will relate only to this subject-matter. Even if the searched subject-matter meets the EPC requirements (in particular in that it is novel, inventive and industrially applicable, but also in that it meets the other conditions, such as clarity under Art. 84), the search opinion will still be negative, because the claims do not meet these requirements across their whole scope. Similarly, if the applicant replies to the invitation under Rule 63(1) by disputing the finding that a meaningful search is impossible (see B-VIII, 3.2) but the search division still disagrees, it will explain why in the search opinion, referring directly to the applicant's reply if necessary."
                },
                "3.4": {
                    "content": "Applications falling under Rule 63 and lacking unity There are cases where the application not only falls so short of the EPC requirements that it is impossible to carry out a meaningful search into the state of the art based on some of the subject-matter claimed (B-VIII, 1, 2 and 3) but also lacks unity of invention under Art. 82 and Rule 44. Sometimes it is enough for the search division to raise only unity of invention and send an invitation under Rule 64(1) (see B-VII, 1.1 and 1.2), for example where a large number of claims results in a serious lack of conciseness but this can be resolved by splitting the claims up into the different inventions. In other cases, however, the search division may need to apply the procedures under both Rule 64(1) (i.e. invite the applicant to pay further search fees for inventions other than the one first mentioned in the claims) and Rule 63(1) (i.e. invite the applicant to indicate the subject-matter to be searched). If so, it will send the applicant the Rule 63(1) invitation first. Where the lack of unity is already apparent, this invitation will also identify the invention (or group of inventions) first mentioned in the claims (\"first invention\" ‒ see F-V, 3.4) and the claims which relate to it, either in full or in part, and ask the applicant to clarify what to search in this respect. If the applicant has not replied by expiry of the time limit under Rule 63(1), any subject-matter to be searched for the first invention will be determined according to the procedures described in B-VIII, 3.2. A partial search report (or exceptionally a declaration of no search) will then be drawn up on this first invention and sent to the applicant, along with an invitation to pay further search fees under Rule 64(1) for the other inventions and a provisional opinion on the first invention's patentability that includes the reasons for the non-unity findings. Where appropriate, the invitation under Rule 64(1) may also include an invitation under Rule 63(1) asking the applicant to clarify the subject-matter to be searched for any other inventions for which they later pay further search fees. Where these exceptional circumstances arise in cases of supplementary European search reports for Euro-PCT applications, the procedure is the same, except that a Rule 164(1) invitation is sent instead of a Rule 64 invitation. Rule 63 also applies to searches performed under Rule 164(2) (see C-III, 3.1). As for searches on directly filed European patent applications, any Rule 63 objection relating to an invention for which a search fee has to be paid must be included in the invitation to pay that fee."
                }
            },
            "content": " Rule 63 relates only to whether the search is practicable and not to whether its results are likely to be relevant in the later examination proceedings. Even if a search will not produce any result that could be used in examination proceedings, it cannot be refused on the basis of Rule 63 (see T 1242/04). What is or is not \"meaningful\" is a question of fact to be answered by the search division. Its finding may change in the light of any reply from the applicant to the invitation under Rule 63(1) (see B-VIII, 3.2). How the search division exercises its discretion will depend on the facts of the case. A restriction of the search must be carefully considered. There are cases where a search is impossible in practice in view of the failure to meet the EPC requirements, for example a fundamental lack of clarity or the absence of any technical character whatsoever. However, the word \"meaningful\" must always be construed reasonably, i.e. Rule 63 cannot be invoked simply because a search is difficult or does not produce results relevant for subsequent examination proceedings. As there is no legal provision requiring that applicants draft their application in a way that makes searching easier, \"procedural economy\" cannot be used as a reason, or part of a reason, for issuing a partial search report (see also T 1020/98). The following – non-exhaustive – examples illustrate where Rule 63 can apply: (i) claims lacking support; insufficient disclosure An example is a claim so broadly formulated that its scope is at least to some extent speculative, i.e. not supported by the disclosure of the application. It is then so broad that a meaningful search cannot be carried out over its whole scope but only on the basis of the narrower, disclosed invention. In extreme cases, this may mean a search covering only (one or more of) the specific examples disclosed in the description. The procedure under Rule 63(1) can then be applied (see B-VIII, 3.1 to B-VIII, 3.4) on the basis of a failure to meet the requirements of sufficiency of disclosure and support set out in Art. 83 and 84 (see F-III, 1 and 2, and F-IV, 6). However, the search division needs to bear in mind that whether these requirements are met has to be assessed from the point of view of the person skilled in the art. (ii) claims lacking conciseness An example is where there are so many claims, or so many possibilities within a claim, that it is unduly burdensome to determine the subject-matter for which protection is sought (however, see B-VIII, 4 on multiple independent claims in the same category). A complete search (or even any search at all) may then be impossible in practice. Again, it may be appropriate to apply Rule 63 and then issue a partial search report (following the procedures described in B-VIII, 3.1 to 3.3) or a declaration of no search, on the grounds that the claims are so lacking in conciseness that a meaningful search is impossible (see Art. 84; F-IV, 5). (iii) claims lacking clarity An example is where the parameter chosen by the applicant to define the invention makes a meaningful comparison with the prior art impossible, for example because the prior art did not use the same parameter or did not use any parameter at all. The applicant's parameter may then lack clarity (see Art. 84; F-IV, 4.11) and it may even be so unclear that a meaningful search of the claims, an individual claim or part of an individual claim is impossible. It may then be appropriate to apply Rule 63 and issue a partial search report (or, in exceptional cases, no search report at all) under Rule 63(2) (following the procedures described in B-VIII, 3.1 to 3.3) after restricting the search to the worked examples, in so far as they can be understood, or to the way in which the desired parameter is obtained (any reply from the applicant to the invitation under Rule 63(1) would then be taken into account as described in B-VIII, 3.2 to determine the subject-matter to be searched). (iv) claims contravening Art. 76 or Art. 123(2) Rule 63 may also apply in the following cases of claims containing added subject-matter (see B-VIII, 6): - claims in divisional applications contravening Art. 76 - applications for which the claims were filed after the filing date and which contravene Art. 123(2) or - Euro-PCT applications for which amended claims were filed as a basis for the supplementary European search and which contravene Art. 123(2). These examples are not exhaustive (see also B-VIII, 6). The basic principle is that it needs to be clear and transparent for both the applicant and third parties what has and has not been searched. How these Rule 63 cases are handled in subsequent examination proceedings is dealt with in H-II, 5 and H-IV, 4.1.1."
        },
        "4. ": {
            "title": "More than one independent claim per category (Rule 62a)",
            "subsections": {
                "4.1": {
                    "content": "Invitation to indicate which independent claim to search If the search division considers that the claims as filed do not comply with Rule 43(2) (see F-IV, 3.2), it may invite the applicant to indicate compliant claims on which the search can be based within two months. In the same way as for an invitation under Rule 64, it is left to the search division's discretion whether to send this invitation or instead carry out a full search on all the claims and raise the objection under Rule 43(2) only in the written opinion."
                },
                "4.2": {
                    "content": "Reply to the invitation under Rule 62a(1)",
                    "subsections": {
                        "4.2.1": {
                            "content": "Failure to reply in time If the applicant does not indicate the claims to be searched in time, the search will be based on the first claim in each category. In either case, a partial search report will be drawn up. As the limitation of the search has consequences in examination (see H-II, 5 and H-IV, 4.1.1), any late-filed reply is included in the file for consideration at that stage, in the same way as is done for a late-filed reply to a Rule 63 invitation (see B-VIII, 3.2.1). Since the search report should be available when the application is published, Rule 62a requires that the applicant reply within two months and rules out further processing. However, a request for re-establishment of rights may be granted if the relevant conditions are met."
                        },
                        "4.2.2": {
                            "content": "Reply filed in time If applicants reply to the invitation under Rule 62a(1) in time by indicating an independent claim in a particular category that they want to have searched, the search division will carry out the search based on this claim. It is also open to applicants to indicate more than one independent claim in the same category if these claims fall within the exceptions in Rule 43(2) (see F-IV, 3.2). However, if the search division then finds that the indicated independent claims do not in fact fall within these exceptions, it will search only the one that comes first in numerical order. Example An invitation under Rule 62a(1) is sent for an application that contains independent product claims 1, 10 and 15. The applicant replies that independent product claims 10 and 15 fall within the exceptions in Rule 43(2) and indicates that these two claims should be searched. The search division disagrees, and so only claim 10 is searched. See B-VIII, 3.2.2 for the procedure followed where the applicant tries to file amendments. Instead of indicating the independent claim or claims to be searched, applicants can reply to the invitation under Rule 62a(1) by simply arguing why they believe that the claims comply with Rule 43(2) (i.e. why the multiple independent claims in the same category fall within one or more of the exceptions in Rule 43(2)). If the search division is convinced by the applicant's arguments, it will issue a search report based on all the claims, and the consequences a limited search has at the examination stage will not apply. But if it is not convinced, it will issue a search report based only on the first independent claim in the category. The examining division has final responsibility for deciding whether an invitation under Rule 62a was appropriate. Applicants can also reply to an invitation under Rule 62a by arguing against the findings there and ‒ as a main request ‒ asking the search division to search all the claims as filed and ‒ as an alternative, in case the search division is still not convinced ‒ indicating the independent claims they would like to have searched (see also H-III, 3.2). The procedure where applicants phone the search division to enquire about the course of action after an invitation under Rule 62a has been sent is as described above for the invitation under Rule 63 (see B-VIII, 3.2.2)."
                        }
                    }
                },
                "4.3": {
                    "content": "Content of the extended European search report (EESR) The search opinion will invite the applicant to limit the application to the claims which have been searched (Rule 62a(2)). If the applicant replied to the invitation under Rule 62a(1) by disputing the finding under Rule 43(2) (see B-VIII, 4.2) but the search division still disagrees, it will explain why in the search opinion."
                },
                "4.4": {
                    "content": "Cases under Rule 62a where claims fees have not been paid If an independent claim has been deemed to be abandoned under Rule 45(3) or Rule 162(4) because the claims fee has not been paid (see A-III, 9), the applicant cannot indicate it in reply to the invitation under Rule 62a(1), because it is no longer eligible for search (see B-III, 3.4). If such a claim is indicated, the search division will ignore this, instead applying Rule 62a(1), last sentence, and searching the first independent claim in the category in question for which claims fees have been paid. If all the independent claims in the category in question have been deemed to be abandoned because the fees were not paid, no invitation under Rule 62a(1) will be issued and none of them will be searched."
                },
                "4.5": {
                    "content": "Applications falling under Rule 62a and lacking unity There are cases where the application not only does not comply with Rule 43(2) (see B-VIII, 4.1 and F-IV, 3.2) but also lacks unity of invention under Art. 82 and Rule 44. Sometimes it is enough for the search division to raise only the issue of unity of invention and send an invitation under Rule 64(1) (see B-VII, 1.1 and 1.2). In other cases, however, the search division may need to apply the procedures under both Rule 64(1) (i.e. invite the applicant to pay further search fees for inventions other than the one first mentioned in the claims) and Rule 62a(1) (i.e. invite the applicant to indicate the independent claims to be searched). It will then send the applicant the invitation under Rule 62a(1) first. Where the lack of unity is already apparent when the invitation under Rule 62a(1) is sent, it will also identify the invention (or group of inventions) first mentioned in the claims (\"first invention\" ‒ see F-V, 3.4) and the claims which relate to it, either in full or in part, and ask the applicant to indicate which claims to search. If the applicant has not replied by expiry of the time limit under Rule 62a(1), the claims to be searched for the first invention will be determined according to the procedures described in B-VIII, 4.2. A partial search report will then be drawn up on this first invention and sent to the applicant, along with an invitation to pay further search fees under Rule 64(1) for the other inventions and a provisional opinion on the first invention's patentability that includes the reasons for the non-unity findings. Where appropriate, this invitation under Rule 64(1) may also include an invitation under Rule 62a(1) asking the applicant to clarify the claims to be searched in respect of any other inventions for which they later pay further search fees. However, it can also happen that, after the invitation under Rule 62a(1) has been sent for all claims, the claims which comply with Rule 43(2) and so are searched (as determined according to the procedures in B-VIII, 4.2) are found to be open to an objection of lack of unity a posteriori. An invitation to pay further search fees under Rule 64(1) will then be sent, but only in relation to the subject-matter of the claims determined by the applicant's reply (or lack of reply) to the invitation under Rule 62a(1). Where these exceptional circumstances arise in cases of supplementary European search reports on Euro-PCT applications, the procedure is the same, except that a Rule 164(1) invitation is sent instead of a Rule 64 invitation. Rule 62a also applies to searches performed under Rule 164(2) (see C-III, 3.1). As for searches on directly filed European patent applications, any Rule 62a objection relating to an invention for which a search fee has to be paid must be included in the invitation to pay that fee."
                },
                "4.6": {
                    "content": "Handling of dependent claims under Rule 62a Claims depending ‒ whether directly or only indirectly via other dependent claims ‒ on an independent claim excluded from the search in accordance with Rule 62a(1) (see B-VIII, 4.2) are likewise excluded from the search. Conversely, if a dependent claim depends on more than one preceding claim and not all of them were searched, it will be searched but only in so far as it depends on a claim or claims which were searched in accordance with Rule 62a(1)."
                }
            }
        },
        "5. ": {
            "title": "Invitation under both Rule 62a(1) and Rule 63(1)",
            "subsections": {},
            "content": " It is sometimes necessary to send an invitation under both Rule 63 (see B-VIII, 3.1) and Rule 62a(1) (see B-VIII, 4.1), for example where clarifying which claim or claims to search under Rule 62a will not necessarily help to clarify what subject-matter to search, because the application contains several independent claims in the same category and none or only some of them can be meaningfully searched over their whole scope. The invitations under Rule 62a(1) and Rule 63(1) are then sent jointly in a single communication setting the same two-month time limit for replying under both rules. Applicants wishing to reply to both invitations should do so at the same time. The independent claims indicated in reply to the invitation under Rule 62a(1) and the subject-matter indicated in reply to the invitation under Rule 63(1) must be compatible. If the applicant's indications are incompatible, the search division can choose, depending on the circumstances, either (i) to search the claims indicated by the applicant under Rule 62a(1) and, where necessary, limit the subject-matter searched for those claims by applying Rule 63(2) by analogy or (ii) to search that subject-matter defined in the first independent claim in a particular category which is compatible with the subject-matter indicated by the applicant under Rule 63(1) by applying Rule 62a(1), last sentence, by analogy. Although sent in the same communication, the invitations under Rule 62a(1) and Rule 63(1) are still legally separate. Applicants are therefore free to reply to only one of them. If they reply only to the Rule 62a(1) invitation, option (i) above applies. If they reply only to the Rule 63(1) invitation, option (ii) above applies."
        },
        "6. ": {
            "title": "Claims contravening Art. 123(2) or Art. 76(1)",
            "subsections": {},
            "content": " If the claims on which the search is to be based were filed after the filing date or under Rule 58, they are not part of the application documents \"as originally filed\". Similarly, the supplementary European search on a Euro-PCT application is sometimes based on amended claims (see B-III, 3.3.1). In either case, before starting the search, the search division checks whether or not these claims add any subject-matter that goes beyond what was in the application \"as originally filed\" (see also A-III, 15). For Euro-PCT applications, this means the PCT application as originally filed. If the claims contravene Art. 123(2), the search division will face one of the following situations: (a) there are doubts about whether an objection can be raised (e.g. the amendment relies on common general knowledge and the search division is unsure whether the introduced term can be based on this) and/or the amendment does not significantly change the scope and subject-matter of the search: the search division then searches the claims as they are. (b) there are certain individual features in the claims that clearly contravene Art. 123(2): the search division then ignores these features when carrying out the search. (c) there are substantial non-allowable amendments in the claims: the search division may then need to issue an invitation under Rule 63(1) before starting the search (see B-VIII, 3(iv)). Depending on the reply to the invitation, it may issue a partial search report or even a declaration replacing the search report under Rule 63. In deciding what to include in the search and what to exclude from it, it refers to how the invention is defined in the description. A similar problem can also arise when a divisional application is filed and the amended claims do not meet the requirements of Art. 76(1): the same criteria as described in steps (a) to (c) above are then applied. In any case, the search opinion will include an objection under Art. 123(2) or Art. 76(1) and give the reasons for limiting the scope of the search."
        }
    },
    "Chapter IX – Search documentation": {
        "1. ": {
            "title": "General",
            "subsections": {
                "1.1": {
                    "content": "Organisation and content of the documentation available to the search divisions The search documentation consists mainly of a collection of patent documents that can be systematically accessed in a way that facilitates searching. It also includes non-patent literature – such as periodicals and other technical publications – that can be accessed via in-house and external databases, with some items also available for consultation in a virtual library. Particularly relevant items of non-patent literature are selected for inclusion in the systematically accessible documentation. The systematically accessible part of the search documentation includes the minimum documentation that an International Searching Authority must consult under Rules 34 and 36.1(ii) PCT but goes beyond these minimum requirements."
                },
                "1.2": {
                    "content": "Means of searching systematically The search documentation can be searched using the Cooperative Patent Classification (CPC), which is based on the International Patent Classification (IPC) but comprises finer internal subdivisions, or using other classification systems and/or words."
                }
            }
        },
        "2. ": {
            "title": "Patent documents arranged for systematic searching",
            "subsections": {
                "2.1": {
                    "content": "PCT minimum documentation The systematically accessible search documentation includes the national patent documents belonging to the PCT minimum documentation specified in Rule 34.1(b)(i) and (c) PCT. It also includes published international (PCT) and regional (e.g. European) patent applications, patents and inventors' certificates (Rule 34.1(b)(ii) PCT). A complete list of the contents of the PCT minimum documentation is available on the WIPO website."
                },
                "2.2": {
                    "content": "Unpublished patent applications Since it is for the examining division to complete the search for any conflicting applications that were still not published at the time of the initial search, unpublished patent applications are not among the documents which can be cited in the search report and so are not in the search documentation (see B-VI, 4.1)."
                },
                "2.3": {
                    "content": "Search reports The official European and international (PCT) search reports are normally published together with the European and international applications and are included in the search files together with these applications. The official search reports for national applications are also included in these files where they are publicly available, as are any unofficial search reports. Search reports that are not normally or not yet publicly available in the form of a published document are available to the search division separately from the state-of-the-art documents, but it is not compulsory to search them for all applications."
                },
                "2.4": {
                    "content": "Patent family system The EPO keeps a patent family system based on application and priority data of the patent documents stored in its databases. Normally, just one representative document of a patent family is displayed on screen, but there will be links to the other family members."
                }
            }
        },
        "3. ": {
            "title": "Non-patent literature arranged for systematic access",
            "subsections": {
                "3.1": {
                    "content": "Periodicals, records, reports, books, etc. The systematically accessible search documentation includes relevant articles from the list drawn up by the competent WIPO body of periodicals belonging to the minimum documentation under the PCT and from other periodicals the search divisions consider useful. Copies of the articles selected as relevant for search purposes are generally added to the EPO search databases with a fictitious country code \"XP\" and scanned for inclusion in the electronic \"BNS\" collection. The EPO also subscribes to many other periodicals, including abstract journals, and obtains records of conference proceedings, reports, books, standards, etc. in all three of its official languages and covering the various technically important geographical areas. Individual items are selected for inclusion in the online documentation if they are useful additions to the state of the art."
                }
            }
        },
        "4. ": {
            "title": "Non-patent literature arranged for library-type access",
            "subsections": {
                "4.1": {
                    "content": "Content In addition to the non-patent literature mainly used for search purposes (see B-IX, 3), the non-patent literature arranged for library-type access also includes literature which the search division can use as sources of information and for professional development and which covers not only general and background technical information but also new technical developments. The collection also includes reports, pamphlets, etc. Internet-based document delivery services of publishing companies are available to the search division members via an electronic virtual library (EVL)."
                }
            }
        },
        "5. ": {
            "title": "Access to EPO documentation for the national patent offices The EPO provides the national offices of its member states with access to its electronic search documentation described in B-IX, 2.1 to 2.3.",
            "subsections": {},
            "content": " Access to the EPO's other documentation may be limited if it is delivered by commercial database providers. This depends on the conditions of data delivery agreed between the EPO and the individual data provider. However, national offices may also have their own separate agreements with data providers."
        }
    },
    "Chapter X – Search report": {
        "1. ": {
            "title": "General The search report records the results of the search. Its scope is limited in the following cases:",
            "subsections": {},
            "content": " (i) claims are treated as abandoned because the claims fees were not paid (Rule 45(3), see B-III, 3.4) (ii) no search was possible and so a declaration under Rule 63 is issued instead (see B-VIII) (iii) a partial search report is issued under Rule 63 and/or Rule 62a (see B-VIII) (iv) a partial European search report is issued owing to a lack of unity under Rule 64(1) (v) a supplementary European search report under Art. 153(7) is incomplete for the reasons given in (i) or (iii) (Rule 162(4) applies if there are unpaid claims fees) or is replaced by a declaration for the reason in (ii). The search reports issued in cases (i) – (iii) (and (v) where incomplete for one of the reasons in (i) – (iii)) are sent to the applicant, published and used as a basis for the examination by the examining division. A partial search report issued under Rule 64(1) (case (iv)) is also transmitted to the applicant, but not published; however, it can still be inspected by the public as it is included in the electronic file accessible via the European Patent Register (see A-XI, 2). Except in the cases mentioned in B-XI, 7, European search reports and supplementary European search reports are accompanied by a search opinion giving the search division's view on whether the application and the invention concerned seem to meet the requirements of the EPC (see B-XI, 1.1). Together, the European search report or supplementary European search report and the search opinion make up the extended European search report (EESR). The search division is responsible for drawing up the European search report. It is also responsible for drafting international search reports and search reports on behalf of the industrial property offices of some EPC contracting states (see B-X, 2 and B-II, 4.4 to 4.6). This chapter provides the information the search division needs to properly draw up the search report. A search report must not contain anything, in particular any expressions of opinion, reasoning, arguments or explanations, beyond what has to be entered on the form used and the opinions mentioned in B-III, 1.1 and 1.2 or B-X, 9.2.8. However, this does not apply to the search opinion (see B-XI, 3)."
        },
        "2. ": {
            "title": "Different types of search report drawn up by the EPO The EPO search divisions draw up the following types of search report:",
            "subsections": {},
            "content": " (i) European search reports (see B-II, 4.1) (ii) supplementary European search reports on PCT applications (see B-II, 4.3) (iii) \"search results under Rule 164(2)\" (see C-III, 3.1) (iv) international search reports under the PCT (see B-II, 4.4) (v) international-type search reports (see B-II, 4.5) (vi) search reports for national offices (see B-II, 4.6) (vii) search reports produced as part of special activities. The results of any additional searches carried out at the examination stage (see B-II, 4.2) are also recorded but are not published. However, the documents found may be used in the examination proceedings (see C-IV, 7.3). This chapter sets out the requirements for search reports of types (i) to (v) only. Nevertheless, all search reports drawn up by the EPO search divisions should be as similar as possible."
        },
        "3. ": {
            "title": "Form and language of the search report",
            "subsections": {
                "3.1": {
                    "content": "Form The standard search report has a main page used for all searches to record the most important information, including: (i) the application number (ii) the application's classification (iii) the technical fields searched (iv) the relevant documents found in the search (v) the name of the search division member who carried out the search plus supplemental sheet A and, in certain cases, also supplemental sheet B. Supplemental sheet A is used for recording whether the title, the abstract as filed by the applicant and the figure to be published with the abstract were approved or amended and for providing the translation of the title into the other two official languages (see B-X, 7). Supplemental sheet B has to be filled in if the search was restricted, i.e. when claims were not searched because the claims fees had not been paid (see B-III, 3.4), when there is a lack of unity of invention (see B-VII), when a meaningful search was not possible and so the search report is either incomplete or replaced entirely by a declaration under Rule 63 (see B-VIII, 3) or when the search was limited under Rule 62a (see B-VIII, 4). Dates are given in the format specified in WIPO standard ST.2."
                },
                "3.2": {
                    "content": "Language The search report or the declaration accompanying or replacing it under Rule 63 is drawn up in the language of the proceedings."
                },
                "3.3": {
                    "content": "Search summary For in-house quality assurance purposes, the search division summarises all the information needed by the auditors to understand what has been searched (see B-III, 3), where (see B-III, 2) and how (see B-IV, 2). This summary of the search is not made publicly available."
                },
                "3.4": {
                    "content": "Record of search strategy An \"Information on Search Strategy\" sheet is automatically added to all EPO search reports. It lists the databases searched, classification symbols used and keywords reflecting the searched subject-matter."
                }
            }
        },
        "4. ": {
            "title": "Identification of the European patent application and the search report type The European patent application concerned is identified on the main page and supplemental sheets by its application number.",
            "subsections": {},
            "content": " The search report type is also specified. Where the application and the search report are published together, the main page of the report is marked A1 (WIPO Standard ST.16). If the application is published before the search is carried out, the main page is marked A2 (WIPO Standard ST.16). The later search report is drawn up on a new main page marked A3 (WIPO Standard ST.16). If it is a supplementary European search report for an international application, the new main page is marked A4 (WIPO Standard ST.16)."
        },
        "5. ": {
            "title": "Classification of the European patent application The main page of the search report shows the IPC classification symbol or symbols assigned to the European patent application (see B-V, 3).",
            "subsections": {},
            "content": " If the application is published before the search report has been drawn up (A2 publication, see B-X, 4), the search division will fill in supplemental sheet A in time for its publication, entering all the necessary information mentioned in B-X, 7 and the application's IPC classification (see B-V, 3.3 on cases where the application lacks unity). The IPC classification is shown again on the separately published search report (A3 publication, see B-X, 4). If, in the meantime, the search division has changed the IPC classification initially assigned and shown on the A2 publication, it is the new classification that will appear on the later published search report (see B-V, 3.1)."
        },
        "6. ": {
            "title": "Technical fields searched Although not required by the EPC, the European search report includes the technical fields searched in the form of a list of IPC symbols describing them down to the sub-class level.",
            "subsections": {},
            "content": " Where the search report is based entirely or partly on a previous search carried out for an application relating to similar subject-matter, the report displays the parts of the documentation consulted for this previous search as the ones consulted for the application in question, again by using the appropriate IPC symbols."
        },
        "7. ": {
            "title": "Title, abstract and figure to be published with the abstract (as indicated on supplemental sheet A)",
            "subsections": {
                "8.2": {
                    "content": "PCT, respectively."
                }
            },
            "content": " The search division fills in supplemental sheet A before publication of the application, regardless of whether it is going to be published with the search report (A1 publication) or without it (A2 publication), because the information entered there is needed to publish the application. On supplemental sheet A, the search division indicates: (i) approval or amendment of the abstract's wording, which is communicated to the applicant under Rule 66 (see A-III, 10). The search division does not study the abstract beyond ensuring that it relates to the application and does not conflict with the invention's title or the application's classification. Since the abstract has to relate to the application as filed, the search division will consider it and decide on its final wording before carrying out the search, in order to avoid being inadvertently influenced by the search results. If the search report is published separately (A3 publication), no information about the abstract is given on supplemental sheet A. The information sent to the applicant includes the invention's title and any figure of the drawings to be published with the abstract. In exceptional cases, the search division may change the abstract after the search but, if the application has already been published (A2 publication), supplemental sheet A will not be reissued. (ii) approval or amendment of the invention's title (see A-III, 7) (iii) approval, change or omission of any figure selected by the applicant to accompany the abstract (see F-II, 2.3(vi) and 2.4) (iv) the translation of the European patent application's title into the two other official languages. The European Patent Bulletin is published in all three of the EPO's official languages (Art. 14(7)(a)) and contains the entries made in the European Patent Register. These entries include the invention's title (Rule 143(1)(c)) and so it must be available in all three official languages. The above applies equally to applications published with the search report (A1 publication) and those published without it (A2 publication). In an A2 publication, supplemental sheet A also shows the application's IPC classification (see B-X, 5). In an A1 publication, the IPC classification appears only on the search report (Rule 61(6)). Supplemental sheet A also specifies whether it relates to an A1 or an A2 publication. In the case of a supplementary European search report on an international application, supplemental sheet A is marked A4. The search division does not decide on the title, abstract or figure to be published with the abstract, as the ISA will already have decided on them under Rules 37.2, 38 and"
        },
        "8. ": {
            "title": "Restriction of the searched subject-matter In the following cases, the search report, the declaration of no search or the partial search report will state that the search was restricted and which claims have or have not been searched:",
            "subsections": {},
            "content": " (i) claims above the number of fifteen for which no additional fee has been paid (see B-III, 3.4). This only applies to European and supplementary European search reports. (ii) lack of unity of invention (see B-VII). The partial search report (see B-VII, 1.1) points out that it has been drawn up for the invention first mentioned in the claims and is accompanied by a list of the different inventions identified which specifies their subject-matter and the claims or parts of claims that relate to them (see Rule 44(2). This applies regardless of whether the lack of unity is detected \"a priori\" or \"a posteriori\". Any search report later drawn up for all the inventions for which search fees have been paid will specify the different inventions searched (and the related claims or parts of claims). (iii) claims for which no meaningful search or only an incomplete search could be carried out (see B-VIII). The search division then declares: (a) that a meaningful search could not be carried out for any of the claims (this declaration replaces the search report) or (b) that a meaningful search could not be carried out for one or more of the claims or parts of them. The claims concerned are specified in this declaration, which is issued together with the partial search report. In both cases (a) and (b), the reasons for not carrying out the search or for restricting it must be given (e.g. subject-matter not patentable; insufficiently clear claims). If necessary, full reasoning is provided in the search opinion; see B-VIII, 3.3 for the content of the EESR in these cases. (iv) claims not searched because they do not comply with Rule 43(2) (see B-VIII, 4.2)."
        },
        "9. ": {
            "title": "Documents found in the search",
            "subsections": {
                "9.1": {
                    "content": "Identification of documents in the search report",
                    "subsections": {
                        "9.1.1": {
                            "content": "Bibliographic data All documents cited in the search report must be clearly identified by indicating the necessary bibliographic data. All citations in the search report normally comply with the recommendations in WIPO Standards ST.14 (for including references cited in patent documents), ST.3 (for two-letter codes) and ST.16 (for identifying different kinds of patent documents), but there can be exceptions where strictly adhering to them would entail a lot of extra work and cost and is not necessary to enable a document to be clearly and easily identified."
                        },
                        "9.1.2": {
                            "content": "\"Corresponding documents\" The search division will often come across \"corresponding\" documents (see B-VI, 6.2), i.e. documents which have the same or substantially the same technical content. These are usually either patent documents from the same patent family or abstracts. (i) Patent documents in the same patent family These are patent documents which are from the same country or from different countries and share at least one claimed priority. If a cited patent document belongs to a patent family, the search division does not cite all the other family members it knows of and can understand, as they are anyway mentioned in the annex to the search report. However, it may choose to mention one or more members in addition to the one cited (see B-IV, 3.1). These documents are identified by naming the office they originate from, specifying their type and number and placing them after an ampersand sign (&). There are various possible reasons why the search division may wish to draw attention in the search report to more than one document in the same patent family: (a) One document in the patent family was published before the earliest priority date of the application but in a non-EPO language, whereas another member of the same patent family was published in an EPO language (see Art. 14(1)) but after the earliest priority date of the application. Example A European application claims a priority of 3 September 1999. The search on this application uncovers a relevant document WO 99 12395 A, which was published in Japanese on 11 March 1999 and so in time to qualify as prior art under Art. 54(2). There is also the European family member published as an English translation under Art. 153(4) on 1 March 2000. That is too late for it to be prior art under Art. 54(2), but it can be cited in the search report as an \"&\" document of the Japanese-language WO publication and made available to the applicant (see B-X, 11.3). It will then be used to interpret the content of the Japanese WO publication when the application is examined (see G-IV, 4). In the search report, these documents would be cited as shown below (on the linking of cited documents to the claims they relate to ‒ here: claims 1-10 ‒ see B-X, 9.3). X WO 99 12395 A (SEKI SHUNICHI; KIGUCHI HIROSHI (JP); SEIKO EPOSON CORP (JP)) 11 March 1999 (1999-03-11) * figure 1 * & EP 0 982 974 (SEIKO EPSON CORP) 1 March 2000 (2000-03-01) * figure 1 * * claim 1 * 1-10 (b) There are several different documents in the same patent family and each one contains relevant technical subject-matter not found in the other family members. (c) The application cites a family member drafted in a non-EPO language but there is another family member in an EPO language, and both were published before the application's earliest priority date. Example Y WO9001867 A (WIDEGREN LARS (SE)) 8 March 1990 (1990-03-08) * claim 1 * 1-10 D,Y & SE461824 B (WIDEGREN LARS (SE)) 2 April 1990 (1990-04-02) 1-10 By citing the relevant SE document, which is a family member of the relevant WO document, in the application, the applicant has already met the requirement that the state of the art be mentioned in the description (Rule 42(1)(b)). It is important to make the examining division aware of this by mentioning it in the search report (see F-II, 4.3). (ii) Abstracts (see B-VI, 6.2) Abstracts are provided by several database providers (e.g. Chemical Abstracts or Derwent) and cover many different types of disclosure (e.g. patent documents, journal articles, PhD theses, books). They summarise the most important aspects of the original document's technical content. Most abstracts cited are in English. Whenever citing an abstract in the search report, the search division must always enter the original document to which it relates after the \"&\" sign. Example X DATABASE WPI Week 200961 Thomson Scientific, London, GB; AN 2009-N01904 & WO 2009/104990 A1 (VALEXPHARM CO LTD) 27 August 2009 (2009-08-27) * abstract * 1-5 There are various reasons why the search division may choose to cite the abstract rather than the original document (in which case the original document must instead be mentioned as an \"&\" document). For instance, the original document may not be readily available to it (e.g. a PhD thesis) or it may be in a non-EPO language (e.g. a journal article in Russian) and there is no corresponding document. The original document is made available to the applicant only if it has been earmarked for this by the search division (see B-X, 12). If the search division wants to refer to a published Japanese or Korean patent application (with kind code A), it cites the Japanese or Korean publication in the search report. If an English abstract is available in the EPO databases (Patent Abstracts of Japan or Patent Abstracts of Korea), both the Japanese or Korean publication and the English abstract are made available to the applicant. A machine translation is also made available (see B-X, 9.1.3 and 12, and G-IV, 4.1)."
                        },
                        "9.1.3": {
                            "content": "Language of the documents cited Members of the same patent family are often published in various different languages. The search division therefore has a choice as to the language in which it wishes to cite such a document in the search report. If the relevant technical content of the various family members is the same and they were all published before the earliest priority date of the application, they are all equally relevant to the application. The search division chooses which one of them to cite by looking at the languages they were published in and applying the following order of preference: (1) an official EPO language (i.e. English, French or German (Art. 14(1)) (2) an official language of an EPC contracting state under Art. 14(4) (see A-VII, 1.1) ‒ the document can usually be read by a colleague if the search division member in charge is not familiar with this language (see B-VI, 6.2) (3) a language other than those of the EPC contracting states. In cases (2) and (3), the search division might consider citing an abstract in an official EPO language instead of the original document. If the original document is in a language the search division cannot readily understand (e.g. Chinese or Russian), it is best to cite the abstract. It is possible to obtain a machine translation of a patent document into an official EPO language. This machine translation will be made available to the applicant (see B-X, 12 and G-IV, 4). Alternatively, if only a specific paragraph of the machine translation is needed, the search division may copy that paragraph into the search opinion, but the full machine translation will be made available to the applicant as well. Non-official translations (i.e. translations with no legal value) of publications in a language the search division cannot readily understand (e.g. Russian, Japanese, Korean or Chinese) will not be cited in the search report."
                        },
                        "9.1.4": {
                            "content": "Supplementary European search report In certain circumstances, it is permissible not to cite any documents at all in a supplementary European search report under Art. 153(7) (see B-IV, 2.5). The search report will then include the phrase \"No further relevant documents disclosed\", but the search opinion (if applicable ‒ see B-XI, 7) will give an opinion on whether the claimed invention seems to be patentable over the state of the art cited in the international search report (B-XI, 1.1). Even if the search division disagrees with the ISA's opinion on the relevance of a document cited in the international search report for assessing the novelty and/or inventive step of the claimed invention, it normally does not cite the document again in the supplementary European search report with a new, corrected document category. The exception to this is where it wants to combine a first document falling under category Y (see B-X, 9.2.1) and not found until its supplementary European search with another document already cited in the international search report: it may then choose to cite the other document from the international search report again in its supplementary European search report as a \"Y\" document in combination with the first document. Where this recategorising of the document does not affect all the claims, this is clarified in the supplementary European search report in order to ensure consistency with the European search opinion."
                        }
                    }
                },
                "9.2": {
                    "content": "Categories of documents (X, Y, P, A, D, etc.) All documents cited in the search report are assigned to one of the categories explained in more detail below by placing the relevant letter in the first column of the citation sheets. Categories can be combined if necessary.",
                    "subsections": {
                        "9.2.1": {
                            "content": "Particularly relevant documents Where a document cited in the search report is particularly relevant, it is labelled with the letter \"X\" or \"Y\". Category \"X\" applies where a document shows on its own that a claimed invention cannot be considered novel or to involve an inventive step. Category \"Y\" applies where a document suggests that a claimed invention cannot be considered to involve an inventive step when the document is combined with one or more other documents of the same category and this combination is obvious to a person skilled in the art. However, if a document (called a \"primary document\") explicitly refers to another document as providing more detailed information on certain features (see G-IV, 8) and the combination of these documents is considered particularly relevant, the primary document is labelled with the letter \"X\", i.e. not \"Y\", and the document it refers to (the \"secondary document\") is labelled with \"X\" or \"L\" as appropriate."
                        },
                        "9.2.2": {
                            "content": "Documents defining the state of the art and not prejudicing novelty or inventive step Where a document cited in the search report represents state of the art that does not prejudice the novelty or inventive step of the claimed invention, it is labelled with the letter \"A\" (see, however, B-III, 1.1)."
                        },
                        "9.2.3": {
                            "content": "Documents which refer to a non-written disclosure Where a document cited in the search report refers to a non-written disclosure (e.g. conference proceedings), it is labelled with the letter \"O'' (see B-VI, 2). For oral disclosures that took place at an officially recognised exhibition (Art. 55(1)(b)), see B-VI, 5.5. The document category \"O\" is always accompanied by one of the letters explained in B-X, 9.2.1 and 9.2.2 to indicate its level of relevance. So e.g. \"O, X\", \"O, Y\" or \"O, A\"."
                        },
                        "9.2.4": {
                            "content": "Intermediate documents Documents published between the priority date claimed in the searched application ‒ or the earliest priority date if there is more than one (see B-VI, 5.2 and B-XI, 4) ‒ and its filing date are labelled with the letter \"P\". The letter \"P\" is also used for a document published on the very day of the earliest priority date claimed. The document category \"P\" is always accompanied by one of the letters explained in B-X, 9.2.1 and 9.2.2 to indicate its level of relevance. So e.g. \"P, X\", \"P, Y\" or \"P, A\"."
                        },
                        "9.2.5": {
                            "content": "Documents relating to the theory or principle behind the invention Where a document cited in the search report may be useful for a better understanding of the principle or theory behind the invention or shows that the reasoning or the facts behind it are incorrect, it is labelled with the letter \"T\". In the latter case, the \"T\" document is evidence within the meaning of Art. 117(1)(c) rather than prior art within the meaning of Art. 54(2) and so it does not matter whether it was published before or after the searched application's priority or filing date. For example: an applicant claims a group of chemical compounds and the description gives a generically defined process for their production. The search division finds a document published after the priority date which clearly shows that the generically defined process cannot produce all of the compounds covered by the claims. It can then cite it as a \"T\" document and use it to raise an Art. 84 objection that the claims are not supported by the description (see F-IV, 6.3)."
                        },
                        "9.2.6": {
                            "content": "Potentially conflicting patent documents Any patent document which has a filing or priority date before the searched application's filing date (not its priority date – see B-VI, 3 and B-XI, 4) but was published on or after that date and whose content could potentially constitute prior art relevant to novelty (Art. 54(1)) is labelled with the letter \"E\". This label is also assigned where the patent document and the searched application have the same filing date (see G-IV, 5.4). However, patent documents claiming the same priority as the searched application do not fall in this category and are not cited."
                        },
                        "9.2.7": {
                            "content": "Documents cited in the application When the search report cites documents already mentioned in the searched application's description, these are labelled with the letter \"D\" (see B-IV, 1.3)."
                        },
                        "9.2.8": {
                            "content": "Documents cited for other reasons Where the search report cites a document for reasons other than those referred to above (in particular as evidence – see B-VI, 5.6), for example because it: (a) casts doubt on a priority claim (see B-VI, 5.3) (b) establishes the publication date of another citation (see B-VI, 5.6) (c) is relevant to the issue of double patenting (see B-IV, 2.3(v) and G-IV, 5.4), it is labelled with the letter \"L\" and brief reasons for citing it are given. In the special case that the search division considers the claimed subject-matter to be notorious and so no documentary evidence is needed (see B-VIII, 2.2), it will give the reasoning behind not citing any prior-art documents in the search opinion. A citation of an \"L\" document does not need not be linked to any of the claims (see B-X, 9.3) unless the evidence it provides relates only to particular claims (e.g. it shows the priority claim is invalid for only some claims), in which case the claims affected must be specified."
                        }
                    }
                },
                "9.3": {
                    "content": "Relationship between documents and claims Each document cited in the search report is accompanied by an indication of the claims to which it relates, unless it falls in category \"L\" (see B-X, 9.2.8). The same document can be cited in different categories for different claims, but the specific claims it relates to in each category must be indicated. Example X WO9001867 A (WIDEGREN LARS (SE)) 8 March 1990 (1990-03-08) 1 Y * column 3, line 27 – line 43; figure 1 * 2-5 A * figure 2 * 6-10 The document cited in the above example discloses subject-matter which prejudices the novelty or inventive step of the subject-matter of claim 1 and, when the document is combined with another one cited in the search report, the inventive step of the subject-matter of claims 2 to 5 and which also represents non-prejudicial state of the art for the subject-matter of claims 6 to 10. The passages or figures are not necessarily relevant to the claims and the category indicated on the same line. Generally speaking, all claims are mentioned in the search report at least once in relation to at least one document published before the earliest priority date (unless a particular claim was not searched because the search was restricted as described in B-X, 8) (see B-IV, 2.5)."
                },
                "9.4": {
                    "content": "Identification of relevant passages in prior-art documents If a cited document is very long, the search division will identify the specific parts (e.g. claim, example, figure, table, text passage on a particular page, or a specific time or time range in a video and/or audio media fragment) which contain the technical subject-matter closest to (or coinciding with) the searched invention. This is particularly important where the document is relied on to support objections to novelty or inventive step. Where the search division relies on a translation of a prior-art document, it will indicate the relevant passages in the original document whenever possible. It makes sense to cite not only those parts of the document describing the same or similar technical subject-matter but also those parts or passages relating to the problem solved by that subject-matter. This makes it easier to assess inventive step in examination and also gives the applicant a better idea of how the document may be used during the proceedings."
                }
            }
        },
        "10. ": {
            "title": "Authentication and dates The search report shows the date on which it was drawn up, i.e. the date it was drafted by the search division member who carried out the search.",
            "subsections": {},
            "content": " The member's name must also appear on the search report."
        },
        "11. ": {
            "title": "Copies to be made available with the search report",
            "subsections": {
                "11.1": {
                    "content": "General remarks The search report is sent to the applicant and transmitted to the examining division. Copies of all the cited documents are made available to the applicant (see also B-IV, 3.3), except for those documents appearing in the search report after the \"&\" symbol which the search division has not earmarked for this (see B-X, 11.3). These cited documents are then used to assess the patentability of the claimed invention (see B-XI, 3) both in the search opinion (if applicable ‒ see B-XI, 7) and in the examination proceedings."
                },
                "11.2": {
                    "content": "Electronic version of cited document In the case of patent documents, a complete copy is made available. If a document has been published in electronic form only (see Rule 68(2) and OJ EPO 2000, 367), an electronic version is made available to the applicant. If only parts of it are not available in paper form, then at least those parts will be made available as an electronic version. At any rate, the applicant must ultimately be provided with the whole document either as a combination of paper and electronic versions or in electronic form only."
                },
                "11.3": {
                    "content": "Patent family members; the \"&\" sign In the case of patent families, only a copy of the family member actually cited is normally made available. The other members are mentioned in an automatically generated annex produced for information only (see B-X, 9.1.2). However, in certain circumstances one or more other patent documents in the same patent family may be mentioned on the search report after the \"&\" sign (see B-X, 9.1.2(i)). The search division may decide that copies of these patent documents should also be made available to the applicant (they will then be included in the examination file too, and can be referred to in any search opinion)."
                },
                "11.4": {
                    "content": "Reviews or books In the case of a review or a book, copies of the relevant pages are made available to the applicant. The relevant bibliographic information has to be clear from the these copies."
                },
                "11.5": {
                    "content": "Summaries, extracts or abstracts Where a document cited is a summary, extract or abstract of another, separately published document, a copy of the summary, extract or abstract is made available to the applicant. If, however, the search division considers that the whole source document is needed, that document must be cited and a copy must be made available to the applicant (see B-X, 9.1.2(ii)). When an online search in a database (e.g. CAS References, CAS Registry, COMPENDEX, INSPEC, NTIS) is performed and the original document referred to in the database is not available at the EPO when the search report is drafted, the extract is added to the file instead of the original."
                },
                "11.6": {
                    "content": "Citation of video and/or audio media fragments available on the internet Video and/or audio media fragments available on the internet are converted into a non-patent literature citation. The bibliographic data include the URL of the original location on the internet. If these citations cease to be available on the internet, a copy will be made available to the applicant on request (see G-IV, 7.5.6)."
                }
            }
        },
        "12. ": {
            "title": "Transmittal of the search report and search opinion The EPO forwards the search report and the search opinion (if applicable ‒",
            "subsections": {},
            "content": " see B-XI, 7) to the applicant and makes copies of all cited documents available to them (see B-X, 11.1), including any machine translations (see B-X, 9.1.3) and any documents appearing after the \"&\" sign that the search division has earmarked for this (see B-X, 11.3)."
        }
    },
    "Chapter XI – The search opinion": {
        "1. ": {
            "title": "Search opinion is part of the EESR The extended European search report (EESR) is made up of two items:",
            "subsections": {
                "1.1": {
                    "content": "The search opinion For European patent applications filed as of 1 July 2005 and international applications filed as of that date that enter the European phase, European search reports and supplementary European search reports will be accompanied by an opinion on whether the application and the invention dealt with seem to meet the EPC requirements. This does not apply in the cases referred to in B-XI, 7. The findings in the search opinion must be in line with the document categories assigned in the search report and with any other issues raised there, such as lack of unity of invention or any limitation of the search."
                },
                "1.2": {
                    "content": "Position of the examining division The examining division will consider any objections raised in the search opinion and the applicant's response to them (see B-XI, 8) when examining the application. It may change the position taken in the search opinion after receiving arguments, amendments and other submissions from the applicant in response to the search opinion or subsequently in examination proceedings. Irrespective of any such submissions, it may also alter the position if it finds Art. 54(3) state of the art when carrying out a top-up search or if it is made aware of additional state of the art either by the applicant or in observations filed by third parties under Art. 115 (see also B-IV, 3.2, C-IV, 7.3 and 7.4). The examining division can also reverse the findings in the search opinion for other reasons (see B-III, 1.1), but this is rare."
                }
            },
            "content": " (i) the European search report or the supplementary European search report (see B-X) (ii) the search opinion."
        },
        "2. ": {
            "title": "Basis for the search opinion Where a European patent application is not based on an international application, the applicant cannot amend it before receiving the search report. This means that the search opinion will always deal with the application documents as originally filed although it will also take account of any reply from the applicant to an invitation under Rule 63(1)",
            "subsections": {
                "2.1": {
                    "content": "Application documents filed under Rule 56 EPC, Rule 56a EPC, Rule 20.5 PCT or Rule 20.5bis PCT If the Receiving Section decided not to redate the application under Rule 56(2) or (5) or under Rule 56a(3) or (6), but the search division considers that the subsequently filed missing parts or correct application documents or parts are not \"completely contained\" in the priority document and/or the requirements of Rule 56(3) or Rule 56a(4) are not met, its search will also take into account prior art which would potentially become relevant for assessing novelty and inventive step of the subject-matter claimed if the application were redated under Rule 56(2) or (5) or under Rule 56a(3) or (6). The search opinion must include a warning that the application seems not to meet the requirements in Rule 56 or Rule 56a for keeping the accorded filing date, a statement of reasons as to why this is the case and an indication that a formal decision on whether to redate the application will be taken by the examining division at a later stage. If appropriate, the search opinion can also comment on the effect redating would have on the priority claim and/or the status of the prior-art documents cited in the search report. A similar procedure is followed for a Euro-PCT application. If the search division finds when carrying out a supplementary European search that the subsequently filed missing parts under Rule 20.5(d) PCT or, for international applications filed on or after 1 November 2022, correct application documents or parts under Rule 20.5bis(d) PCT are not \"completely contained\" in the priority document, even though the receiving Office did not redate the application, the search opinion must include a warning that the application does not seem to meet the requirements of Rule 20.6 PCT (Rule 82ter.1(c) PCT), a statement of reasons as to why this is the case and an indication that a formal decision on whether to redate the application will be taken by the examining division at a later stage. Conversely, if the application has been redated by the Receiving Section or the receiving Office, but the search division has reason to believe that it does meet the requirements of Rule 56(3) or Rule 56a(4) (or Rule 20.6 PCT), it must indicate in the search opinion that the examining division may reconsider the decisions of the Receiving Section (or the receiving Office) at a later stage unless it is bound by a decision of the board of appeal."
                },
                "2.2": {
                    "content": "Applications containing claims filed after the accorded filing date If the application documents contain any claims filed after the accorded filing date (Rules 40(1), 57(c) and 58), the search division has to examine whether those claims meet the requirements of Art. 123(2), i.e. do not go beyond the technical content of the application documents as they were at the filing date. If it finds that they do not meet the requirements, it will carry out the search as described in B-VIII, 6. Where the search opinion and search report are based on late-filed claims but the requirements in Rule 137(4) have not been met (see H-III, 2.1), a communication asking the applicant to meet these requirements (see H-III, 2.1.1) cannot be sent yet (i.e. before the search opinion is drawn up) because the examining division is still not responsible for the application (see C-II, 1). Once it does take charge of the application, it can send this communication, but only if the late-filed claims have not since been superseded (see H-III, 2.1.1) and only if the application is of one of the types listed in H-III, 2.1.4."
                }
            },
            "content": " (see B-VIII, 3.4). However, if it is based on an international application and undergoes a supplementary European search under Art. 153(7) (see B-II, 4.3), the applicant will have had an opportunity to amend it both in the international phase and on entry into the European phase. The search opinion will then be based on the application documents which the applicant has most recently asked to be processed (this may involve cancelling previously filed amendments and reverting to parts or all of an earlier set of application documents). The supplementary European search report will also relate to these application documents (see B-II, 4.3 and B-III, 3.3.2). Where the search opinion and supplementary European search report deal with amended application documents but the requirements in Rule 137(4) have not been met (see H-III, 2.1), a communication asking the applicant to meet these requirements (see B-VIII, 6 and H-III, 2.1.1) cannot be sent yet (i.e. before the search opinion is drawn up) because the examining division is still not responsible for the application (see C-II, 1). Once it does take charge of the application, it can send this communication, but only if the amendments in question have not since been withdrawn or superseded (see H-III, 2.1.1) and only if the application is of one of the types listed in H-III, 2.1.4."
        },
        "3. ": {
            "title": "Analysis of the application and content of the search opinion If the search division takes the view that the application and/or the invention do not meet the EPC requirements, then it will raise objections in the search opinion.",
            "subsections": {
                "3.1": {
                    "content": "The search division's dossier The search division's first step is to study the description, any drawings and the claims. For this, it will have access to the documents making up the European application and a complete history of the proceedings up to the start of search although the priority documents and any translations may not yet be available at this stage (see B-XI, 4)."
                },
                "3.2": {
                    "content": "Reasoning",
                    "subsections": {
                        "3.2.1": {
                            "content": "Reasoned objections For each objection, the search opinion must clearly specify which part of the application is deficient and which EPC requirement is not met, for instance by referring to specific articles or rules. It must also give the reason for the objection where this is not immediately apparent. For example, where a prior-art document is cited but only part of it is relevant, the specific passage relied on should be specified. If the cited prior art shows a lack of novelty or inventive step in the independent claim or claims and there is lack of unity between dependent claims as a result (see F-V, 7), the applicant is informed of this situation (see H-IV, 5.2(i)). Substantive matters are normally set out first. The search opinion should be drafted in a way that facilitates later examination of the amended application and, in particular, prevents the need to read it all again in depth (see C-IV, 2). In general, all claims are referred to, and all documents cited as \"X\" or \"Y\" against certain claims are referred to in the search opinion with a related objection. For dependent claims, it may not always be necessary to give detailed reasoning in the search opinion, but it at least needs to be apparent what the reason for the objection is."
                        },
                        "3.2.2": {
                            "content": "Positive statements Where applicable, the search division also comments positively on patentability in the search opinion. The amount of detail given should be enough to help applicants make their decisions. There is therefore no need to give such detailed reasoning as for an objection, but simply making a positive statement without explaining it will only be enough if the reason behind is anyway immediately apparent."
                        }
                    }
                },
                "3.3": {
                    "content": "Comments and amendments in response to the search opinion The applicant generally has to respond to the search opinion although there are some exceptions (see B-XI, 8)."
                },
                "3.4": {
                    "content": "Scope of first analysis for generally deficient applications Where an application is found to be generally deficient, the search division does not analyse it in detail, but sends the applicant a search opinion informing them of its view, mentioning the major deficiencies and saying that, when the application moves on to the examination stage, further examination will be deferred until the application has been amended to overcome them. There are cases where, although a meaningful analysis is possible, a fundamental objection arises, e.g. it is clear that certain claims lack novelty and that the statement of claim will have to be drastically recast, or there are substantial amendments (to an international application entering the European phase – see B-XI, 2) which are not allowable either because they add new subject-matter that was not in the application as filed (Art. 123(2)) or because they introduce other deficiencies (e.g. the amendment makes the claims unclear – Art. 84). It may then be more appropriate to deal with this objection before making a detailed analysis. For instance, if the claims need to be recast, it may not make sense to object to the clarity of some dependent claims or to a passage in the description which may anyway have to be amended or even deleted in examination proceedings as a result. However, if there are other major objections, these should be addressed. Generally speaking, the search division should try to deal with as many deficiencies as possible in the search opinion to help make the decision-making process in the later examination proceedings as efficient as possible. As regards positive statements on patentability in the search opinion, see B-XI, 3.2.2."
                },
                "3.5": {
                    "content": "Contribution to the known art When analysing the application, the search division concentrates on trying to understand what technical contribution the invention defined in the claims makes to the known art. This should normally be sufficiently clear from the application as filed. If it is not, the search division will raise an objection in the search opinion (see F-II, 4.5), but only if it is convinced it is necessary, because it might lead the applicant to add subject-matter in breach of Art. 123(2) (see H-IV, 2 and H-V)."
                },
                "3.6": {
                    "content": "EPC requirements Although the search division must bear all the EPC requirements in mind, the ones it is most likely to have to deal with are: sufficiency of disclosure (see F-III); clarity and support in the description, especially for the independent claims (see F-IV, 4 and 6); novelty (see G-VI); and inventive step (see G-VII)."
                },
                "3.7": {
                    "content": "Search division's approach The search division does not require or suggest amendments simply because it thinks they would improve the wording of the description or claims. It should not take a pedantic approach; what is important is that the meaning of the description and claims is clear. However, any serious inconsistencies between the claims and the description as filed are objected to (see F-IV, 4.3)."
                },
                "3.8": {
                    "content": "Making suggestions It is not for the search division to tell applicants to amend their application in a particular way to overcome an objection. It is the applicants' own responsibility to draft their application and they are free to amend it any way they choose as long as the amendment removes the deficiency and is otherwise in keeping with the EPC. However, it can sometimes help if the search division suggests, at least in general terms, an acceptable form of amendment, but it then has to make it clear that the suggestion is merely to help the applicant and that other forms of amendment will still be considered in the examination proceedings. Although not obliged to do so, it will point out amendments which would overcome the objections raised to the applicant if there is a clear way out. When suggesting an acceptable way of amending the claims, the search division will also invite the applicant to adapt the description to bring it into line with the amended claims (see F-IV, 4.3). However, the applicant remains responsible for deciding how to word the application and in particular for defining the subject-matter for which protection is sought (Art. 113(2) EPC)."
                },
                "3.9": {
                    "content": "Positive opinion After analysing the application as described in B-XI, 3.1 to 3.8, the search division may conclude that it and the claimed invention both satisfy the EPC requirements and it will then express a general positive opinion on the application documents in the search opinion. However, if a full search for all potentially conflicting applications under Art. 54(3) could not be carried out at this stage (see B-VI, 4.1), a top-up search will be needed at the examination stage (see C-IV, 7.1) and so the application remains open to any objections under Art. 54(3) raised then. A positive search opinion can be issued even where minor amendments would have to be made to the application documents for the application to be granted. So long as no prior art within the meaning of Art. 54(3) is found in any subsequent top-up search, the examining division can issue the Rule 71(3) communication and propose these minor amendments there (see C-V, 1.1). The applicant does not have to respond to a positive search opinion (see B-XI, 8). It is not possible at the search stage to officially designate an examining division, because the Receiving Section is still responsible for the application (Art. 16). However, the prospective members of the examining division will already be known and the search division will consult them to check that they agree to the issue of a positive search opinion."
                }
            },
            "content": " As a general rule, the search opinion covers all objections to the application (but see B-XI, 3.4). These objections can relate to substantive matters (e.g. the subject-matter is not patentable) or to procedural matters (e.g. one or more of the requirements in Rules 41 to 43, and 48 to 50 are not met; see Arts. 1 and 2 of the decision of the President of the EPO dated 25 November 2022, OJ EPO 2022, A113), or even to both. Where claims relating to a method of treatment of the human or animal body or methods of diagnosis practised on the human or animal body have been searched because it can already be envisaged at this stage that they will be reworded in an allowable format (see B-VIII, 2), the search opinion will nonetheless object to these claims as relating to subject-matter that is not patentable."
        },
        "4. ": {
            "title": "Priority claim and the search opinion When it is not possible to check the validity of the priority claim at the search stage, because:",
            "subsections": {
                "4.1": {
                    "content": "Use of \"P\" and \"E\" documents in the search opinion Where the search division refers to a document potentially amounting to prior art under Art. 54(3) in the search opinion, there are two possibilities, depending on whether or not it can conclusively establish that the prior-art document has an earlier relevant date than the application: if so, it will raise a novelty objection under Art. 54(3); if not, it will assume that any priority which cannot be checked is valid. This leads to two different scenarios: (i) The prior-art document belongs to the state of the art under Art. 54(3). The search division therefore raises a novelty objection in the search opinion and specifies which priorities have been assumed to be valid. (ii) The prior-art document does not belong to the state of the art under Art. 54(3). If the search opinion raises other kinds of objection in the search opinion, it will refer to the document potentially falling under Art. 54(3) (and its relevant passages) and will explain which priorities have been assumed valid. Where \"P\" documents are also cited in the search report and they are not potential prior art under Art. 54(3) (because they are not international or European patent applications), they may be prior art under Art. 54(2) and so be relevant for the assessment of novelty and inventive step in so far as the application's priority is invalid. If its priority can be checked, the search division will do so. If it finds that the priority is not valid, it will raise objections in the search opinion on the basis of the \"P\" documents. If the priority cannot be checked, it will assume it is valid and will not raise any objection in the search opinion. The issue of whether the priority claim or claims are valid then needs to be reviewed in examination (see F-VI, 2)."
                }
            },
            "content": " (i) the search is carried out before the date by when the priority document has to be supplied (up to 16 months from the earliest claimed priority – Rule 53(1)) (ii) a translation of the priority document is required but not available to the search division when drafting the search opinion (Rule 53(3), see A-III, 6.8 and its subsections, and F-VI, 3.4), the priority claim will usually be assumed to be valid for the purposes of the search opinion. Where the only objections which could be raised against the application at this stage depend on the priority being invalid, and the priority document (or its translation) is not available, the search division will issue an entirely positive search opinion without any objections. In case (ii) above, a communication under Rule 53(3) may be issued (see A-III, 6.8.1) and the priority's validity may later be reviewed in examination proceedings. However, if a priority claim's validity has to be assessed as a result of intermediate prior art or potential state of the art under Art. 54(3), and evidence against its validity is already available, then this needs to be brought up in the search opinion. For example, where the priority document is available when the search opinion is drafted and the technical features of the claims are not in the priority document, the search division may be able to do this even without a required translation if it is familiar with the language of the priority document (see also B-VI, 5.3)."
        },
        "5. ": {
            "title": "Unity in relation to the search opinion Where the search division finds that the claimed invention lacks unity",
            "subsections": {},
            "content": " (Art. 82 and Rule 44(1) and (2)), it will send the applicant an invitation to pay further search fees and a partial search report on the invention or unitary group of inventions first mentioned in the claims (see B-VII, 1.1, 1.2 and 1.3 and Rule 64(1)). It will also send a provisional opinion on the patentability of that invention or unitary group of inventions and the reasons for its non-unity findings (see B-VII, 1.2). After the time limit for paying the further search fees has expired, (Rule 64(1)) the applicant will be sent a search report on the invention or unitary group of inventions first mentioned in the claims and all other claimed inventions or unitary groups of inventions for which further search fees were paid. This search report will be accompanied by a search opinion setting out: (i) the reasoning behind the finding of a lack of unity (ii) an opinion on whether the first invention or unitary group of inventions mentioned in the claims is patentable (iii) an opinion on whether all inventions or unitary groups of inventions for which further search fees have been paid are patentable. For supplementary European search reports on Euro-PCT applications lacking unity of invention, the same procedure is followed (Rule 164(1) -  see B-VII, 2.3)."
        },
        "6. ": {
            "title": "The search opinion where the search was limited Any arguments and objections set out in the search opinion must be consistent with how and why the search was limited. This applies to limitations for reasons of non-patentability (e.g. business methods - Art. 52(2)(c), see B-VIII, 1), for reasons of severe deficiencies preventing a meaningful search (Rule 63, see B-VIII, 3) or due to a contravention of Rule 43(2) (Rule 62a, see B-VIII, 4). In these cases, the search opinion will also contain the information mentioned in B-VIII, 3.3 and 4.3.",
            "subsections": {},
            "content": " Where claims were not searched because the applicant had not paid the claims fees for them and so they were deemed abandoned (Rule 45 or Rule 162), this will be pointed out to the applicant in the search opinion."
        },
        "7. ": {
            "title": "No search opinion is issued Where an applicant has filed a request for examination under Rule 70(1)",
            "subsections": {},
            "content": " before being sent the search report and has waived the right to a communication under Rule 70(2) (see C-II, 1(ii)), the examining division becomes responsible for the application as soon as the search report is sent (Art. 18(1) and Rule 10(2)). If the application is deficient, the examining division will issue a communication under Art. 94(3) in place of the search opinion. If the applicant does not respond to this communication, the application will be considered withdrawn under Art. 94(4) (see C-III, 4.2). If the application is ready for grant, the procedure is as follows: (i) Where the search for conflicting applications under Art. 54(3) was complete, the examining division will issue a communication under Rule 71(3). (ii) Where the search for conflicting applications under Art. 54(3) was not complete, the applicant will be informed that the application can be granted so long as no state of the art under Art. 54(3) is found during the top-up search (see B-XI, 3.9). This is purely for information and the applicant does not have to respond."
        },
        "8. ": {
            "title": "Response to the extended European search report (EESR)",
            "subsections": {},
            "content": " Applicants have to respond to the search opinion within the time limit for filing the request for examination under Rule 70(1) (see C-II, 1 and A-VI, 2.1). However, where applicants filed a request for examination (which under Art. 94(1) means also paying the examination fee) before the search report and the search opinion were transmitted to them, they are sent a communication under Rule 70(2) asking them to confirm that they wish to continue with the application and setting a period for this (see C-II, 1(i)). They then also have to respond to the search opinion within that period. This is generally what happens for Euro-PCT applications for which a supplementary European search report and search opinion have to be drawn up (see B-II, 4.3 and E-IX, 2.5.3), unless the applicant has waived the right to a communication under Rule 70(2) (see C-II, 1(ii)), in which case the procedure under B-XI, 7 applies. If applicants do not respond to the search opinion in time, their application will be deemed to be withdrawn and they will be notified of this loss of rights accordingly. They can then request further processing in accordance with Art. 121 and Rule 135. Applicants are not required to respond to the European or supplementary European search report where it was drawn up before 1 April 2010, where it is not accompanied by a search opinion (see B-XI, 1.1 for applications for which a search opinion is drawn up) or where the search opinion was positive (see B-XI, 3.9). However, they may still respond to it under Rule 137(2) if they so wish, in which case they are encouraged to do so before the application moves on to the examination stage (see C-II, 1). Applicants can respond to the search opinion by filing amended application documents under Rule 137(2) (see C-II, 3.1) (where amended claims are filed before publication, see A-VI, 1.3, paragraph 3) or by filing observations on the objections raised, or even by filing both. Such amendments and observations will only be examined by the examining division if the application moves on to the examination stage. Making a procedural request, e.g. for a consultation or for oral proceedings, or simply disagreeing with the search opinion is not a valid response if done without commenting on any of the objections raised. Where such a request or simple disagreement is the only response received by expiry of the set time limit, the application deemed to be withdrawn under Rule 70a(3). The same applies where a request is filed that cannot be granted at this stage (e.g. for a decision according to the state of the file). If an applicant does not respond to a search opinion issued for an application for which the search report was drawn up before 1 April 2010 and the application moves on to the examination stage (see C-II, 1 and 1.1), the examining division will issue a communication referring to the search opinion and setting a time limit for a response as the first communication under Art. 94(3) (see C-III, 4). If the applicant does not respond to this communication in time, the application will be deemed to be withdrawn under Art. 94(4). Where an applicant files amendments in response to the search opinion but not in the way required under Rule 137(4) (see H-III, 2.1), the examining division may issue a communication under Rule 137(4) (see H-III, 2.1.1) relating to these amendments, but this can only happen after the examining division has become responsible for the application (see C-II, 1) and only if the application is one of the types listed in H-III, 2.1.4."
        },
        "9. ": {
            "title": "Art. 124 and the utilisation scheme When drafting the search opinion, the search division will consider any prior-art document provided by the applicant under Rule 141(1) or by the office of first filing under Rule 141(2)",
            "subsections": {},
            "content": " (see OJ EPO 2011, 62, OJ EPO 2012, 540, OJ EPO 2013, 216, OJ EPO 2015, A2, OJ EPO 2016, A18, OJ EPO 2019, A55, OJ EPO 2021, A38, and OJ EPO 2021, A39) if it is already available at the time (see A-III, 6.12 and B-IV, 1.3). Requests for information on prior art under Rule 141(3) cannot be made until the application has entered the examination phase (see C-III, 5)."
        }
    }
}